<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol.lst-kix_e7412hx00ks-7.start{counter-reset:lst-ctn-kix_e7412hx00ks-7 0}ul.lst-kix_5jw00p6f4y2r-8{list-style-type:none}ul.lst-kix_5jw00p6f4y2r-7{list-style-type:none}ol.lst-kix_e7412hx00ks-0.start{counter-reset:lst-ctn-kix_e7412hx00ks-0 0}ul.lst-kix_5jw00p6f4y2r-6{list-style-type:none}ul.lst-kix_5jw00p6f4y2r-5{list-style-type:none}ul.lst-kix_5jw00p6f4y2r-4{list-style-type:none}.lst-kix_e7412hx00ks-8>li{counter-increment:lst-ctn-kix_e7412hx00ks-8}ul.lst-kix_5jw00p6f4y2r-3{list-style-type:none}ul.lst-kix_5jw00p6f4y2r-2{list-style-type:none}ul.lst-kix_5jw00p6f4y2r-1{list-style-type:none}ul.lst-kix_5jw00p6f4y2r-0{list-style-type:none}.lst-kix_e7412hx00ks-3>li{counter-increment:lst-ctn-kix_e7412hx00ks-3}ol.lst-kix_e7412hx00ks-3.start{counter-reset:lst-ctn-kix_e7412hx00ks-3 0}ol.lst-kix_e7412hx00ks-4.start{counter-reset:lst-ctn-kix_e7412hx00ks-4 0}.lst-kix_e7412hx00ks-2>li{counter-increment:lst-ctn-kix_e7412hx00ks-2}ol.lst-kix_e7412hx00ks-8.start{counter-reset:lst-ctn-kix_e7412hx00ks-8 0}ol.lst-kix_e7412hx00ks-2.start{counter-reset:lst-ctn-kix_e7412hx00ks-2 0}.lst-kix_e7412hx00ks-1>li:before{content:"" counter(lst-ctn-kix_e7412hx00ks-1,lower-latin) ". "}ol.lst-kix_e7412hx00ks-5.start{counter-reset:lst-ctn-kix_e7412hx00ks-5 0}.lst-kix_e7412hx00ks-0>li:before{content:"" counter(lst-ctn-kix_e7412hx00ks-0,decimal) ". "}.lst-kix_e7412hx00ks-5>li:before{content:"" counter(lst-ctn-kix_e7412hx00ks-5,lower-roman) ". "}ol.lst-kix_e7412hx00ks-8{list-style-type:none}.lst-kix_e7412hx00ks-2>li:before{content:"" counter(lst-ctn-kix_e7412hx00ks-2,lower-roman) ". "}.lst-kix_e7412hx00ks-6>li:before{content:"" counter(lst-ctn-kix_e7412hx00ks-6,decimal) ". "}.lst-kix_e7412hx00ks-5>li{counter-increment:lst-ctn-kix_e7412hx00ks-5}.lst-kix_e7412hx00ks-0>li{counter-increment:lst-ctn-kix_e7412hx00ks-0}.lst-kix_e7412hx00ks-3>li:before{content:"" counter(lst-ctn-kix_e7412hx00ks-3,decimal) ". "}.lst-kix_e7412hx00ks-4>li:before{content:"" counter(lst-ctn-kix_e7412hx00ks-4,lower-latin) ". "}.lst-kix_e7412hx00ks-6>li{counter-increment:lst-ctn-kix_e7412hx00ks-6}ol.lst-kix_e7412hx00ks-2{list-style-type:none}ol.lst-kix_e7412hx00ks-3{list-style-type:none}ol.lst-kix_e7412hx00ks-0{list-style-type:none}ol.lst-kix_e7412hx00ks-1{list-style-type:none}ol.lst-kix_e7412hx00ks-1.start{counter-reset:lst-ctn-kix_e7412hx00ks-1 0}ol.lst-kix_e7412hx00ks-6{list-style-type:none}.lst-kix_e7412hx00ks-7>li:before{content:"" counter(lst-ctn-kix_e7412hx00ks-7,lower-latin) ". "}ol.lst-kix_e7412hx00ks-7{list-style-type:none}ol.lst-kix_e7412hx00ks-4{list-style-type:none}.lst-kix_e7412hx00ks-8>li:before{content:"" counter(lst-ctn-kix_e7412hx00ks-8,lower-roman) ". "}ol.lst-kix_e7412hx00ks-5{list-style-type:none}.lst-kix_5jw00p6f4y2r-7>li:before{content:"-  "}.lst-kix_e7412hx00ks-4>li{counter-increment:lst-ctn-kix_e7412hx00ks-4}ol.lst-kix_e7412hx00ks-6.start{counter-reset:lst-ctn-kix_e7412hx00ks-6 0}.lst-kix_5jw00p6f4y2r-4>li:before{content:"-  "}.lst-kix_5jw00p6f4y2r-8>li:before{content:"-  "}.lst-kix_e7412hx00ks-1>li{counter-increment:lst-ctn-kix_e7412hx00ks-1}.lst-kix_5jw00p6f4y2r-5>li:before{content:"-  "}.lst-kix_5jw00p6f4y2r-6>li:before{content:"-  "}.lst-kix_5jw00p6f4y2r-1>li:before{content:"-  "}.lst-kix_5jw00p6f4y2r-0>li:before{content:"-  "}.lst-kix_5jw00p6f4y2r-3>li:before{content:"-  "}.lst-kix_e7412hx00ks-7>li{counter-increment:lst-ctn-kix_e7412hx00ks-7}.lst-kix_5jw00p6f4y2r-2>li:before{content:"-  "}ol{margin:0;padding:0}table td,table th{padding:0}.c7{-webkit-text-decoration-skip:none;font-weight:400;text-decoration:underline;vertical-align:baseline;text-decoration-skip-ink:none;font-size:11pt;font-family:"Arial";font-style:normal}.c13{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:10pt;font-family:"Arial";font-style:normal}.c1{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c16{padding-top:0pt;padding-bottom:3pt;line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.c3{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left;height:11pt}.c17{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:26pt;font-family:"Arial";font-style:normal}.c4{color:#9900ff;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c10{padding-top:12pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:center}.c5{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c2{padding-top:12pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c11{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c14{text-decoration-skip-ink:none;-webkit-text-decoration-skip:none;text-decoration:underline}.c15{max-width:468pt;padding:72pt 72pt 72pt 72pt}.c0{color:#9900ff;font-weight:700}.c9{background-color:#ffffff}.c8{height:11pt}.c12{font-weight:700}.c6{color:#9900ff}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c9 c15 doc-content"><div><p class="c2 c8"><span class="c1"></span></p></div><p class="c16 title" id="h.pqt8kf34l1xn"><span class="c17">Session-1 Transcribed</span></p><p class="c3"><span class="c1"></span></p><p class="c11"><span class="c1">L:Author 1</span></p><p class="c11"><span class="c1">E: Author 2</span></p><p class="c11"><span>U: Author 3</span></p><p class="c3"><span class="c9 c13"></span></p><p class="c2"><span class="c1">0:00 - 1:35</span></p><p class="c2"><span class="c1">&nbsp;L: &Ouml;ncelikle herkese geldi&#287;i i&ccedil;in &ccedil;ok te&#351;ekk&uuml;r ederiz. Bug&uuml;n ayn&#305; &#351;ekilde bu oturumun kaydedilmesine izin verdi&#287;iniz i&ccedil;in te&#351;ekk&uuml;rler. Bug&uuml;n genel olarak proje s&#305;ras&#305;nda ortaya &ccedil;&#305;kan yaz&#305;l&#305;m eserlerinin (software artifacts) g&ouml;rsel bir &#351;ekilde analizinin ve bu ba&#287;lamda al&#305;nacak kararlarda destek sa&#287;layacak Software Artifact Analyzer (SAA) adl&#305; arac&#305; size tan&#305;tmak ve en &ouml;nemlisi sizin hem ara&ccedil; hakk&#305;nda hem de genel olarak d&uuml;&#351;&uuml;ncelerinizi &ouml;&#287;renmek i&ccedil;in topland&#305;k.</span></p><p class="c2"><span class="c4">L: First of all, we would like to thank everyone for coming. We also appreciate your permission to record this session today. Today, we are gathered to introduce you to a tool called Software Artifact Analyzer (SAA), which visually analyzes software artifacts that emerge during the project and supports decision-making in this context. Most importantly, we are here to learn your thoughts and feedback about both the tool and the general topic.</span></p><p class="c2"><span class="c1">1:35 - 2:16</span></p><p class="c2"><span class="c1">&nbsp;L: &#304;sterseniz biz bilgisayarlar&#305;m&#305;zdan g&ouml;r&uuml;nen wifi&#39;ye ba&#287;lanabilirsiniz. Bu s&#305;rada ben de k&#305;saca bug&uuml;n bu &ccedil;al&#305;&#351;mada yapacaklar&#305;m&#305;z&#305; &ouml;zetlemek istiyorum. &#304;lk olarak bu haftan&#305;n ba&#351;&#305;nda sizinle payla&#351;m&#305;&#351; oldu&#287;um &ouml;n ankette verdi&#287;iniz cevaplar &uuml;zerinden gidece&#287;iz. Onlar hakk&#305;nda konu&#351;aca&#287;&#305;z. Daha sonras&#305;nda ben genel olarak bu projede kulland&#305;&#287;&#305;m&#305;z konseptler hakk&#305;nda k&#305;sa bir anlat&#305;m yapaca&#287;&#305;m. Ard&#305;ndan size SAA arac&#305;m&#305;z&#305;n k&uuml;&ccedil;&uuml;k bir demosunu yapaca&#287;&#305;m ve &uuml;zerinden bir anlat&#305;m ger&ccedil;ekle&#351;tirece&#287;im.</span></p><p class="c2"><span class="c4">L: If you would like, you can connect to the visible WiFi from your computers. Meanwhile, I would like to briefly summarize what we will be doing in this session today. First, we will go over the responses you provided in the pre-survey that I shared with you at the beginning of this week. We will discuss them. After that, I will give a brief presentation on the concepts we use in this project. Following that, I will give a short demo of our SAA tool and provide an explanation.</span></p><p class="c2"><span class="c1">2:16 - 2:51 </span></p><p class="c2"><span class="c1">L: Daha sonras&#305;nda dedi&#287;imiz gibi sizden bu SAA arac&#305;n&#305; denemenizi isteyece&#287;iz ve bu baz&#305; yapman&#305;z i&ccedil;in size 2 tane k&uuml;&ccedil;&uuml;k g&ouml;rev verece&#287;iz. En sonunda da asl&#305;nda hem bu &ccedil;al&#305;&#351;ma boyunca ki deneyiminizi hem de genel d&uuml;&#351;&uuml;nce ve g&ouml;r&uuml;&#351;lerinizi payla&#351;man&#305;z a&ccedil;&#305;s&#305;ndan sizi baz&#305; sorular y&ouml;nlendirece&#287;iz ve bu sorular ba&#287;lam&#305;nda da tart&#305;&#351;man&#305;z&#305; isteyece&#287;iz. Bu &#351;ekilde &#351;imdi o zaman isterseniz &ouml;n anketle devam edelim. Bu arada ana amac&#305;m&#305;z sizin d&uuml;&#351;&uuml;nce ve g&ouml;r&uuml;&#351;lerinizi &ouml;&#287;renmek. O y&uuml;zden istedi&#287;iniz bir noktada istedi&#287;iniz gibi katk&#305; verebilirsiniz.</span></p><p class="c2"><span class="c4">L: Afterwards, as we mentioned, we will ask you to try out the SAA tool, and we will give you two small tasks to complete. At the end, we will ask you some questions to share your overall experience during this study as well as your general thoughts and opinions. We will then ask you to discuss these questions. Now, if you are ready, let&#39;s continue with the pre-survey. Meanwhile, our main goal is to learn your thoughts and opinions. Therefore, you can contribute at any point and in any way you like.</span></p><p class="c2"><span class="c1">2:51 - 3:41</span></p><p class="c2"><span class="c1">&nbsp;L: &#350;imdi ilk tur olaca&#287;&#305; i&ccedil;in ilk ba&#351;ta kendinizi tan&#305;t&#305;p ba&#351;larsan&#305;z di&#287;er kat&#305;l&#305;mc&#305;lar&#305;n da sizi tan&#305;mas&#305; ve herkesin birbirini daha iyi tan&#305;mas&#305; a&ccedil;&#305;s&#305;ndan.</span></p><p class="c2"><span class="c4">L: Since this is the first round, please start by introducing yourself so that other participants can get to know you and everyone can get to know each other better.</span></p><p class="c2"><span class="c1">L: Pre-Survey_1-2.Soru: &#304;lk ba&#351;ta asl&#305;nda hangi VCS ve Bug Tracking sistemlerini kulland&#305;&#287;&#305;n&#305;z&#305; sormu&#351;tuk size. Yan&#305;tlara g&ouml;re zaten buraya kat&#305;lan herkes git tabanl&#305; bir sistem kullan&#305;yor.</span></p><p class="c2"><span class="c6">L: Pre-Survey_1-2. Question: Initially, we asked you which VCS and Bug Tracking systems you use. According to the responses, everyone here uses a git-based system. </span></p><p class="c2"><span>L: Bu noktada i&#351;te ben bu arac&#305; kullan&#305;yorum &ccedil;&uuml;nk&uuml; &#351;u &#351;u y&uuml;zden diye bir a&ccedil;&#305;klama yapmak isteyen konu&#351;mak isteyen olur mu acaba?</span></p><p class="c2"><span class="c4">L: At this point, would anyone like to explain why they use this tool and share their reasons for doing so?</span></p><p class="c2"><span class="c1">(Cevap Yok) L: Tamam ge&ccedil;iyorum.</span></p><p class="c2"><span class="c4">(No Response) L: Okay, I&rsquo;ll move on.</span></p><p class="c2 c8"><span class="c1"></span></p><p class="c2"><span class="c1">3:41- 5:35 </span></p><p class="c2"><span class="c1">L: Pre-Survey_3.Soru: Daha sonraki sorumuzda ise size daha &ouml;nce hi&ccedil; g&ouml;rsel bazl&#305; bir yaz&#305;l&#305;m uygulamas&#305; kullan&#305;p kullanmad&#305;&#287;&#305;n&#305;z&#305; sormu&#351;tuk. 4 tane kat&#305;l&#305;mc&#305;m&#305;z kulland&#305;klar&#305;n&#305; beyan etmi&#351;. Bu ki&#351;iler konu&#351;mak ister mi acaba hangi ama&ccedil;la kullan&#305;yorlar veya hangi ara&ccedil;lar&#305; kullan&#305;yorlar?</span></p><p class="c2"><span class="c6">L: Pre-Survey_3. Question: In our next question, we asked whether you have ever used a visual-based software application before. Four participants stated that they have. Would these individuals like to speak about what purposes they use them for or which tools they use?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-3: Ben bu soruyu &ccedil;ok anlamad&#305;m, g&ouml;rselden kas&#305;t nedir burada?</span></p><p class="c2"><span class="c4">Participant 3: I didn&rsquo;t quite understand this question. What do you mean by &quot;visual&quot; here?</span></p><p class="c2"><span class="c1">L: Hocam genel olarak bir &#351;eyi yani nas&#305;l dersem asl&#305;nda hani belli diagramlar i&ccedil;eren veya grafik i&ccedil;eren herhangi bir ara&ccedil; olarak s&ouml;yleyebilirsiniz. Yani genel olarak proje s&uuml;resince yararland&#305;&#287;&#305;n&#305;z bu &#351;ekilde bir diyagram, bir g&ouml;rsel element i&ccedil;eren bir arac&#305; kastediyoruz.</span></p><p class="c2"><span class="c4">L: Generally speaking, you can think of it as any tool that includes certain diagrams or graphics. We are referring to any tool that includes a diagram or visual element that you have used throughout the project.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-3: Evet.</span></p><p class="c2"><span class="c4">Participant-3: Yes.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-1: Yani ben de evet diyenlerdenim i&#351;te bir &#351;eyle beraber</span></p><p class="c2"><span class="c6">Participant-1: So, I am one of those who said yes, and along with something.</span></p><p class="c2"><span class="c1">E: Hocam bir de kendinizi tan&#305;t&#305;r m&#305;s&#305;n&#305;z?</span></p><p class="c2"><span class="c4">E: Could you also introduce yourself, please?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-1: G&uuml;nayd&#305;nlar tekrardan ya. &#350;eyde uzun d&ouml;nem Havelsan&#39;da i&#351;te yaz&#305;l&#305;m m&uuml;hendisli&#287;i, yaz&#305;l&#305;m mimarl&#305;&#287;&#305; i&#351;te proje y&ouml;netimi, scrum masterl&#305;k, mimarl&#305;k falan genelde i&#351;lemler yapt&#305;k. Bir ara Havelsan&#39;&#305;n yaz&#305;l&#305;m geli&#351;tirme altyap&#305;s&#305;na bir el atm&#305;&#351;t&#305;k Eray hocamla beraber o zamanlar &ccedil;al&#305;&#351;m&#305;&#351;t&#305;k. Uzun d&ouml;nemde &#351;eylere bu ara&ccedil;lar&#305; kullanma f&#305;rsat&#305;m&#305;z oldu. Hatta b&uuml;t&uuml;nle&#351;ik olarak da nas&#305;l yap&#305;labilir diye kayg&#305;ya d&uuml;&#351;m&uuml;&#351;t&uuml;k. F&#305;rsatlar&#305;m&#305;z olmu&#351;tu. Buradaki sorunun tabii kapsam&#305; tam a&ccedil;&#305;k de&#287;il. Yani g&ouml;rselli&#287;in kademeleri &ccedil;ok &ccedil;ok farkl&#305; olabilir. Bende i&#351;te &#351;imdi mesela en son ald&#305;&#287;&#305;m Azure DevOps&#39;la beraber kullan&#305;r&#305;m. Kendiler hem work itemlar&#305; i&ccedil;in hem de source control itemlar&#305; i&ccedil;in b&ouml;yle normal ili&#351;kisel g&ouml;rsel var ama kastetti&#287;imiz g&ouml;rselli&#287;in g&uuml;c&uuml;yle kabiliyetini tam kestiremedi&#287;imiz i&ccedil;in evet, bak g&ouml;rselle&#351;tirme yap&#305;yorlar. Yani izleyebiliyorsunuz, navigate edebiliyorsunuz birisinden di&#287;erine ge&ccedil;ebiliyorsunuz falan i&#351;leri takip edebiliyorsun bunu sa&#287;l&#305;yor iyi k&ouml;t&uuml;. Ama kast&#305;m&#305;z&#305; anlamak a&ccedil;&#305;s&#305;ndan tabii do&#287;ru mu? Evet demek yanl&#305;&#351; m&#305;? Onu kestiremiyorum.</span></p><p class="c2"><span class="c6">Participant-1: Good morning again. Well, I have a long history with Havelsan in software engineering, software architecture, project management, scrum master roles, and architecture in general. At one point, we worked on Havelsan&#39;s software development infrastructure with Eray, and we had opportunities to use these tools extensively. We even worried about how to integrate them comprehensively. The scope of this question, of course, is not entirely clear. </span><span class="c6 c14">The levels of visualization can vary greatly. </span><span class="c6 c7">For example, with the Azure DevOps I am currently using, I use it for both work items and source control items. There are normal relational visuals, but we cannot fully understand the power and capabilities of the visualization being referred to here. So, yes, they do visualizations. You can track, navigate, and move from one item to another, following the work. But in terms of understanding what exactly is meant, is it right to say yes? Is it wrong? I can&#39;t quite determine that.</span></p><p class="c2"><span class="c1">5:35- 7:16 </span></p><p class="c2"><span class="c1">L: Genel olarak sorumuz size ne &ccedil;a&#287;r&#305;&#351;t&#305;r&#305;yorsa o &#351;ekilde sormay&#305; ama&ccedil;lad&#305;k.</span></p><p class="c2"><span class="c4">L: We intended to ask the question in whatever way it resonated with you.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-1: O zaman evet.</span></p><p class="c2"><span class="c4">Participant-1: Then yes.</span></p><p class="c2"><span class="c1">L: Ba&#351;ka bir yorumda bulunmak isteyen olur mu?</span></p><p class="c2"><span class="c4">L: Would anyone else like to comment?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-2: Ben bir yorumda bulunabilir miyim. Merhaba ben (Kat&#305;l&#305;mc&#305; ad&#305;), Novelabs adl&#305; bir &#351;irkette &ccedil;al&#305;&#351;&#305;yorum. Orada &#351;u an yaz&#305;l&#305;m geli&#351;tirici olarak &ccedil;al&#305;&#351;&#305;yorum. Daha &ouml;ncesinde farkl&#305; &#351;irketlerde &ccedil;al&#305;&#351;&#305;yordum ve bu &#351;irketlerde &ccedil;al&#305;&#351;&#305;rken yo&#287;un olarak bu visualization based software genel kullan&#305;m&#305; bizde m&uuml;&#351;teri analitiklerini grafikler halinde g&ouml;rmek. Bunlar d&#305;&#351;&#305;nda da yaz&#305;l&#305;mlar&#305;m&#305;z&#305;n loglar&#305;n&#305; incelemek, nas&#305;l davrand&#305;&#287;&#305;n&#305;n nas&#305;l paternlerin oldu&#287;unu g&ouml;rebilmek amac&#305;yla gene grafikler arac&#305;l&#305;&#287;&#305;yla g&ouml;rmek gibi yaz&#305;l&#305;mlar kulland&#305;k. Onun d&#305;&#351;&#305;nda da kendim y&uuml;ksek lisans yaparken en yo&#287;un olarak kulland&#305;&#287;&#305;m zaman bir social network isimli bir dersimiz vard&#305;. Orada i&#351;te &#351;eyler aras&#305;nda notlar aras&#305;ndaki ili&#351;kileri g&ouml;rebilmek i&ccedil;in kulland&#305;&#287;&#305;m&#305;z toollar vard&#305;. Daha &ccedil;ok benim akl&#305;ma gelen bunlard&#305; yani.</span></p><p class="c2"><span class="c6">Participant-2: May I comment? Hello, I am (Participant&#39;s name), and I work at a company called Novelabs. I currently work there as a software developer. Previously, </span><span class="c14 c6">I worked at different companies, and during my time there, we heavily used visualization-based software primarily to see customer analytics in graphical form. Additionally, we used such software to examine logs of our applications, to see how they behaved, and to identify patterns, all through graphical means. Besides that, while I was doing my master&#39;s degree, the time I used visualization tools the most </span><span class="c4">was during a course called Social Network. We used tools to see the relationships between notes. These are what mainly come to my mind.</span></p><p class="c2"><span class="c1">L: Hangi ama&ccedil;la kullan&#305;yordunuz? &Ouml;zellikle o dedi&#287;iniz ara&ccedil;lar&#305;?</span></p><p class="c2"><span class="c4">L: What was the purpose of using these tools, especially the ones you mentioned?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-2: Social network a&ccedil;&#305;s&#305;ndan kulland&#305;&#287;&#305;m&#305;z &#351;eyden bahsediyorsan&#305;z e&#287;er, orada g&ouml;rd&uuml;&#287;&uuml;m &#351;ey bu &#351;eyler aras&#305;nda. Bir ortamda bulunan bir &#351;ey networkte bulunan nodelar aras&#305;nda bulunan ili&#351;kileri bu paternleri &ccedil;&#305;kartabilmek, bunlar&#305; g&ouml;rebilmek amac&#305;yla kullan&#305;yorduk.</span></p><p class="c2"><span class="c4">Participant-2: If you are asking about the social network aspect, the main purpose was to identify and see the patterns and relationships between nodes in a network, within a certain environment.</span></p><p class="c2"><span class="c1">L: &Ccedil;ok te&#351;ekk&uuml;rler.</span></p><p class="c2"><span class="c4">L: Thank you very much.</span></p><p class="c2"><span class="c1">7:16-8:45 </span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-4: Ben de (Kat&#305;l&#305;mc&#305; ad&#305;), &#351;u an master &ouml;&#287;rencisiyim. 3 y&#305;ll&#305;k bir sekt&ouml;r deneyimim de var. Benim kullanma &#351;eklim yine ayn&#305; sizin gibi. Bir tane Social Network dersi alm&#305;&#351;t&#305;m. Onda da proje yap&#305;yorduk. O projede de biz de, hani developerlar ve en az&#305;ndan farkl&#305; commitler aras&#305;ndaki ili&#351;kileri g&ouml;sterecek bir &#351;ey yapal&#305;m diye, k&uuml;&ccedil;&uuml;k bir denememiz olmu&#351;tu.</span></p><p class="c2"><span class="c4">Participant-4: I am also (Participant&#39;s name), currently a master&#39;s student. I have 3 years of industry experience. My usage is similar to yours. I took a Social Network course. We were doing a project in that course. In that project, we also made a small attempt to show the relationships between developers and at least different commits.</span></p><p class="c2"><span class="c1">L: Ba&#351;ka bir katk&#305;da bulunmak isteyen olur mu?</span></p><p class="c2"><span class="c4">L: Would anyone else like to contribute?</span></p><p class="c2"><span>Kat&#305;l&#305;mc&#305;-3: Yani bizim de &#351;u an kulland&#305;&#287;&#305;m&#305;z ara&ccedil;lar var ama g&ouml;rselle&#351;tirme... Hay&#305;r m&#305; dedim, evet mi dedim, &ccedil;ok da hat&#305;rlam&#305;yorum ama b&uuml;y&uuml;k ihtimalle hay&#305;r deme ihtimalim y&uuml;ksek. Daha &ccedil;ok hani text tabanl&#305; ara&ccedil;lar kullan&#305;r&#305;z ama mesela hocam&#305;n dedi&#287;i gibi, mesela loglar&#305;n takibinde g&ouml;rsel bir arac&#305;m&#305;z var asl&#305;nda. &Ouml;yle d&uuml;&#351;&uuml;n&uuml;nce asl&#305;nda biz de kullan&#305;yormu&#351;uz gibi de d&uuml;&#351;&uuml;nebilirim. Yine veritaban&#305; tasar&#305;mlar&#305;, dizaynlar&#305; yaparken kulland&#305;&#287;&#305;m&#305;z &ccedil;e&#351;itli ara&ccedil;lar var. Onlar da asl&#305;nda bu kategoriye girerse belki onlar&#305; da kullan&#305;yoruz gibi de d&uuml;&#351;&uuml;nebiliriz ama </span><span class="c1">daha &ccedil;ok biz hani text tabanl&#305; &ccedil;al&#305;&#351;&#305;r&#305;z gibi de d&uuml;&#351;&uuml;n&uuml;yorum.</span></p><p class="c2"><span class="c4">Participant-3: Well, we also have tools that we use currently, but visualization... I don&#39;t remember if I said no or yes, but I probably said no. We mostly use text-based tools, but as my colleague mentioned, we do have a visual tool for tracking logs. So, thinking about it that way, I might say we use it too. We also have various tools we use for database design and designs. If those are considered in this category, we might say we use them too, but mostly we work with text-based tools, I think.</span></p><p class="c2 c8"><span class="c1"></span></p><p class="c2"><span class="c1">E: Siz nerede &ccedil;al&#305;&#351;&#305;yorsunuz hocam?</span></p><p class="c2"><span class="c4">E: Where do you work?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-3: DIA Yaz&#305;l&#305;m&#39;da &ccedil;al&#305;&#351;&#305;yorum. Uygulama geli&#351;tirme m&uuml;d&uuml;r&uuml;y&uuml;m orada.</span></p><p class="c2"><span class="c4">Participant-3: I work at DIA Software. I am the Application Development Manager there.</span></p><p class="c2"><span class="c1">L: Tamamd&#305;r, devam edelim.</span></p><p class="c2"><span class="c4">L: Alright, let&#39;s continue.</span></p><p class="c2"><span class="c1">8:45 - 9:54</span></p><p class="c2"><span class="c1">L: Pre-Survey_4. Soru: Daha sonras&#305;nda asl&#305;nda yine benzer bir soru sormu&#351;tuk. G&ouml;rselle&#351;tirmenin proje s&uuml;recindeki insightlar&#305; yani anlamam&#305;za katk&#305;s&#305;n&#305; sormu&#351;tuk. Genel olarak herkes zaten pozitif olarak de&#287;erlendirmi&#351;. Bu soru &uuml;zerinden yorum yapmak isteyen olur mu?</span></p><p class="c2"><span class="c4">L: Pre-Survey_4. Question: Then, we asked a similar question about the contribution of visualization to understanding insights during the project process. Generally, everyone evaluated it positively. Would anyone like to comment on this question?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-1: Do&#287;al ya, galiba evrimsel bir durum. Bizim g&ouml;rsel zekam&#305;z evrimsel olarak di&#287;er duyular&#305;m&#305;zdan daha ileride.</span></p><p class="c2"><span class="c6">Participant-1:</span><span class="c7 c6">&nbsp;It&#39;s natural, I think it&#39;s an evolutionary situation. Our visual intelligence is evolutionarily more advanced than our other senses.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-2: Ben 4 verenlerden birisi olarak, visualization i&ccedil;in &ccedil;ok kuvvetli bir ara&ccedil; olmas&#305;na ra&#287;men bazen baz&#305; abstraction orada yapt&#305;&#287;&#305;m&#305;z baz&#305; &ouml;zetlemeler bizim baz&#305; detaylar&#305; ka&ccedil;&#305;rmam&#305;za sebep olabiliyor diye d&uuml;&#351;&uuml;n&uuml;yorum. Onu onun pay&#305;n&#305; vererek tam de&#287;il de biraz daha eksik puan vermi&#351;tim.</span></p><p class="c2"><span class="c6">Participant-2: </span><span class="c7 c6">As one of the people who gave a 4, I think that although visualization is a very powerful tool, sometimes some abstractions and summaries we make there can cause us to miss some details. That&#39;s why I gave it a slightly lower score, considering that aspect.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-1: G&ouml;rselle&#351;tiren &ccedil;&#305;kard&#305;&#287;&#305; engelden bahsediyorsun. G&ouml;rselle&#351;tirici. &#350;ey, kapsay&#305;c&#305;l&#305;k a&ccedil;&#305;s&#305;ndan daha da kalabilir.</span></p><p class="c2"><span class="c4">Participant-1: You are talking about the obstacle created by visualization. Visualizer. Well, it can stay more in terms of inclusiveness.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-2: Evet, aynen &ouml;yle s&ouml;yl&uuml;yorum.</span></p><p class="c2"><span class="c4">Participant-2: Yes, that&#39;s exactly what I&#39;m saying.</span></p><p class="c2"><span class="c1">9:54 - 10:50 </span></p><p class="c2"><span class="c1">L: Pre-Survey_5.Soru: Di&#287;er sorumuzda da asl&#305;nda proje s&uuml;resince en fazla etkile&#351;ime ge&ccedil;ti&#287;iniz software artifact&#39;lar&#305; sormu&#351;tuk. Burada da g&ouml;rd&uuml;&#287;&uuml;m kadar&#305;yla en fazla kod dosyalar&#305;, issue&#39;lar, commit&#39;ler ve onu takip eden de pull request&#39;ler se&ccedil;ilmi&#351;. Bu sonu&ccedil;lar &uuml;zerine konu&#351;mak isteyen olur mu, sizce neden bu artifact&#39;lar daha &ouml;nde &ccedil;&#305;km&#305;&#351;?</span></p><p class="c2"><span class="c4">L: Pre-Survey_5. Question: In our other question, we asked which software artifacts you interacted with the most during the project. From what I can see here, the most frequent ones are code files, issues, commits, and followed by pull requests. Would anyone like to discuss why these artifacts are more prominent, in your opinion?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-1: Valla sizin Graph model&#39;e g&ouml;re de bak&#305;nca zaten d&ouml;rd&uuml;n&uuml; de kaps&#305;yorsunuz. File var, issue var, commit var. Pull request zaten arada yapay bir artifact belki ondan dolay&#305; tamaml&#305;yorum.</span></p><p class="c2"><span class="c4">Participant-1: Well, according to your Graph model, you already encompass all four. There are files, issues, commits. Pull requests are already artificial artifacts in between, so I might be completing it for that reason.</span></p><p class="c2"><span class="c1">L: Ge&ccedil;elim o zaman ilerleyelim.</span></p><p class="c2"><span class="c4">L: Let&#39;s move on then.</span></p><p class="c2"><span class="c1">10:50 - 12:30 </span></p><p class="c2"><span class="c1">L: Pre-Survey_6.Soru: Daha sonra, hi&ccedil; projelerinizde expert developer bulunmas&#305; i&ccedil;in harici bir ara&ccedil; kullan&#305;p kullanmad&#305;&#287;&#305;n&#305;z&#305; sormu&#351;tuk. 1 kat&#305;l&#305;mc&#305; kulland&#305;klar&#305;n&#305; s&ouml;ylemi&#351;. Nas&#305;l bir ara&ccedil; kullan&#305;yorlar? Ondan bahsedebilir mi?</span></p><p class="c2"><span class="c4">L: Pre-Survey_6.Question: Earlier, we asked whether you have ever used an external tool to find expert developers in your projects. One participant mentioned they have used such a tool. Can you elaborate on what kind of tool you use?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-1: Evet, evet yani tabii soruyu anlarken olabiliyor bu i&#351;te. Yani SonarQube ya da geli&#351;tirme ortam&#305;n&#305;n kendi &uuml;zerinde olan ara&ccedil;lardan bahsediyorum ben burada. Direkt t&uuml;m de&#287;i&#351;iklik olarak almayan partiler ama her iki noktada ayr&#305; ayr&#305; bar&#305;nabilen birisi developer&#39;&#305;n &ouml;n&uuml;nde bar&#305;nabilen onlar mesela grafik yetenekleri daha farkl&#305; olabiliyor. Ayr&#305; ayr&#305; kar&#351;&#305;la&#351;t&#305;rabiliyor. Ya da i&#351;te SonarQube gibi uygulamalar ba&#351;ka &#351;eyler de &ccedil;&#305;karabiliyor. Yani t&uuml;mle&#351;ik olmayan yap&#305;m&#305;n haricinde. Kastetti&#287;im buydu.</span></p><p class="c2"><span class="c4">Participant-1: Yes, yes, well, of course, it depends on how you interpret the question. I was referring to tools like SonarQube or those built into the development environment. They are not directly integrated with all changes but can reside separately, like graphics capabilities that can vary. They can compare separately. Or applications like SonarQube can reveal other things outside of the integrated structure. That&#39;s what I meant. </span></p><p class="c2"><span class="c1">U: Onlar do&#287;rudan expert ya da reviewer &ouml;neriyor mu?</span></p><p class="c2"><span class="c4">U: Do they directly suggest experts or reviewers?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-1: Asl&#305;nda &ouml;neriyorlar ya, &#351;ey.</span></p><p class="c2"><span class="c4">Participant-1: Actually, they do, sort of. </span></p><p class="c2"><span class="c1">U: Yoksa siz analizi yap&#305;nca m&#305; &ccedil;&#305;kar&#305;yorsunuz? Yani do&#287;rudan isim veriyorlar m&#305; size, yani &#351;u &#351;ey i&ccedil;in mesela pull request i&ccedil;in ya da &#351;u file i&ccedil;in expert gibi.</span></p><p class="c2"><span class="c4">U: Or do you derive it from the analysis? Do they give you direct names, like suggest</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-1: Ha yok yok i&#351;te pipeline analizi diye ondan dolay&#305; s&ouml;yl&uuml;yorum zaten direkt pipeline&#39;da yer alm&#305;yorlar, d&uuml;z ak&#305;&#351;ta yer alm&#305;yorlar, harici olarak ba&#351;vuruyorsunuz, detayland&#305;rma i&ccedil;in ba&#351;vuruyorsunuz. Yoksa &#351;eyde yani SonarQube de asl&#305;nda d&uuml;z ak&#305;&#351;ta direkt yer alan bir ara&ccedil; de&#287;il. O da kendi kendine giri&#351; &ccedil;&#305;k&#305;&#351; yap&#305;yor.</span></p><p class="c2"><span>Participant-1: No, no, that&#39;s why I mentioned pipeline analysis. They are not directly part of the </span><span class="c4">pipeline or flow. You refer to them externally for detailing. Otherwise, SonarQube itself is not directly part of the flow either. It operates independently.</span></p><p class="c2"><span class="c1">L: Devam edelim.</span></p><p class="c2"><span class="c4">L: Let&rsquo;s continue.</span></p><p class="c2"><span class="c1">12:30 - 13:22</span></p><p class="c2"><span class="c1">&nbsp;L: Pre-Survey_7.Soru: Son sorumuzda da asl&#305;nda process smelleri ile ne kadar tan&#305;d&#305;k oldu&#287;unuzu, ne kadar bildi&#287;inizi sormu&#351;tuk. Kat&#305;l&#305;mc&#305;lar&#305;n &ccedil;o&#287;u zaten bu konu hakk&#305;nda bilgisi varm&#305;&#351; ayn&#305; zamanda. &Ccedil;al&#305;&#351;ma ortam&#305;n&#305;zda daha &ouml;nce hi&ccedil; process anomalilerini tespit eden bir uygulama kullanm&#305;&#351; m&#305;yd&#305;n&#305;z diye sormu&#351;tuk. Fakat san&#305;r&#305;m kullanan olmam&#305;&#351;.</span></p><p class="c2"><span class="c4">L: Pre-Survey_Question 7: In our last question, we asked about your familiarity with process smells and how much you know about them. Most participants seem knowledgeable on this topic. We also asked if you have ever used an application to detect process anomalies in your work environment, but it seems no one has. </span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;-1: &Ouml;yle bir uygulama var m&#305;?</span></p><p class="c2"><span class="c6">Participant-1: Is there such an application?</span></p><p class="c2"><span class="c1">E: Var hocam.</span></p><p class="c2"><span class="c4">E: Yes, there is.</span></p><p class="c2"><span class="c1">E: Son kat&#305;l&#305;mc&#305; siz de kendinizi tan&#305;t&#305;r m&#305;s&#305;n&#305;z?</span></p><p class="c2"><span class="c4">E: Could the last participant introduce themselves?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 5: Ben de Dia yaz&#305;l&#305;mda &ccedil;al&#305;&#351;&#305;yorum, kat&#305;l&#305;mc&#305; 3 ile birlikte orada software developer olarak &ccedil;al&#305;&#351;&#305;yorum.</span></p><p class="c2"><span class="c4">Participant-5: I work at Dia Software as a software developer alongside Participant 3. </span></p><p class="c2"><span class="c1">14:34 - 17:50 </span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Yani biz kullan&#305;c&#305; olarak ben bunu nas&#305;l kullanaca&#287;&#305;m, hangi de&#287;eri alaca&#287;&#305;m? Bu ara&ccedil; ile analiz yapma motivasyonumuz ne, yani?</span></p><p class="c2"><span class="c4">Participant-1: As a user, how would I use this? What value would I get? What is the motivation to perform analysis with this tool?</span></p><p class="c2"><span class="c1">L: Karar alma durumlar&#305;nda destek sa&#287;lamak (A&ccedil;&#305;klama &Ccedil;al&#305;&#351;ma &Ouml;zetlenir)</span></p><p class="c2"><span class="c4">L: To support decision-making situations (Explanation of Study Summarized)</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Geli&#351;tiricinin mi yoksa y&ouml;neticinin mi?</span></p><p class="c2"><span class="c4">Participant-1: For developers or managers?</span></p><p class="c2"><span class="c1">U: Geli&#351;tiricinin de y&ouml;neticinin de yani. Y&ouml;netici de mesela &#351;&ouml;yle sorular&#305; yan&#305;tlayabilir i&#351;te. Herhangi bir file ya da file grubu hakk&#305;nda ekspert arad&#305;&#287;&#305; zaman iyi bir expert bulamazsa i&#351;te burada eksi&#287;imiz var diyebilir ya da o konuda sadece bir expert bulursa ya bu adam giderse ne yapar&#305;z diyebilir. Yani &ouml;yle &#351;eyler yapabilir ama daha da &ouml;nemlisi mevcut sistemde var olan problemleri dikkat etmek, yani anormallikleri tespit etmek, birileri tutarl&#305; olarak i&#351;te kendi a&ccedil;t&#305;&#287;&#305; issue&#39;lar&#305;. Kendi kapat&#305;yorsa bu ho&#351; bir &#351;ey de&#287;il. Yani bunlar&#305; yakalamak &ouml;rne&#287;in. Yani bu sadece bir &ouml;rnek, yani developer process s&#305;ras&#305;nda al&#305;nan kararlara destek vermek en &ouml;nemlisi yani.</span></p><p class="c2"><span class="c4">U: For both developers and managers. A manager, for example, can answer questions like if they are looking for an expert on any file or group of files and cannot find a good one, they might identify it as a gap. Or if they find only one expert, they might think, &quot;What will we do if this person leaves?&quot; More importantly, it&#39;s about identifying existing problems in the system, like detecting anomalies. For instance, if someone consistently opens and closes their own issues, that&#39;s not a good practice. It&#39;s about catching such things. This is just one example. The most important thing is to support decision-making during the developer process.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 3: Kodun kalitesi mesela bununla benzer bir &ouml;l&ccedil;&uuml;m yap&#305;l&#305;yor mu?</span></p><p class="c2"><span class="c1">E: (&Ccedil;al&#305;&#351;man&#305;n scope&#39;u anlat&#305;l&#305;r)</span></p><p class="c10"><span class="c1">20:10 - 29:55 ( Presentation Session About the Concepts)</span></p><p class="c10"><span class="c1">30:00 - 47:27 (BREAK)</span></p><p class="c10"><span class="c1">47:27 - 01:08:56 ( SAA DEMO)</span></p><p class="c2"><span class="c1">51:06 - 52:10</span></p><p class="c2"><span class="c1">&nbsp;Kat&#305;l&#305;mc&#305; 1: Bu gruplara bir d&#305;&#351; etiket g&uuml;zel olabilir.</span></p><p class="c2"><span class="c4">Participant 1: A label on these groups would be nice.</span></p><p class="c2"><span class="c1">L: Nas&#305;l bir etiket hocam?</span></p><p class="c2"><span class="c4">L: What kind of label?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Ya biraz uzakla&#351;&#305;nca levhas&#305; mesela g&ouml;remiyoruz ya tam g&ouml;z&uuml;km&uuml;yor, daha b&uuml;y&uuml;k, developer&#39;&#305;n ismini yazma. Grup &uuml;zerine bir etiket g&uuml;zel olabilir.</span></p><p class="c2"><span class="c4">Participant 1: You know, when you move away a bit, you can&rsquo;t see the sign clearly. Writing the developer&#39;s name bigger on the group would be nice.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Bu mesela collapse etti&#287;iniz zaman ili&#351;kiler &ccedil;ok da g&ouml;z&uuml;k&uuml;yor ya o da alg&#305;lamay&#305; zorla&#351;t&#305;r&#305;yor. &Ccedil;oklu ili&#351;kiye gerek yok, tekli olmas&#305; yeterli.</span></p><p class="c2"><span class="c4">Participant 1: When you collapse it, the relationships become less visible, making it harder to understand. Single relationships are sufficient; multiple relationships are not necessary.</span></p><p class="c2"><span class="c1">53:11 - 1:00:28 </span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: E &#351;u an operasyonel seviyede de&#287;iliz zaten. Yani ge&ccedil;mi&#351; veri i&ccedil;in kullan&#305;m amac&#305;m&#305;z nedir bunda?</span></p><p class="c2"><span class="c4">Participant 1: We are not at an operational level right now. So, what is our purpose for using historical data in this?</span></p><p class="c2"><span class="c1">L: Hocam onu da &#351;&ouml;yle d&uuml;&#351;&uuml;nebiliriz mesela siz g&uuml;nde bir kez SAA verisini g&uuml;ncelleyip asl&#305;nda operasyonel seviyede tutabilirsiniz.</span></p><p class="c2"><span class="c4">L: You can update the SAA data once a day to keep it at an operational level.</span></p><p class="c2 c8"><span class="c1"></span></p><p class="c2"><span class="c1">U: Operasyonel ortam olarak d&uuml;&#351;&uuml;nebilirsiniz. Bunun d&uuml;zenli olarak g&uuml;ncellendi&#287;ini farz ederim.</span></p><p class="c2"><span class="c4">U: You can think of it as an operational environment. Assume it is regularly updated.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Yani &ouml;yle bakt&#305;&#287;&#305;m&#305;z zaman bunun do&#287;al yeri asl&#305;nda &#351;ey i&#351;lemin ger&ccedil;ekle&#351;tirildi&#287;i yerdir ya o daha pull request y&ouml;neten yer neresi git. Git&#39;in &uuml;zerinde falan olmas&#305; laz&#305;m. Yani bu git&#39;e eklenti olmas&#305; laz&#305;m. Bu &#351;eyin &ouml;zelli&#287;i git&#39;te yer alan bir &#351;ey olmas&#305; gerekebilir. Oraya ajan koyman gerek, ters ajan.</span></p><p class="c2"><span class="c4">Participant 1: When we look at it that way, the natural place for this is where the process is carried out, like where pull requests are managed, which is Git. It should be on Git. It needs to be a feature within Git. You would need an agent there, a reverse agent.</span></p><p class="c2"><span class="c1">E: Orada da var zaten.</span></p><p class="c2"><span class="c4">E: It&#39;s already there.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: &#350;imdi d&uuml;&#351;&uuml;n&uuml;yorum ki zaten biz var olan veriler aras&#305;nda geriye d&ouml;n&uuml;k bir &ccedil;al&#305;&#351;ma yap&#305;yoruz. &#350;u anki &#351;ey yakla&#351;&#305;k regresif bir yakla&#351;&#305;m. Do&#287;al olarak &#351;u ana kadar bulundu&#287;umuz yer operasyonel de&#287;il. Bu pull request a&ccedil;&#305;k olabilir veya kapanm&#305;&#351; gitmi&#351; de olabilir. Yani i&#351;lemi tamamlanm&#305;&#351; da olabilir. Burada reviewere &ouml;nermemizin de&#287;eri nedir?</span></p><p class="c2"><span class="c4">Participant 1: We are currently working with existing data retrospectively. Our current approach is approximately regressive. Naturally, we are not at an operational level yet. This pull request may be open or closed and completed. So, what is the value of recommending a reviewer here?</span></p><p class="c2"><span class="c1">E: Tamam, iki &#351;ey var. Burada incremental olarak d&uuml;&#351;&uuml;nelim.</span></p><p class="c2"><span class="c4">E: Okay, let&#39;s think incrementally.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Orada da &#351;&ouml;yle d&uuml;&#351;&uuml;n hocam. Yani ben GitHub kullan&#305;yorum. Bu da ayr&#305; bir ara&ccedil; gibi d&uuml;&#351;&uuml;n&uuml;yorum. Yani GitHub&#39;&#305;n i&ccedil;erisinde g&ouml;m&uuml;ld&uuml;yse problem g&uuml;zel &ccedil;&ouml;z&uuml;lm&uuml;&#351; oluyor ama ayr&#305;ysa iki ara&ccedil; kullanmay&#305; &ouml;neriyorsun demektir.</span></p><p class="c2"><span class="c4">Participant 1: Think of it this way. I use GitHub, and I see this as a separate tool. If it&#39;s embedded within GitHub, the problem is nicely solved, but if it&#39;s separate, you&#39;re suggesting using two tools.</span></p><p class="c2"><span class="c1">E: Yok yok bizim zaten GitHub botumuz da var.</span></p><p class="c2"><span class="c4">E: No, no, we also have a GitHub bot.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: GitHub&#39;daki pull request&#39;in i&ccedil;ine bunu konumland&#305;rman gerekecek. Ayr&#305; bir h&uuml;cre olarak. Bir eklenti gibi &#351;uradaki kutuyu oraya koymam&#305;z gerekecek i&#351;te.</span></p><p class="c2"><span class="c4">Participant 1: You would need to place this within the GitHub pull request, as a separate cell. Like an add-on, we would need to place the box there.</span></p><p class="c2"><span class="c1">E: Tamam, bizim GitHub&#39;u konfig&uuml;re etti&#287;imiz zaman &#351;ey yapabilir zaten pull request a&ccedil;&#305;ld&#305;&#287;&#305; zaman arkada bunu &ccedil;al&#305;&#351;t&#305;r&#305;r. Buraya linkli buraya da gelebilir. Yani &ouml;yle diyorsun de&#287;il mi?</span></p><p class="c2"><span class="c4">E: Okay, when we configure GitHub, it can already run this in the background when a pull request is opened. It can link here as well. That&rsquo;s what you mean, right?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: O zaman orada olmaz. Operasyonda olmas&#305; laz&#305;m.</span></p><p class="c2"><span class="c4">Participant 1: Then it should be in operations.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 4: Anlad&#305;&#287;&#305;m kadar&#305;yla GitHub&#39;da da reviewer suggestion ederken mesela o file&#39;dan &ouml;nceden &ccedil;al&#305;&#351;anlar&#305; yani &ouml;rnek veriyor. Mesela &#351;unlar recommended reviewer diyor galiba. Siz &ouml;yle bir &#351;ey ar&#305;yorsunuz. Hani direkt GitHub&#39;&#305;n kendi sayfas&#305;nda verebilirim, y&ouml;nlendirmek yerine diyorlar.</span></p><p class="c2"><span class="c4">Participant 4: As far as I understand, GitHub also recommends reviewers, for instance, suggesting those who have previously worked on that file. They say something like these are recommended reviewers. You are looking for something like that, to provide directly on GitHub&#39;s own page instead of redirecting.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: O zaman tam senin dedi&#287;in sana o zaman.</span></p><p class="c2"><span class="c1">E: &#304;ki taraf da var yani GitHub&#39;dan SAA&#39;ya gelmek de var, SAA&#39;dan GitHub&#39;a gitmek de.</span></p><p class="c2"><span class="c4">E: There are two sides to this, both coming from GitHub to SAA and going from SAA to GitHub.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: De&#287;erlendirmesinin sonucunu direkt GitHub yani reviewere &ouml;nermesi ile beraber operasyonel seviye e&#287;itimden ge&ccedil;ecek. &Ccedil;izim kanvas&#305;nda konmas&#305; gerekecek.</span></p><p class="c2"><span class="c4">Participant 1: The outcome of the assessment should be directly suggested to the reviewer in GitHub, passing through the operational level. It should be placed on the drawing canvas.</span></p><p class="c2"><span class="c1">L: Hocam onu da &#351;u &#351;ekilde yapabiliyoruz. Foto&#287;raf&#305;n&#305; koyabiliyoruz.</span></p><p class="c2"><span class="c4">L: We can do that by adding a photo.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Bak &#351;&ouml;yle d&uuml;&#351;&uuml;n, ben &#351;imdi geli&#351;tiriciyim ya da mesela geli&#351;tirme y&ouml;neticisiyim. Pull request a&ccedil;&#305;ld&#305;. Tamam pull request a&ccedil;&#305;ld&#305;ktan sonra kimin konmas&#305; gerekiyor. Hatta onun otomatik hale getirmek gerekir. &Ouml;nerilerini birinci koy yani de&#287;i&#351;tirilmezse devam eder diyebiliriz. &Uuml;retici taraf&#305; i&#351;in. Ama operasyonda seviye i&#351;ledi. Kural ihlaline bakm&#305;yoruz, kural koyuyor muyuz bilmiyorum.</span></p><p class="c2"><span class="c6">Participant 1: Think of it this way, I am a developer or a development manager. A pull request is opened. After the pull request is opened, it needs to be automatically suggested who should be assigned to it. We can say that if the suggestions are not changed, they continue as is. That&#39;s the production side of things. But at the operational level, we need to see if a rule violation occurred. I don&#39;t know if we are setting rules.</span></p><p class="c2"><span class="c1">E: O process analiz var da bu dedi&#287;ini yani g&uuml;zel bunu kolayl&#305;kla yapabiliriz diyorum ya yani orada botumuz var zaten, botumuz kendi kendine trigger olacak.</span></p><p class="c2"><span class="c4">E: There is process analysis, and we can do this easily because we already have a bot that triggers itself.</span></p><p class="c2"><span class="c1">U: &#304;nsanlar n tool kullan&#305;yorsa mesela n+1 tool elbette istemez ama n+1 toolun i&ccedil;inde n toolun yapamad&#305;&#287;&#305; bir &#351;ey varsa ne yapacak, n+1 kullanmam m&#305; diyeceksin yani? &Ouml;yle de d&uuml;&#351;&uuml;nebiliriz.</span></p><p class="c2"><span class="c4">U: If people are using n tools, they certainly wouldn&#39;t want n+1 tools unless the n+1 tool can do something that the n tools can&#39;t. In that case, wouldn&#39;t they use n+1?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Ben hay&#305;r derim genelde.</span></p><p class="c2"><span class="c4">Participant 1: I would generally say no.</span></p><p class="c2"><span class="c1">U: Ka&ccedil; tane tool kullan&#305;yorsunuz siz mesela?</span></p><p class="c2"><span class="c4">U: How many tools do you use, for example?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Normalde en az seviyede olmas&#305;n&#305; istiyorum. Bir veya ikinin d&#305;&#351;&#305;na pek fazla &ccedil;&#305;kmak istemiyorum &ccedil;&uuml;nk&uuml; zaten y&ouml;netemiyorum, kafa olarak da y&ouml;netemiyorum.</span></p><p class="c2"><span class="c4">Participant 1: I usually want to keep it to a minimum. I don&#39;t want to go beyond one or two because I can&#39;t manage it, mentally as well.</span></p><p class="c2"><span class="c1">E: Tamam olay &#351;u, varsa orada bizim GitHub botumuz direkt bunu run edip orada g&ouml;sterseydi bu &ccedil;&ouml;z&uuml;ld&uuml; de&#287;il mi? Tamam okey bu zaten yap&#305;labilir bir durum, bu g&uuml;zel bence.</span></p><p class="c2"><span class="c4">E: Okay, so if our GitHub bot runs this directly and shows it there, the problem is solved, right? This is already doable, and I think it&#39;s good.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Ben ba&#351;aram&#305;yorum yani birden fazla tool kullanmay&#305;.</span></p><p class="c2"><span class="c4">Participant 1: I can&#39;t manage using more than one tool.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 4: Ben junior developer olarak ilk geldi&#287;imde reviewer aramak i&ccedil;in yeteri kadar &#351;ey olmu&#351;tum. Art&#305;k &ouml;yle bir &ccedil;aresizli&#287;e girmi&#351;tim ki. Ba&#351;ka bir tool&#39;u kullanmak mesela beni o kadar rahats&#305;z etmezdi.</span></p><p class="c2"><span class="c4">Participant 4: When I first started as a junior developer, I didn&#39;t have enough experience to find a reviewer. I was so desperate that using another tool wouldn&#39;t have bothered me that much.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Ayr&#305; bir konuda, ge&ccedil;mi&#351; verilere dayand&#305;&#287;&#305; i&ccedil;in var olana tap&#305;nmaya neden olabilir. Ge&ccedil;mi&#351; bug&uuml;n de kendini tekrar etti&#287;i zaman mutlaka ikinci ki&#351;inin olmas&#305; laz&#305;m. Daha az kalifiye olan falan &#351;imdi o manuel operasyona ya da rotasyona girmesi laz&#305;m gibi.</span></p><p class="c2"><span class="c4">Participant 1: On a separate note, relying on historical data can cause us to idolize the existing data. When the past repeats itself today, there must be a second person involved. Less qualified people should manually or rotationally handle this.</span></p><p class="c2"><span class="c1">U: Visualization getirdi&#287;i ba&#351;ka avantajlar var yani? Normalde sadece bir tool&#39;un &ouml;nerdi&#287;i skora bakmaks&#305;z&#305;n visualization sayesinde karar&#305;n&#305;z&#305; da de&#287;i&#351;tiriyorsunuz. Biraz daha devam edersek g&ouml;rece&#287;iz.</span></p><p class="c2"><span class="c4">U: Visualization brings other advantages. Normally, without looking at the score suggested by just one tool, visualization can also change your decision. We will see more if we continue a bit.</span></p><p class="c2"><span class="c1">1:01:00 - 1:05:20</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Skor hesab&#305; da &ccedil;ok desteklenen bir konu de&#287;il asl&#305;nda.</span></p><p class="c2"><span class="c4">Participant 1: Score calculation is not a highly supported topic, actually.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 3: Bu skor nas&#305;l hesaplan&#305;yor? Mesela biz 3.34&#39;&uuml; nas&#305;l anlamal&#305;y&#305;z?</span></p><p class="c2"><span class="c4">Participant 3: How is this score calculated? For example, how should we interpret a score of 3.34?</span></p><p class="c2"><span class="c1">L: &#350;imdi asl&#305;nda &ccedil;ok detaya girmeden anlatmak gerekirse, developer ve de&#287;i&#351;en kod dosyas&#305; seti aras&#305;ndaki ili&#351;kiler &uuml;zerinden giderek hesaplan&#305;yor.</span></p><p class="c2"><span class="c4">L: Well, to explain without going into too much detail, it&#39;s calculated based on the relationships between the developer and the set of changed code files.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Mesela biz &#351;imdi &#351;ey mi anlamal&#305;y&#305;z? Dev-1 daha &ccedil;ok &ccedil;al&#305;&#351;m&#305;&#351;, Dev-2 daha az.</span></p><p class="c2"><span class="c4">Participant 2: So, should we understand it as Dev-1 has worked more, Dev-2 less?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Buradaki skor daha &ouml;nceki de&#287;i&#351;en kod setine bula&#351;&#305;kl&#305;&#287;&#305;n&#305; g&ouml;steriyor. Mesela o dosyalara bula&#351;&#305;kl&#305;&#287;&#305; g&ouml;steriyoruz.</span></p><p class="c2"><span class="c4">Participant 1: The score here shows the involvement in the previous set of changed code. For example, it shows their involvement with those files.</span></p><p class="c2"><span class="c1">E: Mesela E.java developer-1 daha fazla bula&#351;m&#305;&#351;, daha fazla review etmi&#351;.</span></p><p class="c2"><span class="c4">E: For instance, E.java shows that developer-1 has been more involved and has reviewed it more.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 3: Yani bu dosyayla kim daha &ccedil;ok ilgilendi onun skorlanmas&#305;, ben review atarken benim i&#351;imi kolayla&#351;t&#305;rabilir.</span></p><p class="c2"><span class="c4">Participant 3: So, scoring who has been more involved with this file can make my job easier when assigning reviews.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Bir dosya birden fazla olunca ne oluyor?</span></p><p class="c2"><span class="c4">Participant 2: What happens when there are multiple files?</span></p><p class="c2"><span class="c1">L: Ayn&#305; &#351;ekilde b&uuml;t&uuml;n dosyalar baz&#305;nda bir skor hesaplan&#305;yor. Sonra topluyoruz. O dosya setini toplam en iyi bilen ki&#351;iyi &ouml;nermeye &ccedil;al&#305;&#351;&#305;yoruz.</span></p><p class="c2"><span class="c4">L: We calculate a score for all files in the same way. Then we sum them up. We try to recommend the person who knows the entire set of files the best.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Buna mesela &#351;ey akl&#305;ma geldi&#287;i i&ccedil;in payla&#351;ay&#305;m belki de&#287;er yarat&#305;l&#305;r diye. Yani &#351;&ouml;yle bir d&uuml;&#351;&uuml;nce, bilmem ne yenileniyor mu? Asl&#305;nda bir &#351;eyler tutuyorlar, s&uuml;rekli kontrol&uuml; tabi de ara&ccedil;ta tutuyor ama. Denormalize olarak b&ouml;yle dosyalar&#305;n i&ccedil;erisinde en &ccedil;ok de&#287;i&#351;tiren ya da en &ccedil;ok review eden bilgisi yer alm&#305;yor. Asl&#305;nda denormalize bilgi g&uuml;zel, bilgi bak arad&#305;&#287;&#305;n&#305; direkt oradan da bulabiliyorsun ya normalde burada en &ccedil;ok kim yazm&#305;&#351;, en &ccedil;ok kimi g&ouml;zden ge&ccedil;mi&#351; deseydi diye de&#287;il mi? O da oradan direkt denormalize bilgi olarak geri al&#305;rsa bunlar&#305;n da geri d&ouml;n&uuml;&#351;&uuml; hep kolay olabiliyor.</span></p><p class="c2"><span class="c6">Participant 1: This reminds me of something that might add value. There&rsquo;s a thought, is anything being renewed? They keep some things continuously monitored in the tool. However, the information about who has changed or reviewed the most isn&#39;t always denormalized in the files. Actually, denormalized information is good because you can directly find what you&#39;re looking for. Normally, you would ask who has written the most, who has reviewed the most, right? If it gets this information back as denormalized data, it can make things easier.</span></p><p class="c2"><span class="c1">E: Tamam, tam olarak bunu yap&#305;yor.</span></p><p class="c2"><span class="c4">E: Exactly, that&#39;s what it does.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Ayn&#305; zamanda &#351;ey i&ccedil;in de gerekiyor, d&uuml;zenleyici i&ccedil;in de gerekiyor, yani bana bir bug geldi kime g&ouml;nderece&#287;iz bunu ha tabi. Bunu denormalize bilgi olarak tutmak laz&#305;m, source code&#39;un yan&#305;na yazmak laz&#305;m.</span></p><p class="c2"><span class="c4">Participant 1: It&#39;s also needed for the organizer. For example, if I get a bug, to whom should I send it? It&rsquo;s necessary to keep this as denormalized information, written alongside the source code.</span></p><p class="c10"><span class="c1">1:09:00 - 1:22:52 (SAA Framework Anlat&#305;m&#305;) (Yemek Yendi)</span></p><p class="c10"><span class="c1">1:23:00 - 2:01:00 (User Trial Session)</span></p><p class="c2"><span class="c1">2:01:45 - 2:03:40 </span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: &#350;ey yok de&#287;il mi, b&ouml;yle Dashboard d&uuml;&#351;&uuml;ncesi var m&#305;? Mesela bir insight oradan geliyor. Normalde ba&#351;lang&#305;&ccedil;ta bir g&ouml;r&uuml;&#351;e sahip olam&#305;yorum. E&#287;er &ouml;zel olarak polislik yapmak istedi&#287;im bir konu yoksa dashboard bir i&ccedil;g&ouml;r&uuml; olu&#351;turur.</span></p><p class="c2"><span class="c6">Participant 1: There isn&#39;t anything like this, right? Is there any idea of a dashboard? For example, getting an insight from there. Normally, I can&#39;t have an opinion at the beginning. If there&#39;s not a specific issue I want to focus on, a dashboard can provide an insight.</span></p><p class="c2"><span class="c1">E: Do&#287;ru, evet. G&uuml;zel.</span></p><p class="c2"><span class="c4">E: Correct, yes. Nice.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Sana &#351;ey g&ouml;nderirim.</span></p><p class="c2"><span class="c4">Participant 1: I&#39;ll send it to you.</span></p><p class="c2"><span class="c1">L: Herkes zaten yan&#305;t&#305; var, tamam.</span></p><p class="c2"><span class="c4">L: Everyone already has the answer, okay.</span></p><p class="c2"><span class="c1">E: G&ouml;ndermi&#351; mi? Tamam.</span></p><p class="c2"><span class="c4">E: Has it been sent? Okay.</span></p><p class="c2"><span class="c1">L: Tamam o zaman devam edelim.</span></p><p class="c2"><span class="c4">L: Okay, then let&#39;s continue. </span></p><p class="c2"><span class="c1">L: &#304;lk &ouml;nce birka&ccedil; tane genel sorumuz var, daha sonras&#305;nda asl&#305;nda bu yapt&#305;&#287;&#305;m&#305;z task&#39;lar hakk&#305;nda birka&ccedil; soru soraca&#287;&#305;z.</span></p><p class="c2"><span class="c4">L: First, we have a few general questions. After that, we&#39;ll ask some questions about the tasks we performed.</span></p><p class="c2"><span class="c1">2:03:40 - 2:11:08</span></p><p class="c2"><span class="c1">&nbsp;L: &#304;lk sorumuz &#351;u &#351;ekilde: asl&#305;nda size sunumda yapt&#305;&#287;&#305;m&#305;z bu SAA&#39;nin graph modelini ne kadar yeterli buldunuz? Projeyi yans&#305;tmak a&ccedil;&#305;s&#305;ndan &ouml;n&uuml;m&uuml;zdeki sayfalardan inceleyebilirsiniz modeli. Bu bazda alt sorumuz, siz olsayd&#305;n&#305;z hangi t&uuml;r software artifact&#39;lerin, ili&#351;kilerin veya &ouml;zelliklerin eklenmesi gerekti&#287;ini d&uuml;&#351;&uuml;n&uuml;rd&uuml;n&uuml;z? Sizce modele neler eklenebilir ekstra olarak bunu sormu&#351;tur.</span></p><p class="c2"><span class="c4">L: Our first question is: how adequate did you find the graph model of the SAA presented to you during the presentation? You can review the model in the upcoming pages to reflect on the project. Based on this, our sub-question is, if you were in charge, what type of software artifacts, relationships, or features would you think should be added? What additional elements do you think could be included in the model?</span></p><p class="c2"><span class="c1">U: Bu discussion a&ccedil;&#305;s&#305;ndan yani &#351;ey de&#287;il, herhangi bir doldurmuyoruz yani. &Ouml;zetle diyoruz ki mesela sizin akl&#305;n&#305;zda bir use case varsa o use case i&ccedil;in gerekli olabilecek yeni bir artifact. Farkl&#305; bir artifact ya da farkl&#305; bir relation var m&#305;?</span></p><p class="c2"><span class="c4">U: This is for discussion purposes, so we are not filling out anything specific. In summary, we are asking if you have any use cases in mind, are there any new artifacts or different relations that could be necessary for that use case?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Ben genel olarak &#351;eyi g&ouml;rd&uuml;m. Issue tipleri ile ilgili bir &#351;eyler olabilir. Yani genel olarak bug&#39;lar &uuml;zerinden gitmi&#351; herhalde i&#351;te feature&#39;lar feature&#39;lar&#305;n geli&#351;tirilmesi ve bu feature&#39;lardan dolay&#305; olu&#351;an bug&#39;lar aras&#305;ndaki ili&#351;kiler ile ilgili bir &#351;eyler yap&#305;l&#305;rsa bence &#351;ey i&ccedil;in &ccedil;ok kullan&#305;&#351;l&#305; olur. Yani biraz hani yapt&#305;&#287;&#305;m&#305;z &#351;ey &#351;u &#351;ekilde, bug&uuml;n bir feature &ccedil;&#305;k&#305;yoruz hemen bundan bir g&uuml;n sonra bir anda bug say&#305;m&#305;z 5 tane 10 tane art&#305;yorsa. Burada bir &#351;ey olabilir, onlar&#305;n da burada represent edilmesi g&uuml;zel olabilir. Akl&#305;ma gelen ilk &#351;ey bu oldu. Burada yaparken bu eklenir dedim.</span></p><p class="c2"><span class="c4">Participant 2: In general, I noticed something related to issue types. It mostly seemed to focus on bugs. If something could be done about the relationships between features, the development of features, and the bugs caused by these features, I think it would be very useful. For example, if we release a feature today and then suddenly our bug count increases by 5 or 10 the next day, there could be an issue. It would be nice to represent that here as well. That&#39;s the first thing that came to my mind. I thought this could be added while we were doing this.</span></p><p class="c2"><span class="c1">U: Issue typelar&#305; ba&#351;tan biz bir &#351;ekilde entegre edelim dedik ama galiba Jira&#39;dan gelmiyordu de&#287;il mi?</span></p><p class="c2"><span class="c4">U: We initially wanted to integrate issue types somehow, but I think it wasn&#39;t coming from Jira, right?</span></p><p class="c2"><span class="c1">L: &#350;u an type &#351;eklinde bir property olarak tutuyoruz.</span></p><p class="c2"><span class="c4">L: Currently, we are keeping it as a property called type.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Type&#39;lar&#305;n bir hiyerar&#351;isi var. Bir feature, daha b&uuml;y&uuml;k bir &#351;ey task asl&#305;nda onun alt&#305;nda &ccedil;al&#305;&#351;&#305;lmas&#305;n&#305; sa&#287;layan &#351;ey bildi&#287;iniz.</span></p><p class="c2"><span class="c4">Participant 1: There is a hierarchy of types. A feature is a larger task, and under that, there are smaller tasks that contribute to it.</span></p><p class="c2"><span class="c1">U: Ben hi&ccedil; Jira&#39;dan yok diye biliyordum da onun i&ccedil;in var yani.</span></p><p class="c2"><span class="c4">U: I thought it wasn&#39;t available from Jira, but it is.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Property olarak da kullan&#305;lm&#305;&#351; zaten anlad&#305;&#287;&#305;m kadar&#305;yla fakat belki de tamamen farkl&#305; bir artifact olarak d&uuml;&#351;&uuml;n&uuml;lmesi ili&#351;kileri bulmak a&ccedil;&#305;s&#305;ndan iyi bir &#351;ey olabilir diye d&uuml;&#351;&uuml;n&uuml;yorum.</span></p><p class="c2"><span class="c4">Participant 2: As I understand it, it is already used as a property, but maybe thinking of it as a completely different artifact could be good for finding relationships.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Biraz daha &ouml;zelli&#287;e do&#287;ru kaymak laz&#305;m. Yeni &ouml;zelliklerin neden oldu&#287;u hatalar gibi.</span></p><p class="c2"><span class="c4">Participant 1: We should move towards more features, like the bugs caused by new features.</span></p><p class="c2"><span class="c1">E: Ya bu process smeller daha spesifik oldu&#287;u i&ccedil;in ona girmemi&#351;tik ama do&#287;ru yani bug feature task i&#351;te epic falan. Hani bunlar kesinlikle gelebilir.</span></p><p class="c2"><span class="c4">E: We didn&#39;t include those because process smells are more specific, but you&#39;re right. Bugs, features, tasks, epics&mdash;they could definitely be included.</span></p><p class="c2"><span class="c1">U: Yani issue type specific use caseler.</span></p><p class="c2"><span class="c4">U: So, issue type specific use cases.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Evet, evet.</span></p><p class="c2"><span class="c4">Participant 2: Yes, yes.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Asl&#305;nda &#351;&ouml;yle ba&#351;l&#305;yor, ya olay i&#351;leyen teslim etmi&#351; i&#351;e ba&#351;l&#305;yoruz, i&#351; de&#287;eri var orada i&#351;lerini sa&#287;layan &#351;eyde yani k&uuml;lt&uuml;r asl&#305;nda mimarl&#305;k kavram da yani kabiliyet ya da &#351;ey user story diyelim. User story i&#351;lerini sa&#287;layan i&#351;te User story ba&#351;ka bir bak&#305;&#351; a&ccedil;&#305;s&#305;.</span></p><p class="c2"><span class="c4">Participant 1: It actually starts with delivering a working feature. There is a job value there that supports the work, meaning the culture or architecture concept&mdash;let&#39;s say capability or user story. A user story supports work from a different perspective.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Ya user story ile ba&#351;lay&#305;p sahada teslimat sa&#287;layan asl&#305;nda bir de &#351;ey var build var. Ger&ccedil;ekte execute blogu. En solda bir inisiyatif var, i&#351; inisiyatifi en sa&#287;da da &ccedil;al&#305;&#351;an yani deployment girmek belki gerekmez ama build var.</span></p><p class="c2"><span class="c4">Participant 1: Starting with a user story and providing delivery on the field, there is also the build aspect. In reality, it&#39;s the execution block. On the far left, there is an initiative, a job initiative, and on the far right, the actual working deployment, maybe not necessary to include, but there is the build.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Yani sol ve sa&#287; taraflar&#305;nda 2 eksi&#287;imiz var. Sol tarafta hocam s&ouml;ylediler zaten sa&#287; tarafta da bana g&ouml;re build eksik.</span></p><p class="c2"><span class="c4">Participant 1: So, we have two gaps on the left and right sides. On the left side, as mentioned, and on the right side, I think the build is missing.</span></p><p class="c2"><span class="c1">L: Peki hocam mesela &#351;eyi de sormak istiyordum, bunda ekleseniz mesela ekleyebilir miyiz?</span></p><p class="c2"><span class="c4">L: Well, &nbsp;for example, could we add that if we wanted to?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Olur tabi ya eklenir.</span></p><p class="c2"><span class="c4">Participant 1: Of course, it can be added.</span></p><p class="c2"><span class="c1">U: Yani senin s&ouml;ylemek istedi&#287;in &#351;u herhalde mesela bu yeni eklenecek build artifact&#39;i ve di&#287;erleri aras&#305;ndaki ili&#351;kileri tutan commonly used ara&ccedil;lar var m&#305;? Yani mesela Jira bir sistemiyle entegre mi?</span></p><p class="c2"><span class="c4">U: So, what you&#39;re trying to say is, are there any commonly used tools that track the relationships between this new build artifact and the others? I mean, for example, is it integrated with a system like Jira?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Tam olarak var zaten &#351;ey gibi de d&uuml;&#351;&uuml;nebilirsiniz. Jira&#39;n&#305;n zaten GitHub yerine kullanabilece&#287;iniz Bitbucket diye de &#351;eyi var. Direk &#351;ey yapt&#305;n&#305;z. Bana zaten &ouml;yle oluyor. Onunla da entegrasyonlar&#305; var.</span></p><p class="c2"><span class="c4">Participant 2: Exactly, you can think of it like that. Jira already has Bitbucket that you can use instead of GitHub. You did it directly. It happens to me like that. There are integrations with that as well.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: &#350;eyde de &#351;&ouml;yle bir durum var, commitler yerine deployment&#39;lar kullan&#305;lsa daha do&#287;ru bilgiler verebilir diye d&uuml;&#351;&uuml;n&uuml;yorum. &Ccedil;&uuml;nk&uuml; her commit bir &#351;ey ifade etmeyebilir ama her deployment product i&ccedil;in bir de&#287;i&#351;iklik demektir. Gerek farkl&#305; bir &ccedil;&ouml;z&uuml;m gerekse yeni bir feature ekleme.</span></p><p class="c2"><span class="c4">Participant 2: There&#39;s also this situation, I think it would provide more accurate information if deployments were used instead of commits. Because not every commit means something, but every deployment means a change for the product. Whether it&#39;s a different solution or a new feature addition.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Bak&#305;yorum da, committe gerekiyor, dosyalar&#305; olmuyor.</span></p><p class="c2"><span class="c4">Participant 1: I see that, but commits are necessary, files don&#39;t work otherwise.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Tabi gerekiyor ama ben daha do&#287;ru bir bilgi oldu&#287;unda.</span></p><p class="c2"><span class="c4">Participant 2: Of course, they are necessary, but I&#39;m talking about more accurate information.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: &Ccedil;&uuml;nk&uuml; de&#287;er, &uuml;r&uuml;n &ccedil;al&#305;&#351;an &uuml;r&uuml;n taraf&#305;ndan bizim s&ouml;yledi&#287;imiz.</span></p><p class="c2"><span class="c4">Participant 1: Because the value comes from the working product, as we said.</span></p><p class="c2"><span class="c1">U: Bir tanesi internal testinde yakalad&#305;&#287;&#305;m buglar, bir tanesi de canl&#305;da yakalad&#305;&#287;&#305;n buglar asl&#305;nda. Ya da sorunlar.</span></p><p class="c2"><span class="c6">U: One is bugs you catch in internal testing, and the other is bugs you catch in live environments. Or issues</span><span class="c1">.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Hocam asl&#305;nda temel ilkemiz &#351;u, yani biz geli&#351;tirme yapmak i&ccedil;in geli&#351;tirme yapm&#305;yoruz. Temel derdimiz bug bulmak kod yazmak de&#287;il, temel derdimiz normal &ccedil;al&#305;&#351;an bir &uuml;r&uuml;n ortaya &ccedil;&#305;karmak, &ccedil;al&#305;&#351;an &uuml;r&uuml;n temel dizisi bir i&#351; hikayesi &ccedil;&#305;kt&#305;s&#305; da hakikaten i&#351;te executable. Ortadaki faaliyet yapay, bizim geli&#351;tirme m&uuml;hendisinin kendi sorunlar&#305; yani. &#304;&#351;in kendisinin buna ilgili bir &#351;eyi yok, kayg&#305;s&#305; yok. Bug bulduk kod yazd&#305;k commit ettik falan onlar bizim sorular&#305;m&#305;z asl&#305;nda i&#351;le ilgili bir sorun de&#287;il, i&#351;in sorunu benim ihtiyac&#305;m bu &ccedil;al&#305;&#351;an &uuml;r&uuml;n nerede. Board&#39;daki b&ouml;l&uuml;m bizim software development&#39;&#305;n kendi problemleri. Ya i&#351; d&uuml;nyas&#305;n&#305;n onunla ilgisi bir kar&#351;&#305;l&#305;&#287;&#305; yok.</span></p><p class="c2"><span class="c4">Participant 1: Actually, our main principle is this, we don&#39;t develop just for the sake of development. Our main concern is not finding bugs or writing code, our main concern is to create a working product, and the main sequence of the working product is indeed an executable output of a business story. The activity in the middle is artificial, it&rsquo;s our development engineer&#39;s own problems. The business itself has no concern or relation to this. We found bugs, wrote code, committed them, etc., those are our issues, not a business issue. The business issue is where is my needed working product. The section on the board is our software development&#39;s own problems. The business world has no counterpart to it.</span></p><p class="c2"><span class="c1">E: Ama ayn&#305; zamanda bizim artifact&#39;leri mine ederek bir &#351;ey &ccedil;&#305;karabiliriz.</span></p><p class="c2"><span class="c4">E: But at the same time, we can extract something by mining our artifacts.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Sponsorumuz ne? User story. Evet tamam o gerekiyor &ccedil;&uuml;nk&uuml; o olmadan bo&#351; &ccedil;al&#305;&#351;&#305;yoruz ya o olmazsa hi&ccedil;bir &#351;ey yapm&#305;yoruz anlam&#305;nda kendi kendimize bir &#351;ey yapmam&#305;z m&uuml;mk&uuml;n de&#287;il, keza onun da teslim etmesi gereken en sonunda &ccedil;al&#305;&#351;an bir kod. Yani bu form&uuml;le kadar gidebilir build&#39;e.</span></p><p class="c2"><span class="c1">Participant 1: What is our sponsor? User story. Yes, it is necessary because without it we are working aimlessly, we can&#39;t do anything without it, we can&#39;t do anything on our own, and it also has to deliver a working code in the end. It can go as far as the build.</span></p><p class="c2"><span class="c1">E: Tamam user story, build, artifact&#39;leri eklenmeli. Onlar&#305; yazd&#305;k.</span></p><p class="c2"><span class="c4">E: Okay, user story, build, artifacts should be added. We wrote them.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Pipeline bu zaten.</span></p><p class="c2"><span class="c4">Participant 1: This is the pipeline already.</span></p><p class="c2"><span class="c1">E: Ondan ba&#351;ka bir &#351;ey var m&#305;?</span></p><p class="c2"><span class="c4">E: Is there anything else?</span></p><p class="c2"><span class="c1">L: Genel olarak &#351;u an hali haz&#305;rda olan model hakk&#305;nda d&uuml;&#351;&uuml;ncelerinizi de payla&#351;&#305;rsan&#305;z &ccedil;ok seviniriz.</span></p><p class="c2"><span class="c4">L: In general, we would be very happy if you could share your thoughts on the current model.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 4: Evet &ccedil;ok yani de&#287;i&#351;tirilebilecek bir &#351;ey de&#287;il de &#351;&ouml;yle bir farkl&#305;l&#305;k olabilir. Burada sadece developer gibi d&uuml;&#351;&uuml;nm&uuml;&#351;t&uuml;k. &Ccedil;&uuml;nk&uuml; hani projede da zaten sadece developer oluyor, genellikle issue a&ccedil;an da, report eden de, solve eden de. Ama hani daha &ouml;zel, hani &#351;irket yap&#305;s&#305;nda hani teknik olmayan &uuml;yeler de bir issue a&ccedil;abiliyor, comment atabiliyor, belki developer&#39;a &ouml;yle bir &ouml;zellik eklenebilir. Hani teknik developer m&#305; de&#287;il mi? Gibi bir &#351;ey oluyor ama open source i&ccedil;in &ccedil;ok farkl&#305; olaca&#287;&#305;n&#305; d&uuml;&#351;&uuml;nm&uuml;yorum ama hani &#351;irket ortam&#305;nda oluyor.</span></p><p class="c2"><span class="c4">Participant 4: Yes, it&#39;s not something that can be changed much, but there could be a difference. Here, we only thought of it as a developer. Because usually in a project, the developer is the one who opens, reports, and solves issues. But in a company structure, non-technical members can also open issues, leave comments, and maybe such a feature can be added to the developer. Like whether they are a technical developer or not. But I don&#39;t think it would be very different for open source, but it happens in a company environment.</span></p><p class="c2"><span class="c1">E: Do&#287;ru, g&uuml;zel, tamam.</span></p><p class="c2"><span class="c4">E: Correct, nice, okay.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 4: Mesela teknik olmayanlar&#305; bilerek baz&#305; query&#39;lerde d&#305;&#351;ar&#305;da b&#305;rak&#305;r&#305;z. Ya da belki hani sadece ben teknik olmayan &uuml;yeyi bulmak istiyorum. Bu konu hakk&#305;nda konu&#351;mam gereken sadece onu bulmak i&ccedil;in.</span></p><p class="c2"><span class="c4">Participant 4: For example, we can deliberately exclude non-technical members in some queries. Or maybe I just want to find the non-technical member. This is the person I need to talk to about this topic.</span></p><p class="c2"><span class="c1">L: Te&#351;ekk&uuml;rler, devam edelim.</span></p><p class="c2"><span class="c6">L: Thank you, let&#39;s continue.</span></p><p class="c2"><span class="c1">2:11:08 - 2:13:38</span></p><p class="c2"><span class="c1">L: Di&#287;er bir sorumuzda da asl&#305;nda &#351;unu sormu&#351;tuk, sizce bu software artifact analyzer tool&#39;una yeni bir analiz eklenecek olsa ne gibi analizler eklenebilir? Sormaya &ccedil;al&#305;&#351;t&#305;&#287;&#305;m&#305;z &#351;ey asl&#305;nda &#351;u, dedi&#287;imiz gibi biz en temelinde bu software artifact traceability graph yap&#305;s&#305;n&#305; kullan&#305;yoruz. Sizin akl&#305;n&#305;za mesela bu graph yap&#305;s&#305;n&#305; kullanarak asl&#305;nda ayn&#305; &#351;ekilde bu sisteme entegre edilebilecek bir analiz &ccedil;e&#351;idi geliyor mu? Veya hani sizin hani &ccedil;al&#305;&#351;ma s&uuml;resince ke&#351;ke b&ouml;yle bir ara&ccedil; olsayd&#305; dedi&#287;iniz bir noktada olabilir.</span></p><p class="c2"><span class="c4">L: In another question, we actually asked this: If a new analysis were to be added to this software artifact analyzer tool, what kind of analyses could be added? What we&#39;re trying to ask is this: As we said, at its core, we use this software artifact traceability graph structure. Do you have any ideas for an analysis type that could be integrated into this system using this graph structure? Or is there a point where you thought, &quot;I wish there was such a tool&quot; during your work process?</span></p><p class="c2"><span class="c1">U: &#350;unlar&#305; da yapsayd&#305; iyi olur 2 tanesini s&ouml;ylediniz zaten.</span></p><p class="c2"><span class="c1">U: It would be good if it also did these things; you already mentioned two of them.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Birinci b&ouml;l&uuml;mdeki zaten 2 ba&#351;l&#305;k sola ve sa&#287;a do&#287;ru geli&#351;tirdim buray&#305; yani. Once &#351;ey taraf&#305; da var, issue&#39;lar ile ilgili user story eklenmesi gibi, oras&#305;n&#305; da geni&#351;ler. Sa&#287;da galiba. Gelince oradan &ccedil;&#305;kan hatalara d&ouml;n&uuml;k bir yo&#287;unla&#351;malar da &ccedil;&#305;kar. Bu &#351;ekilde user story ile hatalar aras&#305;ndaki ili&#351;ki i&ccedil;sellik de ke&#351;fedilmeye ba&#351;lar.</span></p><p class="c2"><span class="c6">Participant 1: In the first section, I developed the two headings to the left and right here. </span><span class="c7 c6">Once there&#39;s an issue side, like adding a user story related to issues, that part also expands. I think it&#39;s on the right. Focusing on the errors that come from there is also revealed. This way, the relationship between the user story and the errors starts to be discovered.</span></p><p class="c2"><span class="c1">L: Ba&#351;ka yorum yapmak isteyen olur mu?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 3: Yani bana asl&#305;nda bak&#305;nca &#351;&ouml;yle hizmetler sunsa &ccedil;ok g&uuml;zel bulurdum. Ben mesela g&uuml;n i&ccedil;erisinde yakalad&#305;&#287;&#305; s&#305;k&#305;nt&#305;lar&#305; b&ouml;yle bir dashboard olur ya da herhangi bir &#351;ekilde.</span></p><p class="c2"><span class="c4">Participant 3: When I look at it, it would be great if it provided such services. For example, if there was a dashboard or any way to show the issues I encountered during the day.</span></p><p class="c2"><span class="c1">U: Notify etse diyorsunuz.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 3: Aynen, yani ben i&#351;te bug&uuml;n &#351;u issue&#39;da s&#305;k&#305;nt&#305; ya&#351;ad&#305;m ya da &#351;u commit&#39;te bir s&#305;k&#305;nt&#305; ya&#351;ad&#305;m gibi g&ouml;sterse ben ona g&ouml;re aksiyon alsam daha g&uuml;zel olur. Hocam dedi&#287;i gibi &#351;imdi &ccedil;ok detay var, bu detay da genelde b&ouml;yle bir s&#305;k&#305;nt&#305;l&#305; bir durum oldu&#287;unda biz buraya gideriz. Ger&ccedil;ekten bu problem ya&#351;am&#305;&#351;&#305;zd&#305;r, kim yapm&#305;&#351;, neden yapm&#305;&#351;, ne olmu&#351;, biz bilemiyoruz. Issue&#39;da ne gibi s&#305;k&#305;nt&#305;lar olmu&#351; ya da belki ters taraftan da bakabiliriz. Yaz&#305;l&#305;mc&#305; taraf&#305;ndan da bakabiliriz. Yani yaz&#305;l&#305;mc&#305;y&#305; daha iyi analiz edebilmek i&ccedil;in ne s&#305;k&#305;nt&#305;lar ya&#351;am&#305;&#351;, bunlar nas&#305;l &ccedil;&ouml;zeriz bundan anlamak i&ccedil;in o taraftan da bak&#305;p sonu&ccedil;lar elde edebiliriz. Bu tarz bir &ouml;neri mekanizmalar&#305; g&uuml;zel olurdu a&ccedil;&#305;k&ccedil;as&#305;.</span></p><p class="c2"><span class="c4">Participant 3: Exactly, it would be better if it showed me, for example, I had a problem with this issue today or this commit, and I could take action accordingly. As my colleague said, there are many details, and we usually go here when there&#39;s a problematic situation. We don&#39;t really know what problem occurred, who did it, why it happened, what happened. What issues were there in the issue, or maybe we can look at it from the other side. We can look from the developer&#39;s side as well. To better analyze the developer, to understand what problems they experienced, how to solve them, we can look from that side and get results. Such recommendation mechanisms would honestly be nice.</span></p><p class="c2"><span class="c1">E: Tamam, te&#351;ekk&uuml;rler.</span></p><p class="c2"><span class="c4">E: Okay, thank you. </span></p><p class="c2"><span class="c1">2:13:38 - 2:19:51</span></p><p class="c2"><span class="c1">L: Di&#287;er bir soruda asl&#305;nda, bu g&ouml;sterdi&#287;imiz bu &ccedil;izim kanvas&#305; projedeki software artifact&#39;leri hakk&#305;nda bilgi edinme veya genel olarak bu tarz i&#351;ler i&ccedil;in ne kadar katk&#305; yarat&#305;yor? Projedeki artifact&#39;leri incelemek i&ccedil;in bu &ccedil;izim kanvas&#305;n&#305; kullan&#305;r m&#305;yd&#305;n&#305;z?</span></p><p class="c2"><span class="c4">L: In another question, actually, how much does this drawing canvas we showed contribute to gaining information about the software artifacts in the project or for such tasks in general? Would you use this drawing canvas to examine the artifacts in the project? </span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: G&uuml;zel yayg&#305;n olarak kullan&#305;lan bir kanvas ama &#351;eyler (node ikonlar&#305;) biraz fazla b&uuml;y&uuml;k, kullan&#305;c&#305; olarak s&ouml;yl&uuml;yorum. Belki olay&#305; biraz daha estetik hale getirebilirsiniz.</span></p><p class="c2"><span class="c6">Participant 1: It&#39;s a nice, commonly used canvas, but the icons (node icons) are a bit too large, I&#39;m saying this as a user. Maybe you can make it a bit more aesthetic. </span></p><p class="c2"><span class="c1">U: Neler fazla b&uuml;y&uuml;k?</span></p><p class="c2"><span class="c6">U: What is too large?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Node ikonlar falan fazla b&uuml;y&uuml;k. Yani alg&#305;y&#305; kendi &uuml;zerine &ccedil;ekmeye &ccedil;al&#305;&#351;&#305;yor. &#304;konlar ba&#287;lamdan ziyade &ouml;ne &ccedil;&#305;k&#305;yor. Ama o &#351;ey sadece UI problemi yani.</span></p><p class="c2"><span class="c6">Participant 1: The node icons and such are too big. They try to draw attention to themselves. The icons stand out more than the context. But that&#39;s just a UI problem.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 3: Ya bir noktada ekranda &ccedil;ok nesne var gibi geliyor bana. Hani belki bir &#351;eyleri, az &ouml;nce de yapt&#305;k ya, mesela bir &#351;eye t&#305;klad&#305;k bir &#351;ey a&ccedil;&#305;ld&#305;, bir &#351;eye t&#305;klad&#305;m bir &#351;ey a&ccedil;&#305;ld&#305; falan orada kaybolabilirim ben. Peki nas&#305;l kaybolmamal&#305;y&#305;m?</span></p><p class="c2"><span class="c4">Participant 3: At some point, it feels like there are too many objects on the screen. For example, we clicked on something, something opened, we clicked on another thing, something else opened, and I might get lost there. So how should I not get lost?</span></p><p class="c2 c8"><span class="c4"></span></p><p class="c2"><span class="c1">U: Onun da yolu asl&#305;nda istedi&#287;iniz b&ouml;l&uuml;m&uuml; se&ccedil;ip direkt delete ya da hide edebilirsiniz. G&ouml;stersene o b&ouml;l&uuml;m&uuml;.</span></p><p class="c2"><span class="c4">U: Actually, you can select the section you want and directly delete or hide it. Show that section.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Orada &#351;eyde kullan&#305;labilir, &ccedil;&ouml;z&uuml;n&uuml;rl&uuml;&#287;&uuml; otomatik olarak ayarlama yani expand collapse otomatik olarak ger&ccedil;ekle&#351;tirme hikayelerde de var.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c6">&nbsp;It can be used there as well, like automatically adjusting the resolution, performing expand and collapse automatically. It&rsquo;s also present in stories.</span></p><p class="c2"><span class="c1">L: (Delete hide &ouml;zellikleri &ccedil;izim kanvas&#305;nda g&ouml;sterildi)</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;(Delete hide features were shown on the drawing canvas)</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305;3: Yani photoshop uygulamalarda &ouml;zel bir layer mant&#305;&#287;&#305; var. Mesela se&ccedil;ili k&#305;sm&#305; bir layer&#39;a aktar gibi, o layer&#39;&#305; hide edince kaybolsun.</span></p><p class="c2"><span class="c0">Participant 3:</span><span class="c4">&nbsp;There is a special layer concept in Photoshop applications. For example, transferring the selected part to a layer, and when you hide that layer, it disappears.</span></p><p class="c2"><span class="c1">L: Onda da &#351;u var asl&#305;nda, burada History b&ouml;l&uuml;m&uuml;ne gidip eski &ccedil;izimleri burada saklayabiliyoruz.</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;Actually, we can do that by going to the History section and keeping the old drawings there.</span></p><p class="c2"><span class="c1">U: &#350;ey de yapabiliyoruz, direkt bulunan graph &ccedil;izimini kaydedip sonras&#305;nda y&uuml;kleyebiliyoruz.</span></p><p class="c2"><span class="c0">U:</span><span class="c4">&nbsp;We can also save the current graph drawing directly and load it later.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Elle node ekleyebiliyor muyuz? Araya gidip.</span></p><p class="c2"><span class="c12">Participant 1:</span><span class="c1">&nbsp;Can we manually add nodes? By going in between.</span></p><p class="c2"><span class="c1">U: Yok.</span></p><p class="c2"><span class="c0">U:</span><span class="c4">&nbsp;No.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Ben o bazen bir query&#39;ler d&#305;&#351;&#305;nda yani ilgi &ccedil;ekici olabilir ama asl&#305;nda i&#351;ler yap&#305;l&#305;r ama &#351;u dosyada ya da &#351;u commit&#39;te &#351;u developer&#39;&#305;n ilgisi de var m&#305; acaba diye?</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;Sometimes it&#39;s interesting to see if there is involvement from a developer in a specific file or commit beyond just running queries.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Soruyla ilgili bir &#351;ey s&ouml;yleyebilir miyim acaba? &#350;eyde ben bu, visual representation ve burada yap&#305;lan &#351;eylerin &#351;irketler i&ccedil;in &#351;&ouml;yle bir yarar&#305; oldu&#287;unu d&uuml;&#351;&uuml;n&uuml;yorum. Biz her zaman insanlar&#305;n performanslar&#305;yla ilgili veya yapt&#305;klar&#305; &#351;eylerle ilgili &ouml;l&ccedil;&uuml;lebilir &#351;eyler bulmaya &ccedil;al&#305;&#351;&#305;yoruz. Bunun bu &#351;ekilde history&#39;sinin sa&#287;lan&#305;p gittik&ccedil;e geli&#351;en, at&#305;yorum burada Hans g&ouml;steriyor. Hans&#39;&#305;n &#351;u anda bu kadar commit&#39;te, bu kadar bug&#39;da bir s&#305;k&#305;nt&#305;s&#305; vard&#305; fakat bir sene sonra bu azald&#305; veya onunla bir iyile&#351;me ya&#351;and&#305; &#351;eklindeki &#351;eyleri b&ouml;yle bir &ouml;l&ccedil;&uuml;lebilir bir &#351;eye koyman&#305;n ger&ccedil;ekten &ccedil;ok b&uuml;y&uuml;k bir de&#287;eri oldu&#287;unu d&uuml;&#351;&uuml;n&uuml;yorum. Bizim i&ccedil;in bu da her zaman eksikli&#287;ini &ccedil;ekilen bir &#351;eydir diye.</span></p><p class="c2"><span class="c0">Participant 2:</span><span class="c4">&nbsp;May I say something about the question? I think the visual representation and the things done here have a benefit for companies. We always try to find measurable things about people&#39;s performances or what they do. Providing such a history and showing progress over time, for instance, showing that Hans had issues with certain commits and bugs, but a year later, he improved. Putting such things into measurable terms is really valuable. This is something we always lack.</span></p><p class="c2"><span class="c1">U: Zaman i&ccedil;indeki de&#287;i&#351;imi mi diyorsun?</span></p><p class="c2"><span class="c0">U:</span><span class="c4">&nbsp;Are you talking about changes over time?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Evet.</span></p><p class="c2"><span class="c0">Participant 2:</span><span class="c4">&nbsp;Yes.</span></p><p class="c2"><span class="c1">U: Asl&#305;nda bizim bir &#351;ey time bar&#39;&#305;m&#305;z var, bunu da g&ouml;steririm.</span></p><p class="c2"><span class="c0">U:</span><span class="c4">&nbsp;Actually, we have a time bar that shows this, I will show it to you.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Bunun g&ouml;rsel olarak g&ouml;r&uuml;lmesi bile bir kan&#305;t olu&#351;turdu&#287;u i&ccedil;in ger&ccedil;ekten &ccedil;ok &ouml;nemli. Genelde bunlar hissiyata g&ouml;re yap&#305;l&#305;yor veya i&#351;te en iyi yapan kapatt&#305;&#287;&#305; issue say&#305;s&#305;na g&ouml;re yap&#305;lm&#305;&#351; bir &#351;ey g&ouml;r&uuml;yorsan falan ama burada &ccedil;ok daha ayr&#305;nt&#305;l&#305; ve g&uuml;zel &#351;eylerini g&ouml;rebiliyor olmas&#305; bence &ccedil;ok iyi bir de&#287;er.</span></p><p class="c2"><span class="c0">Participant 2:</span><span class="c4">&nbsp;Seeing this visually is really important as it provides evidence. Usually, these things are done based on gut feelings, or you look at who closed the most issues, but here you can see much more detailed and valuable insights. </span></p><p class="c2"><span class="c1">L: (Time bar ve time statistics g&ouml;sterildi)</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Ya bu anormalliklerin i&ccedil;erisinde bulunan insanlar&#305;n say&#305;s&#305;, bu bulunma miktar&#305; ve hangi insanlar oldu&#287;u olabilir.</span></p><p class="c2"><span class="c0">Participant 2:</span><span class="c4">&nbsp;The number of people involved in these anomalies, the frequency, and which people they are could be included.</span></p><p class="c2"><span class="c1">U: Yani zaman i&ccedil;inde mesela hep Ali&#39;yi i&#351;in oda&#287;&#305;nda g&ouml;r&uuml;yorsak, nerede anomali var orada Ali var.</span></p><p class="c2"><span class="c0">U:</span><span class="c4">&nbsp;For example, if we always see Ali at the center of the issue, where there are anomalies, there is Ali.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Bu bir red flag olabilir.</span></p><p class="c2"><span class="c0">Participant 2:</span><span class="c4">&nbsp;This could be a red flag.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: De&#287;er &uuml;retece&#287;iniz &#351;&ouml;yle bir alan daha olabilir. &Ouml;zellikle build&#39;lerin yan&#305;na veya deployment&#39;lar&#305;n yan&#305;na bunu ba&#287;larsan&#305;z. Bu build&#39;te temel olarak neler var, farkl&#305; olan neler commit&#39;lendi, pull request&#39;lerden hareketle yani user story giden. &#350;imdi o a&ccedil;&#305;dan benzer &ccedil;al&#305;&#351;an &#351;eyler var hat&#305;rlars&#305;n. Onu g&ouml;rselle&#351;tirmi&#351; oluyorsunuz. Belli bir de&#287;er &ccedil;&#305;kabilir oradan.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;There could be another area where you can create value. Especially if you link this to builds or deployments. What is basically included in this build, what different things were committed, based on pull requests and user stories. Similar things are done in some aspects, if you remember. You are visualizing that. There can be some value derived from that.</span></p><p class="c2"><span class="c1">E: Evet yani bu deploy&#39;da &uuml;r&uuml;n&uuml;n &#351;u k&#305;s&#305;mlar&#305;na dokunulmu&#351;. Bu developer&#39;lar involve olmu&#351;. Baya&#287;&#305; g&uuml;zel olur.</span></p><p class="c2"><span class="c0">E:</span><span class="c4">&nbsp;Yes, it would be great to see which parts of the product were touched in this deployment and which developers were involved.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: &#350;u pull request&#39;ler, &#351;u dosyalar gibi. O zaten geli&#351;tiriciler taraf&#305;ndan kar&#351;&#305;l&#305;&#287;&#305;n&#305; bulur.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;Like which pull requests and files. That would resonate with the developers.</span></p><p class="c2"><span class="c1">E: Evet, evet g&uuml;zel olur.</span></p><p class="c2"><span class="c0">E:</span><span class="c4">&nbsp;Yes, yes, it would be good.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Hem de pipeline&#39;&#305; direkt eklemi&#351; olursunuz, ger&ccedil;ek zamanl&#305;.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;And you would directly add the pipeline, in real-time.</span></p><p class="c2 c8"><span class="c1"></span></p><p class="c2"><span class="c1">2:19:51 - 2:21:25</span></p><p class="c2"><span class="c1">L: Tamamd&#305;r, &#351;imdi isterseniz bu deneme b&ouml;l&uuml;m&uuml;nde yapt&#305;&#287;&#305;n&#305;z task&#39;lar dolay&#305;s&#305;yla verdi&#287;iniz cevaplar &uuml;zerinden gidebiliriz</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;Okay, now if you want, we can go over the answers you gave during this trial section.</span></p><p class="c2"><span class="c1">L: &#304;lk sorunuzda veriler Any23.java dosyas&#305; i&ccedil;in kimi expert olarak &ouml;nerdiniz diye sormu&#351;tuk. 2 ki&#351;iyi tercih etmenizi istemi&#351;tik. Birinci Lewis &ccedil;&#305;km&#305;&#351;, GitHub&#39;da ve bizim tool&#39;umuzda ortak olarak &ouml;yle g&ouml;r&uuml;n&uuml;yor. &#304;kinci olarak Hans ve Peter e&#351;it gelmi&#351;. Bu konu hakk&#305;nda, ikinciye Hans&#39;&#305; se&ccedil;en veya ikinci Peter&#39;&#305; se&ccedil;en bir kat&#305;l&#305;mc&#305; yorum yapmak ister mi acaba?</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;In the first question, we asked whom you recommended as an expert for the Any23.java file. We asked you to choose two people. Lewis came out as the first choice, appearing in both GitHub and our tool. For the second choice, Hans and Peter were tied. Would any participant who chose Hans as the second choice or Peter as the second choice like to comment on this?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 5: Ben en son commit edenlerden biri Peter oldu&#287;u i&ccedil;in onu se&ccedil;tim.</span></p><p class="c2"><span class="c0">Participant 5:</span><span class="c4">&nbsp;I chose Peter because he was one of the last committers.</span></p><p class="c2"><span class="c1">L: Yani g&uuml;ncelli&#287;i de&#287;erlendirdiniz.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Ben yanl&#305;&#351; sonucu bulmu&#351;tum herhalde ama Michael&#39;in baya&#287;&#305; commit&#39;i vard&#305;. Commit say&#305;s&#305; olarak baya&#287;&#305; fazlayd&#305;, onu g&ouml;rd&uuml;m. O y&uuml;zden onu se&ccedil;tim.</span></p><p class="c2"><span class="c0">Participant 2:</span><span class="c4">&nbsp;I think I found the wrong result, but Michael had quite a lot of commits. I saw the number of commits, so I chose him.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Sayd&#305;n m&#305; bir &#351;ey durum ya?</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;Did you count or something?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Evet, evet o &#351;eyi a&ccedil;t&#305;m, oradan bakt&#305;m, historisinden bakt&#305;m.</span></p><p class="c2"><span class="c0">Participant 2:</span><span class="c4">&nbsp;Yes, yes, I opened it and looked at the history.</span></p><p class="c2"><span class="c1">L: Daha eski oldu&#287;u i&ccedil;in puan&#305; daha d&uuml;&#351;&uuml;k &ccedil;&#305;k&#305;yordu.</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;Because it was older, his score was lower.</span></p><p class="c2"><span class="c1">2:21:25 - 2:22:01</span></p><p class="c2"><span class="c1">L: Di&#287;er bir sorumuzda da asl&#305;nda hangisinin daha g&uuml;venilir sonu&ccedil;lar verdi&#287;ini sormu&#351;tuk. Burada da san&#305;r&#305;m genel olarak insanlar recency value ile birlikte SAA&#39;y&#305; tercih etmi&#351;. Ama genelde SAA tercih edilmi&#351;. Bu konu hakk&#305;nda yorum yapmak isteyen olur mu?</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;In another question, we asked which tool provided more reliable results. It seems that people generally preferred SAA, considering the recency value. Would anyone like to comment on this?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Olamaz zaten biraz &#351;ey yani sonucu belli bir soru. &Ccedil;&uuml;nk&uuml; birisinde g&ouml;z yan&#305;lmas&#305;, insan &ccedil;abas&#305; var, birisinde otomatik bir &#351;ey var. Evet, kendi kendini do&#287;rulayan bir &#351;ey yani.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;It&rsquo;s a somewhat obvious question because one involves human effort and potential errors, while the other is automatic. It&#39;s a self-confirming thing.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 4: Bir de GitHub&#39;dan bakarken ben de &#351;&ouml;yle bir s&#305;k&#305;nt&#305; oluyor, yani ben onu hissediyorum. Sanki her &#351;eyi bakmad&#305;m m&#305;? Bilerek bir tahmin y&uuml;r&uuml;tt&uuml;&#287;&uuml;m&uuml; biliyorum ama burada hani bana bir &ouml;neri geldi&#287;i i&ccedil;in birazc&#305;k daha g&uuml;venilir geliyor. &Ouml;b&uuml;r&uuml;nde bir &#351;ey ka&ccedil;&#305;r&#305;yor muyum diye d&uuml;&#351;&uuml;n&uuml;yorum.</span></p><p class="c2"><span class="c0">Participant 4:</span><span class="c4">&nbsp;Also, when looking at GitHub, I sometimes feel like I might have missed something. I know I&#39;m guessing, but here, since I get a suggestion, it feels a bit more reliable. With GitHub, I worry if I missed something.</span></p><p class="c2"><span class="c1">2:22:01 - 2:24:40</span></p><p class="c2"><span class="c1">L: Di&#287;er bir sorumuzda ise SAA hakk&#305;nda inand&#305;r&#305;c&#305; bulmad&#305;ysan&#305;z nedenleri ne diye sormu&#351;tuk. Kompleksite &ccedil;&#305;km&#305;&#351;, bu konu hakk&#305;nda yorum yapmak isteyen olur mu?</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;In another question, we asked why you found SAA unconvincing, if that was the case. Complexity came up. Would anyone like to comment on this?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Bilmiyorum yani ben limitation tak&#305;ld&#305;m ama k&#305;sa s&uuml;rede &ouml;&#287;reniriz diye d&uuml;&#351;&uuml;nd&uuml;&#287;&uuml;m i&ccedil;in taraf tak&#305;lmad&#305;m.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;I don&rsquo;t know, I was hung up on the limitations, but I thought we could learn it in a short time, so I didn&#39;t dwell on it too much.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">E: Daha a&ccedil;ar m&#305;s&#305;n&#305;z?</span></p><p class="c5"><span class="c0">E:</span><span class="c4">&nbsp;Could you elaborate?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Onun d&#305;&#351;&#305;nda &#351;ey, yani ilk odakl&#305;y&#305;z ya, bu sonu&ccedil;ta benim koymu&#351; oldu&#287;um temel &#351;eye g&ouml;re kriterlere g&ouml;re bir veri &uuml;zerinde &ccedil;al&#305;&#351;acak zaten. Yani bizim d&uuml;nyalar&#305;nda i&#351; bi&ccedil;imimiz se&ccedil;ici, o da se&ccedil;ici bir veri k&uuml;mesi ile &ccedil;al&#305;&#351;aca&#287;&#305; i&ccedil;in zaten ba&#351;lang&#305;c&#305; gene ben se&ccedil;mi&#351; oluyorum. Asl&#305;nda benim s&#305;n&#305;rlamalar&#305;m, benim do&#287;ru olmayanlar belirlememle beraber &ccedil;al&#305;&#351;m&#305;&#351; oluyor. Ara&ccedil; kendisi her &#351;eyi gezme ve ke&#351;fetme alan&#305;na sahip de&#287;il. Benim i&ccedil;in bir &#351;ey oldu&#287;um sorular i&ccedil;erisinde kald&#305;&#287;&#305; i&ccedil;in beni devralmak zorunda. Birinci de nas&#305;l kendinden emin de&#287;ilsen burada s&#305;n&#305;rlar&#305; ben belirledi&#287;im i&ccedil;in &ouml;yle bir &#351;ey var zaten.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;Besides that, we&#39;re initially focused on a specific dataset, which works according to the criteria I set. Since our world is selective, and the tool works with a selective dataset, I&#39;m essentially setting the initial parameters. My limitations, my potentially incorrect assumptions, are what it works with. The tool doesn&#39;t have the freedom to explore and discover everything on its own. Since it remains within the questions I have, it has to take over from me. Just like when you&#39;re not confident in the first result, here, because I set the boundaries, it inherently has that aspect.</span></p><p class="c2"><span class="c1">E: Ama b&uuml;t&uuml;n ara&ccedil;lar b&ouml;yle olur o zaman.</span></p><p class="c2"><span class="c0">E:</span><span class="c6">&nbsp;But then all tools would be like that</span><span class="c1">Kat&#305;l&#305;mc&#305; 1: Yani o s&#305;f&#305;rdan ba&#351;layanlarla olmuyor biliyorsun yani her &#351;eyi tutuyorsan.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;It&rsquo;s not the same with tools that start from scratch and keep everything.</span></p><p class="c2"><span class="c1">E: Tamam. Bias&#39;la neyi kastettiniz? Niye bias?</span></p><p class="c2"><span class="c0">E:</span><span class="c4">&nbsp;What did you mean by bias? Why bias</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Onu ben s&ouml;yledim, bir nevi ister istemez burada bir istatistik bilimi konu&#351;uyor ve onunla ilgili &#351;eyler oldu&#287;u i&ccedil;in orada bu konuda bir bias&#39;&#305;n olmas&#305; gerekti&#287;ini d&uuml;&#351;&uuml;n&uuml;yorum. &Ccedil;&uuml;nk&uuml; daha &ouml;nce &ccedil;al&#305;&#351;t&#305;&#287;&#305;m projelerde bir g&uuml;n i&ccedil;erisinde b&uuml;t&uuml;n projenin &#351;eyini yazan ki&#351;i de&#287;i&#351;mi&#351;ti. &Ccedil;&uuml;nk&uuml; farkl&#305; bir repoya ta&#351;&#305;d&#305;k ve oradaki b&uuml;t&uuml;n i&#351;i yapan ki&#351;i sadece bir ki&#351;i olarak g&ouml;r&uuml;n&uuml;yordu. B&ouml;yle durumlar bu sefer b&ouml;yle &#351;eyler olabiliyor. Yani ge&ccedil;mi&#351;in silinmesi gibi durumlar olabilir. Bunlar oldu&#287;u i&ccedil;in tamamen g&uuml;venmek do&#287;ru gelmedi.</span></p><p class="c2"><span class="c0">Participant 2:</span><span class="c4">&nbsp;I mentioned that. Inevitably, because we&#39;re talking about statistical science and related aspects, I think there&#39;s a bias. In previous projects I worked on, the person responsible for the entire project in one day changed because we moved to a different repo, and all the work appeared to be done by one person. Such situations can erase the past, making it unreliable.</span></p><p class="c2"><span class="c1">E: Tamam okey, ama bu da yine yani herhangi bir tool i&ccedil;in ge&ccedil;erli olan bir &#351;ey. Yani ba&#351;ka bir x arac&#305; olsa o da ayn&#305; bias&#39;a sahip olurdu.</span></p><p class="c2"><span class="c0">E:</span><span class="c4">&nbsp;Okay, but this would be true for any tool, right? Any other tool would have the same bias.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Tabii ki, tabii ki.</span></p><p class="c2"><span class="c0">Participant 2:</span><span class="c4">&nbsp;Of course, of course.</span></p><p class="c2"><span class="c1">2:24:40 - 2:25:12</span></p><p class="c2"><span class="c1">L: Bir di&#287;er sorumuzda ise GitHub ile bulma y&ouml;nteminiz g&uuml;venilmez ise neden diye sormu&#351;tuk. Burada da limited content i&#351;aretlenmi&#351;, bu konu hakk&#305;nda yorum yapmak isteyen olur mu?</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;In another question, we asked how much you think this visualization contributes to making the results understandable. According to the answers, we generally think it has a positive contribution. Can someone who marked 3 discuss this?</span></p><p class="c2"><span class="c1">E: O zaman burada da limited content var de&#287;il mi?</span></p><p class="c2"><span class="c0">E:</span><span class="c6">&nbsp;So, limited content here as well, right?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Evet, aynen, onu i&#351;aretlemi&#351;tim.</span></p><p class="c2"><span class="c0">Participant 2:</span><span class="c4">&nbsp;Yes, exactly, I marked that.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Buras&#305; da benim i&ccedil;in kompleks geliyor, bir yerden sonra dosya b&uuml;y&uuml;kl&uuml;&#287;&uuml;n&uuml; g&ouml;r&uuml;p kompleksle&#351;iyor, insan s&#305;n&#305;r&#305;n&#305; a&#351;&#305;yor.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;This also feels complex to me. At some point, the file size increases and it becomes complex, exceeding human limits.</span></p><p class="c2"><span class="c1">2:25:12 - 2:26:11</span></p><p class="c2"><span class="c1">L: Di&#287;er bir sorumuzda da asl&#305;nda genel olarak bu g&ouml;rselle&#351;tirmenin sonu&ccedil;lar&#305;n anlamland&#305;r&#305;labilirli&#287;ine ne kadar katk&#305; sa&#287;lad&#305;&#287;&#305;n&#305; sormu&#351;tuk. Cevaplara g&ouml;re genel olarak pozitif katk&#305; sa&#287;lad&#305;&#287;&#305;n&#305; d&uuml;&#351;&uuml;n&uuml;yormu&#351;uz. Bunu da mesela 3 diyen biri konu&#351;abilir mi acaba?</span></p><p class="c5"><span class="c0">L:</span><span class="c4">&nbsp;In another question, we asked how much you think this visualization contributes to making the results understandable. According to the answers, we generally think it has a positive contribution. Can someone who marked 3 discuss this?</span></p><p class="c2"><span class="c1">E: Ya da nas&#305;l geli&#351;tirilebilir?</span></p><p class="c2"><span class="c0">E:</span><span class="c4">&nbsp;Or how it could be improved?</span></p><p class="c2"><span class="c1">L: Herhangi bir konu&#351;mak isteyen var m&#305;?</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;Does anyone want to comment?</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: G&ouml;rselle&#351;tirme, her hal&uuml;karda ba&#351;lang&#305;&ccedil;ta da s&ouml;yledi&#287;iniz gibi, bizim alg&#305;m&#305;z&#305;n daha g&uuml;&ccedil;l&uuml; oldu&#287;u bir alan. S&ouml;zl&uuml; yap&#305;ya g&ouml;re ya da yaz&#305;l&#305; yap&#305;ya g&ouml;re g&ouml;rsel yap&#305; &ccedil;ok daha iyi. Yani galiba &ouml;nce g&ouml;rsel sonra yaz&#305;l&#305; &#351;eye sahibiz. Alg&#305;ya sahibiz. G&ouml;rselin her halde y&uuml;ksek bir de&#287;eri var.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;Visualization, as you initially said, is a stronger area for our perception. Compared to verbal or written structures, visual structure is much better. I think we first have visual then written perception. Visuals inherently have high value.</span></p><p class="c2"><span class="c1">E: Tamam.</span></p><p class="c2"><span class="c0">E:</span><span class="c4">&nbsp;Okay</span></p><p class="c2 c8"><span class="c1"></span></p><p class="c2"><span class="c1">L: Tamam, di&#287;er bir sorumuzda da asl&#305;nda ekledi&#287;imiz bu g&ouml;rsel elementlerin, mesela node badgelerinin, anlay&#305;&#351;a ne kadar katk&#305; sa&#287;lad&#305;&#287;&#305;n&#305; sormu&#351;tuk. Bunda da genelde pozitif yan&#305;t &ccedil;&#305;km&#305;&#351;. Bu konu hakk&#305;nda konu&#351;mak isteyen olur mu? Yani &#351;u &#351;ekilde geli&#351;tirilebilir &#351;eklinde de bir yorum alabiliriz.</span></p><p class="c2 c8"><span class="c1"></span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;In another question, we asked how much the added visual elements, like node badges, contribute to understanding. The responses were generally positive. Would anyone like to comment on this? We can also take suggestions on how to improve it.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: G&ouml;rselli&#287;in, yani b&uuml;t&uuml;n g&uuml;zelli&#287;ine kar&#351;&#305;, asl&#305;nda daha &ouml;nce farkl&#305; yerlerde ba&#351;lad&#305;. Birka&ccedil; defa geldi belki de sizin de gelmi&#351;tir hat&#305;rlars&#305;n&#305;z. Yani normalde b&ouml;yle g&ouml;rsel olarak her &#351;ey &ouml;zetleme b&uuml;y&uuml;k geliyor ama bir anda &ccedil;al&#305;&#351;t&#305;&#287;&#305;m&#305;z veri k&uuml;mesinin ne kadar b&uuml;y&uuml;k oldu&#287;unu fark edip yeniden daralma ihtiyac&#305; var. &#304;&#351;te trace&#39;in gitti mesela, b&uuml;t&uuml;n projeleri ilk olarak kar&#351;&#305;n&#305;za koyup hi&ccedil;bir &#351;ey anlayamazs&#305;n&#305;z. M&uuml;mk&uuml;n de&#287;il, o kadar b&uuml;y&uuml;k bir yap&#305; ortaya &ccedil;&#305;k&#305;yor ki. Yani i&#351;te burada basit 7.000 tane not vard&#305;, 23 bin ili&#351;ki vard&#305;. Bir projede bir sene sonra o say&#305;ya ula&#351;&#305;rs&#305;n&#305;z zaten &ccedil;ok rahat bir &#351;ekilde. &Uuml;&ccedil;&uuml;nc&uuml; senesinde falan ya da ikinci senesinde say&#305;lar &ccedil;ok da b&uuml;y&uuml;k hale geliyor. Onu g&ouml;sterecek ilgi odakl&#305; bir yap&#305;ya d&ouml;n&uuml;&#351;t&uuml;rmeniz laz&#305;m.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;Despite the beauty of visuals, it actually started in different places before. Maybe you&#39;ve encountered it a few times as well. Normally, summarizing everything visually seems great, but suddenly realizing the vast size of the dataset we&#39;re working with makes us need to narrow it down again. For instance, when you first lay out all the projects in the trace, you can&#39;t understand anything. It&#39;s impossible because such a large structure emerges. Here, for instance, there were 7,000 nodes and 23,000 relationships. In a project, you easily reach that number within a year. By the third or even the second year, the numbers become very large. You need to transform it into a structure focused on interest.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Asl&#305;nda sorun orada, ilgi odakl&#305; g&ouml;rselle&#351;tirme. Yani hem insan alg&#305;s&#305;n&#305;n ba&#351; edebilece&#287;i hem ilgi &ccedil;ekebilecek g&ouml;sterim. Bu kadar g&uuml;zel diyorum &ccedil;&uuml;nk&uuml; her &#351;eyi koyarsan&#305;z zaten hi&ccedil;bir &#351;ey anla&#351;&#305;lmayan bir yap&#305; ortaya &ccedil;&#305;k&#305;yor.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;Actually, the issue is focused visualization, something that both human perception can handle and can be engaging. I&#39;m saying it&#39;s beautiful because if you put everything together, it becomes an incomprehensible structure.</span></p><p class="c2"><span class="c1">L: Asl&#305;nda yani bizim de bu complexity management ile ilgili koydu&#287;umuz &#351;eyler, ana noktada amac&#305;m&#305;z bahsetti&#287;iniz bu caselerin &ouml;n&uuml;ne ge&ccedil;ebilmek.</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;Actually, our main goal with the complexity management features we added is to address these cases you&#39;re mentioning.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Dashboard orada iyi olabilir, yani y&ouml;nelim sa&#287;layabilir. Yani ilgi odakl&#305; bir g&ouml;rselle&#351;tirme ile beraber benim alg&#305;m&#305;n, ba&#351; edebilmesini istiyorum. Bir de bu zooming var ya, yak&#305;nla&#351;ma uzakla&#351;ma, yak&#305;nla&#351;t&#305;k&ccedil;a &#351;eyler artar, expand eder. O &#351;eyler, gruplar&#305;n, klaslar&#305;n ya da yap&#305;lar&#305;n uzakla&#351;t&#305;klar&#305;nda toplanmas&#305; alg&#305;y&#305; daha rahat y&ouml;netir.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;A dashboard could be useful there, providing direction. I want my perception to be able to handle it with interest-focused visualization. And there&#39;s the zooming feature, where things expand as you zoom in. When you zoom out, groups, classes, or structures collapse, making it easier to manage perception.</span></p><p class="c2"><span class="c1">E: Tamamd&#305;r.</span></p><p class="c2"><span class="c0">E:</span><span class="c4">&nbsp;Understood.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Onu optimize etmek gerekirdi diye d&uuml;&#351;&uuml;n&uuml;yorum.</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;I think it needs to be optimized.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">&nbsp;2:28:02 - 2:32:20</span></p><p class="c3"><span class="c1"></span></p><p class="c3"><span class="c1"></span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">L: Di&#287;er bir sorumuzda asl&#305;nda SAA ile expert bulman&#305;n sizin normalde kulland&#305;&#287;&#305;n&#305;z metoda k&#305;yasla daha kolay olup olmad&#305;&#287;&#305;n&#305; sormu&#351;tuk. Genellikle kullan&#305;c&#305;lar daha kolay oldu&#287;unu d&uuml;&#351;&uuml;nm&uuml;&#351;.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">L:</span><span class="c4">&nbsp;In another question, we asked if finding experts with SAA was easier compared to the method you normally use. Generally, users thought it was easier.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">E: &#350;imdi bunu ge&ccedil;elim.</span></p><p class="c2"><span class="c0">E:</span><span class="c6">&nbsp;Let&#39;s move on.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">L: Ge&ccedil;iyoruz. Bu da zaten san&#305;r&#305;m genelde herkes &uuml;&ccedil; ki&#351;iyi bulmu&#351;, bir ki&#351;i b&uuml;y&uuml;k bulmu&#351;. Bunlar hakk&#305;nda konu&#351;mak isteyen var m&#305; yoksa direkt ge&ccedil;ebilirim. Sonu&ccedil;lar&#305;m&#305;z&#305;n nas&#305;l bir deneyimdi sizce? Kolay m&#305;yd&#305; de&#287;il miydi?</span></p><p class="c3"><span class="c4"></span></p><p class="c5"><span class="c0">L:</span><span class="c4">&nbsp;Moving on. It seems that most people found three experts, one person found more. Does anyone want to comment on this or shall we move on? What was your experience with our results? Was it easy or not?</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">Kat&#305;l&#305;mc&#305; 4: Ya JQL bence genel olarak &ccedil;ok zor, hi&ccedil; user friendly de&#287;il. Onun i&ccedil;in bunun bir alternatif olmas&#305; &#351;ahsen benim ho&#351;uma gitti.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">Participant 4:</span><span class="c4">&nbsp;Well, JQL is generally very difficult, not user-friendly at all. So personally, I liked having this as an alternative.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Zaten Jira onu &ccedil;ok eskiden beri kullan&#305;yor ve vazge&ccedil;miyor. O &#351;ey, ta &ouml;ncelerden, Bugzilla&#39;dan falan gelen bir &ouml;zellik. Ta eskilerden SQL yazmak zaten sadece developer&#39;lar&#305;n kulland&#305;&#287;&#305; bir ara&ccedil; oldu&#287;u i&ccedil;in o d&ouml;nemde ama sonra i&#351;te g&ouml;rsel anlat&#305;m ya da SQL&#39;in b&ouml;yle daha yap&#305;sal edit&ouml;rleri falan &ouml;ne &ccedil;&#305;km&#305;&#351;t&#305; ama Jira oradan developer&#39;lardan dolay&#305; vazge&ccedil;medi. Sevenler de &ccedil;ok, mesela hocam da seviyordu, &ccedil;ok seven de var o haline yani onu mesela kapatsan isyan &ccedil;&#305;kar.</span></p><p class="c5"><span class="c0">Participant 1:</span><span class="c4">&nbsp;Jira has been using that for a long time and hasn&#39;t let go of it. It&#39;s a feature from long ago, from Bugzilla, because SQL was only used by developers back then. Later, visual representation or more structured SQL editors became prominent, but Jira didn&#39;t move away from it because of developers. Many people love it, for instance, my professor loved it. If you shut it down, there would be an uproar.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Fakat d&#305;&#351;ar&#305;dan ba&#351;lad&#305;&#287;&#305;n&#305;z zaman da zor, anlaml&#305; de&#287;il. Yani biliyorsun ki niye &#351;imdi b&ouml;yle bir &#351;eyle i&#351;kence &ccedil;ekiyoruz? Se&ccedil;mek i&ccedil;in &ccedil;ok daha kolay se&ccedil;enek de olabilir falan diyorsunuz. &#304;li&#351;kisine g&ouml;re.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">Participant 1:</span><span class="c4">&nbsp;But starting from scratch is hard and meaningless. You wonder why you&#39;re suffering with this. There could be much easier options for selection based on relationships.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">L: Tamamd&#305;r, ge&ccedil;iyoruz.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">L:</span><span class="c4">&nbsp;Okay, moving on.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">L: Mesela baz&#305; caselerde JQL kullan&#305;larak bulunamayan anomallerimiz var. Mesela son anomaly asl&#305;nda &ouml;yleydi. Yani direkt resolver b&ouml;l&uuml;m&uuml;ne direkt eden bir field olmad&#305;&#287;&#305; i&ccedil;in JQL ile zaten bulam&#305;yorduk, bulamad&#305;k san&#305;r&#305;m.</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;In some cases, we have anomalies that can&#39;t be found using JQL. For instance, the last anomaly was like that. Since there wasn&#39;t a field directly pointing to the resolver section, we couldn&#39;t find it with JQL.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">L: &#350;imdi devam edelim.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">L:</span><span class="c4">&nbsp;Let&#39;s continue.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">L: Di&#287;er bir sorumuzda asl&#305;nda, y&uuml;ksek say&#305;da anomaly&#39;ye sahip bir issue bulup daha sonras&#305;nda Jira&#39;dan gidip bu issue&#39;nun paneline gidip o panelden inceleme yap&#305;p ka&ccedil; anomaly g&ouml;rebiliyorsunuz, bunu yazman&#305;z&#305; istemi&#351;tik.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">L:</span><span class="c4">&nbsp;In another question, we asked you to find an issue with a high number of anomalies, go to that issue&#39;s panel in Jira, and write down how many anomalies you could see.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">E: Bu da bir &#351;ey durumu oldu&#287;unu, cevab&#305; verince daha kolay anla&#351;&#305;lm&#305;&#351; olabilir. &Ouml;yle bir durum olmu&#351; oldu da.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">E:</span><span class="c4">&nbsp;This might have been easier to understand after answering. That&rsquo;s how it seemed.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">L: Zaten san&#305;r&#305;m herkes &ccedil;o&#287;unu bulabilmi&#351;. Onun d&#305;&#351;&#305;nda bir ki&#351;i san&#305;r&#305;m hi&ccedil;birini bulamam&#305;&#351;.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">L:</span><span class="c4">&nbsp;It seems most people found most anomalies. Except one person who couldn&#39;t find any.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Benimdir o ya, ben duruyor ya normalde bak&#305;nca. Ya bununla ilgili mi yok zaten?</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">Participant 1:</span><span class="c4">&nbsp;That must be me. Normally, it seems like there isn&rsquo;t anything related to this.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">L: Anlad&#305;m.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">L:</span><span class="c4">&nbsp;I understand.</span></p><p class="c2"><span class="c1">L: Son sorumuzda da asl&#305;nda Jira ve SAA&#39;y&#305; kar&#351;&#305;la&#351;t&#305;rd&#305;&#287;&#305;m&#305;zda anomaly detection a&ccedil;&#305;s&#305;ndan hangisinde daha rahatt&#305; diye sormu&#351;tuk ama zaten konu&#351;tuk. &Uuml;st&uuml;ne daha fazla konu&#351;mak isteyen olursa.</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;In our last question, we asked which was easier for anomaly detection, Jira or SAA, but we&#39;ve already discussed this. If anyone wants to comment further.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Ya ben tek tek hepsine bakmaya &ccedil;al&#305;&#351;t&#305;m, geride tutturamad&#305;m yani oradaki &#351;eyleri.</span></p><p class="c2"><span class="c0">Participant 2:</span><span class="c4">&nbsp;I tried to look at each one, but I couldn&#39;t keep up with the items there.</span></p><p class="c2"><span class="c1">L: Tamamd&#305;r. Yine en son sorumuzda daha kolay m&#305;yd&#305;, zor muydu? Normalde kulland&#305;&#287;&#305;n&#305;z bir practice ile k&#305;yaslad&#305;&#287;&#305;n&#305;zda diye sormu&#351;tuk. Burada yakla&#351;&#305;k 3 ki&#351;i &ccedil;ok daha kolay oldu&#287;unu, 2 ki&#351;i de b&ouml;yle bir metodu kullanmad&#305;&#287;&#305;n&#305; zaten belirtmi&#351;.</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;Okay. In our final question, we asked if it was easier or harder compared to the method you normally use. About three people said it was much easier, and two said they don&#39;t use such a method.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 1: O mavi hangi mavi, %40 olan?</span></p><p class="c2"><span class="c0">Participant 1:</span><span class="c4">&nbsp;Which blue is that blue, the one that&#39;s 40%?</span></p><p class="c2"><span class="c1">L: Hocam, o daha &ouml;nce b&ouml;yle bir tool kullanmad&#305;m.</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;I haven&#39;t used such a tool before.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 4: Ha, di&#287;er t&uuml;rl&uuml; &ccedil;ok ilgin&ccedil; olurdu.</span></p><p class="c2"><span class="c0">Participant 4:</span><span class="c4">&nbsp;Oh, otherwise it would be very interesting.</span></p><p class="c2"><span class="c1">U: Burada size baya&#287;&#305; g&ouml;ndermemiz gerekebilirdi.</span></p><p class="c2"><span class="c0">U:</span><span class="c4">&nbsp;We might have needed to send you quite a bit here.</span></p><p class="c2"><span class="c1">L: O zaman ba&#351;ka yorumu olan yoksa devam edeyim? Son bir sorumuz kald&#305;.</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;If no one else has a comment, shall I continue? We have one last question left.</span></p><p class="c2"><span class="c1">2:32:20 - 2:36:00</span></p><p class="c2"><span class="c1">L: Genel olarak SAA hakk&#305;ndaki deneyiminizi sormak istemi&#351;tik. Kafa kar&#305;&#351;t&#305;r&#305;c&#305; noktalar&#305; neydi sizce veya siz bu arac&#305; kullan&#305;yor olsayd&#305;n&#305;z en fazla hangi use case baz&#305;nda kullan&#305;yor olurdunuz? Hani inspection kullan&#305;rd&#305;n&#305;z yoksa yeni bir analiz mi entegre ederdiniz, yoksa h&acirc;lihaz&#305;rda olan analizlerden birini mi kullan&#305;rd&#305;n&#305;z? Bu &#351;ekilde bir soru sormu&#351;tur.</span></p><p class="c2"><span class="c0">L:</span><span class="c4">&nbsp;We wanted to ask about your overall experience with SAA. What were the confusing points, and if you were using this tool, for which use case would you use it the most? Would you use it for inspection, integrate a new analysis, or use one of the existing analyses? This was the question.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 3: Skor k&#305;sm&#305;n&#305; kesin kullan&#305;rd&#305;m (expert, reviewer part). Oras&#305; benim en &ccedil;ok ho&#351;uma giden yerlerden birisi. Hatta daha da geli&#351;ebilir bence o k&#305;s&#305;mlar. Bu tabii anomaly detection k&#305;s&#305;mlar&#305;na da bakard&#305;k, onu ara ara kullanmak isterdik ama bunu bize raporlasa daha iyi olurdu. &Ccedil;&uuml;nk&uuml; ben s&uuml;rekli a&ccedil;&#305;p bakamam. Oraya mesai harcamadan, bana raporlasa &quot;Ha &ouml;yle mi?&quot; deyip bir detay&#305;na bakmak isterdim. O k&#305;s&#305;m benim ho&#351;uma gitti. Bir de ger&ccedil;ekten hani &ccedil;ok, g&ouml;rsel a&ccedil;&#305;dan yani ne kadar &ccedil;ok nesne olsa da i&ccedil;ine girdik&ccedil;e yeni yeni kap&#305;lar a&ccedil;&#305;yor size. Bir a&#287;a&ccedil; olu&#351;uyor gibi. Belli bir noktadan sonra ipin ucunu ka&ccedil;&#305;rabilirdik. Yani baz&#305; i&#351;lerimiz ger&ccedil;ekten &ccedil;ok detayl&#305; oluyor ama belli noktada da ger&ccedil;ekten i&#351;imizi &ccedil;ok rahatlat&#305;r. &quot;Ha &ouml;yle mi? Sonra ne olmu&#351;? Kim review etmi&#351;? Ne s&#305;k&#305;nt&#305; ya&#351;am&#305;&#351;?&quot; falan g&ouml;rmek a&ccedil;&#305;s&#305;ndan g&ouml;rsel a&ccedil;&#305;dan da ger&ccedil;ekten faydas&#305; olurdu, onu da kullan&#305;rd&#305;k b&uuml;y&uuml;k ihtimalle.</span></p><p class="c2"><span class="c0">Participant 3:</span><span class="c4">&nbsp;I would definitely use the scoring part (expert, reviewer part). That&#39;s one of my favorite areas. I think it could be further developed. We would also look at the anomaly detection parts from time to time, but it would be better if it reported to us. Because I can&#39;t keep checking it all the time. If it could report to me without spending time on it, I would look into the details. I liked that part. And visually, even though there are many objects, it opens new doors as you dive in. It&rsquo;s like a tree forming. At a certain point, we might lose track of it. Some of our tasks are very detailed, but at some point, it would really make our job easier. &quot;Oh, really? What happened next? Who reviewed it? What issues were there?&quot; Visually, it would be really useful, and we would probably use it.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 3: Genel olarak b&ouml;yle ama bence en g&uuml;&ccedil;l&uuml; oldu&#287;umuz. Burada belki hi&ccedil; konu&#351;ulmayan bir nokta ama, yani b&uuml;t&uuml;n bu veriyi al&#305;p bir database olu&#351;turman&#305;z ve onu g&ouml;rselle&#351;tirebilmeniz ger&ccedil;ekten g&uuml;zel bir &ouml;zellik. Bu database&#39;i belki farkl&#305; noktalarda da evrille&#351;tirebilirsiniz, geli&#351;tirebilirsiniz. Mesela bir pandas gibi bir veri i&#351;leme tool&#39;u i&ccedil;erisinde oradaki database&#39;i de&#287;erlendirip farkl&#305; dashboard&#39;lar olu&#351;turabilme, onlar&#305; g&ouml;sterme, belki bunu kullan&#305;c&#305;n&#305;n yapmas&#305;na izin verme.</span></p><p class="c2"><span class="c0">Participant 3:</span><span class="c4">&nbsp;Overall, that&#39;s it, but I think our strongest point, which might not have been discussed here, is being able to take all this data, create a database, and visualize it. It&#39;s a really nice feature. This database could be evolved and developed at different points. For example, using a data processing tool like Pandas to evaluate the database, create different dashboards, show them, and maybe allow the user to do this.</span></p><p class="c2"><span class="c1">Kat&#305;l&#305;mc&#305; 3: Hani burada SQL yaz&#305;yoruz da orada da kendimize ait bir dil olsa da, mesela ben onun &uuml;zerinden bir &#351;eyler yapabilsem dedim. Fikir sadece tabii, o &ccedil;ok daha detayl&#305; kapsaml&#305; konular, onun detay&#305;n&#305; &ccedil;ok bilemem ama o tarz yap&#305;lar belki g&uuml;zel olabilirdi. Tabii.</span></p><p class="c5"><span class="c0">Participant 3:</span><span class="c4">&nbsp;We write SQL here, but having our own language there, for instance, if I could do things with it, would be nice. It&#39;s just an idea, of course, very detailed and comprehensive topics that I can&#39;t fully detail, but such structures could be good. Of course.</span></p><p class="c5"><span class="c1">L: Cok te&#351;ekk&uuml;r ederiz.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">L:</span><span class="c4">&nbsp;Thank you very much.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Benim i&ccedil;in ve dikkatimi &ccedil;eken k&#305;s&#305;m bu anomaly detection b&ouml;l&uuml;m&uuml;yd&uuml;. Daha &ccedil;ok, yani muhtemelen commit ile ilgili olan k&#305;s&#305;mlar. &Ccedil;ok fazla i&#351;imize yarar m&#305;, emin de&#287;ilim. &Ccedil;&uuml;nk&uuml; bir projedeki &#351;eyin o commit ile &ouml;l&ccedil;&uuml;lmesine genel olarak kar&#351;&#305; oldu&#287;um i&ccedil;in falan gibi bir durum var. Anomaly k&#305;sm&#305; bence &ccedil;ok de&#287;erli bir k&#305;s&#305;m. Oray&#305; kesinlikle kullan&#305;rd&#305;m diye d&uuml;&#351;&uuml;n&uuml;yorum. Bir de o k&#305;s&#305;mlar&#305;n asl&#305;nda arka plan&#305;n&#305;n nas&#305;l &ccedil;al&#305;&#351;t&#305;&#287;&#305;n&#305;, yani oralara tam anlamad&#305;m, anlamak isterdim. Daha do&#287;rusu ve en ba&#351;ta bahsetmi&#351;tiniz. Buraya bir &#351;ey eklemek istedi&#287;imizde &#351;unlar&#305; kullan&#305;yoruz, bunu &#351;&ouml;yle b&ouml;yle yapar&#305;z diye bahsetmi&#351;tiniz. Belki oralar biraz daha a&ccedil;&#305;k olabilirdi. Eklemek i&ccedil;in yani yeni &#351;eyler entegre etmenin daha kolay oldu&#287;u bir d&uuml;nya daha iyi olabilir diye d&uuml;&#351;&uuml;n&uuml;yorum. Belki kolayd&#305;r bu arada, ben anlamam&#305;&#351; olabilirim.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">Participant 2:</span><span class="c4">&nbsp;For me, the part that caught my attention was the anomaly detection section. More specifically, probably the parts related to commits. I&#39;m not sure how much it would benefit us because I&#39;m generally opposed to measuring something in a project based on commits. I think the anomaly section is very valuable. I would definitely use that. Also, I didn&#39;t fully understand how the backend of those parts works. You mentioned at the beginning about adding things and how you would do it. Maybe those areas could be a bit clearer. I think a world where it&#39;s easier to integrate new things would be better. Maybe it&#39;s already easy, and I just didn&#39;t understand it.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">U: Biz zaten bir tane developer guide yazd&#305;k. Yani birileri gelip de bu arac&#305; al&#305;r ve yeni bir analitik metodu eklemek isterse hangi steplerden ge&ccedil;mesi gerekti&#287;ini d&ouml;k&uuml;man ettik. Dolay&#305;s&#305;yla o zor bir &#351;ey de&#287;il.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">U:</span><span class="c4">&nbsp;We actually wrote a developer guide. So if someone comes and wants to add a new analytical method to this tool, we&#39;ve documented the steps they need to take. Therefore, it&#39;s not difficult.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">L: Bug&uuml;n burada &ccedil;ok ayr&#305;nt&#305;l&#305; bir anlat&#305;m yapamad&#305;m o b&ouml;l&uuml;mle ilgili.</span></p><p class="c5"><span class="c0">L:</span><span class="c4">&nbsp;I didn&#39;t give a detailed explanation of that section today.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">Kat&#305;l&#305;mc&#305; 2: Tabii, tabii do&#287;ru. Evet, do&#287;ru.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">Participant 2:</span><span class="c4">&nbsp;Of course, that&#39;s true.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Ben de &#351;&ouml;yle d&uuml;&#351;&uuml;n&uuml;yorum, normal olaylar&#305; de&#287;erlendirirken perspektif bazl&#305; d&uuml;&#351;&uuml;nmek fayda getirebilir. Burada bir de&#287;er var. De&#287;erin kimin i&ccedil;in ne ifade etti&#287;ini, ger&ccedil;ekten kimin hayata ne kataca&#287;&#305;n&#305; biraz &#351;ekillendirmek laz&#305;m. O zaman de&#287;er olup olmad&#305;&#287;&#305;n&#305; ger&ccedil;ekten anlayaca&#287;&#305;z. Yani bulgu de&#287;er midir, yoksa bulgu olarak m&#305; kal&#305;r. Bu da perspektif bazl&#305; bakarsak, hakikaten &#351;ey, end&uuml;striyel rollere g&ouml;re, belki farkl&#305; farkl&#305; alanlarda ve farkl&#305; farkl&#305; kullan&#305;c&#305;lar&#305;n pozisyonuna g&ouml;re iyi olabilir. User story&#39;den ba&#351;lay&#305;p build ve deploy&#39;a kadar gitmek laz&#305;m. &Uuml;r&uuml;n y&ouml;neticisi i&ccedil;in, geli&#351;tirme tak&#305;m&#305; i&ccedil;in, geli&#351;tiriciler i&ccedil;in, test taraf&#305; i&ccedil;in ya da DevOps taraf&#305; i&ccedil;in, herkes i&ccedil;in ayr&#305; i&ccedil;g&ouml;r&uuml;ler, insight&#39;lar veren &#351;eyler ortaya &ccedil;&#305;karmak. &Ccedil;&uuml;nk&uuml; herkes i&ccedil;in ayn&#305; &#351;ey, bir &#351;ey herkeste ayn&#305; de&#287;er olu&#351;turulmaz ama farkl&#305; farkl&#305; bak&#305;&#351;lara g&ouml;re sunabilece&#287;iniz de&#287;er k&uuml;meleri var. Bak&#305;&#351;lara g&ouml;re sunarsan&#305;z fayda y&uuml;kselir.</span></p><p class="c3"><span class="c4"></span></p><p class="c5"><span class="c0">Participant 1:</span><span class="c4">&nbsp;I also think that when evaluating normal events, thinking from a perspective-based approach can be beneficial. There&#39;s value here. We need to shape what the value means to whom and who will actually benefit from it. That&#39;s when we&#39;ll truly understand if it&#39;s valuable. Whether a finding is valuable or just remains a finding. If we look at it from a perspective-based view, it could be good for different industrial roles, in different areas, and according to the positions of different users. We need to go from the user story to the build and deploy stages. Creating insights for the product manager, the development team, developers, the test side, or the DevOps side. Because the same thing won&#39;t have the same value for everyone, but there are value sets you can present from different perspectives. If you present it from different perspectives, the benefit increases.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">E: Te&#351;ekk&uuml;r ederiz.</span></p><p class="c3"><span class="c4"></span></p><p class="c5"><span class="c0">E:</span><span class="c4">&nbsp;Thank you.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">L: Bu kadar, zaten ba&#351;ka bir sorumuz yoktu. &Ccedil;ok te&#351;ekk&uuml;r ederiz. Sende bir sorun yok, anlad&#305;n.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">L:</span><span class="c4">&nbsp;That&#39;s all, we didn&#39;t have any other questions. Thank you very much. You understood, no problem.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c1">Kat&#305;l&#305;mc&#305; 1: Polislik yerine do&#287;al olarak sa&#287;l&#305;k taraf&#305;ndan yenilik daha iyi. Asl&#305;nda bu projenin ya da geli&#351;tirmenin sa&#287;l&#305;&#287;&#305; gibi, ya da &uuml;r&uuml;n sa&#287;l&#305;&#287;&#305; gibi sa&#287;l&#305;k s&ouml;zc&uuml;kleri daha g&uuml;zel oluyor. Yoksa finding ve policy taraf&#305; biraz daha &uuml;rk&uuml;t&uuml;c&uuml;, korkutuyor. Herkes ka&ccedil;ar oradan. Commit say&#305;s&#305; ya da de&#287;i&#351;iklik say&#305;s&#305; ya da adam saat gibi de&#287;erler genelde insanlar&#305; rencide ediyor.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">Participant 1:</span><span class="c4">&nbsp;Instead of policing, it&#39;s naturally better to approach it from a health perspective. Terms like the health of the project or the health of the development are better. Otherwise, the terms finding and policy can be a bit intimidating and scary. Everyone would avoid that. Values like the number of commits, the number of changes, or man-hours usually embarrass people.</span></p><p class="c5"><span class="c1">E: Bir de bir tane survey daha g&ouml;nderece&#287;iz, onu da doldurursan&#305;z seviniriz. Onu sonra ile g&ouml;nderecek. &Ccedil;ok te&#351;ekk&uuml;r ederiz. &Ccedil;ok katk&#305;da bulundunuz. &Ccedil;ok sa&#287; olun, &ccedil;ok g&uuml;zel feedback&#39;ler ald&#305;k, kullanaca&#287;&#305;z. &Ccedil;ok sa&#287; olun.</span></p><p class="c3"><span class="c1"></span></p><p class="c5"><span class="c0">E:</span><span class="c4">&nbsp;We&#39;ll also send another survey, and we would appreciate it if you could fill it out. We will send it later. Thank you very much. You contributed a lot. We received great feedback that we will use. Thank you very much.</span></p><p class="c3"><span class="c1"></span></p></body></html>