<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol{margin:0;padding:0}table td,table th{padding:0}.c12{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:26pt;font-family:"Arial";font-style:normal}.c9{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify;height:11pt}.c13{padding-top:0pt;padding-bottom:3pt;line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:justify}.c2{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left;height:11pt}.c1{color:#9900ff;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c4{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c3{padding-top:12pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c10{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c0{padding-top:12pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c14{max-width:468pt;padding:72pt 72pt 72pt 72pt}.c6{color:#9900ff;font-weight:700}.c5{background-color:#ffffff}.c7{font-weight:700}.c8{color:#9900ff}.c11{height:11pt}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c5 c14 doc-content"><p class="c13 title" id="h.o5evi6c5t3e9"><span class="c12">Session-2 Transcribed</span></p><p class="c9"><span class="c4"></span></p><p class="c2"><span class="c4"></span></p><p class="c10"><span class="c4">L:Author 1</span></p><p class="c10"><span class="c4">E: Author 2</span></p><p class="c10"><span>U: Author 3</span></p><p class="c9"><span class="c4 c5"></span></p><p class="c3"><span class="c4">0:00 - 1:35</span></p><p class="c3"><span class="c4">&nbsp;L: &Ouml;ncelikle herkese geldi&#287;i i&ccedil;in &ccedil;ok te&#351;ekk&uuml;r ederiz. Bug&uuml;n ayn&#305; &#351;ekilde bu oturumun kaydedilmesine izin verdi&#287;iniz i&ccedil;in te&#351;ekk&uuml;rler. Bug&uuml;n genel olarak proje s&#305;ras&#305;nda ortaya &ccedil;&#305;kan yaz&#305;l&#305;m eserlerinin (software artifacts) g&ouml;rsel bir &#351;ekilde analizinin ve bu ba&#287;lamda al&#305;nacak kararlarda destek sa&#287;layacak Software Artifact Analyzer (SAA) adl&#305; arac&#305; size tan&#305;tmak ve en &ouml;nemlisi sizin hem ara&ccedil; hakk&#305;nda hem de genel olarak d&uuml;&#351;&uuml;ncelerinizi &ouml;&#287;renmek i&ccedil;in topland&#305;k.</span></p><p class="c3"><span class="c1">L: First of all, we would like to thank everyone for coming. We also appreciate your permission to record this session today. Today, we are gathered to introduce you to a tool called Software Artifact Analyzer (SAA), which visually analyzes software artifacts that emerge during the project and supports decision-making in this context. Most importantly, we are here to learn your thoughts and feedback about both the tool and the general topic.</span></p><p class="c3"><span class="c4">1:35 - 2:16</span></p><p class="c3"><span class="c4">&nbsp;L: &#304;sterseniz biz bilgisayarlar&#305;m&#305;zdan g&ouml;r&uuml;nen wifi&#39;ye ba&#287;lanabilirsiniz. Bu s&#305;rada ben de k&#305;saca bug&uuml;n bu &ccedil;al&#305;&#351;mada yapacaklar&#305;m&#305;z&#305; &ouml;zetlemek istiyorum. &#304;lk olarak bu haftan&#305;n ba&#351;&#305;nda sizinle payla&#351;m&#305;&#351; oldu&#287;um &ouml;n ankette verdi&#287;iniz cevaplar &uuml;zerinden gidece&#287;iz. Onlar hakk&#305;nda konu&#351;aca&#287;&#305;z. Daha sonras&#305;nda ben genel olarak bu projede kulland&#305;&#287;&#305;m&#305;z konseptler hakk&#305;nda k&#305;sa bir anlat&#305;m yapaca&#287;&#305;m. Ard&#305;ndan size SAA arac&#305;m&#305;z&#305;n k&uuml;&ccedil;&uuml;k bir demosunu yapaca&#287;&#305;m ve &uuml;zerinden bir anlat&#305;m ger&ccedil;ekle&#351;tirece&#287;im.</span></p><p class="c3"><span class="c1">L: If you would like, you can connect to the visible WiFi from your computers. Meanwhile, I would like to briefly summarize what we will be doing in this session today. First, we will go over the responses you provided in the pre-survey that I shared with you at the beginning of this week. We will discuss them. After that, I will give a brief presentation on the concepts we use in this project. Following that, I will give a short demo of our SAA tool and provide an explanation.</span></p><p class="c3"><span class="c4">2:16 - 2:51 </span></p><p class="c3"><span class="c4">L: Daha sonras&#305;nda dedi&#287;imiz gibi sizden bu SAA arac&#305;n&#305; denemenizi isteyece&#287;iz ve bu baz&#305; yapman&#305;z i&ccedil;in size 2 tane k&uuml;&ccedil;&uuml;k g&ouml;rev verece&#287;iz. En sonunda da asl&#305;nda hem bu &ccedil;al&#305;&#351;ma boyunca ki deneyiminizi hem de genel d&uuml;&#351;&uuml;nce ve g&ouml;r&uuml;&#351;lerinizi payla&#351;man&#305;z a&ccedil;&#305;s&#305;ndan sizi baz&#305; sorular y&ouml;nlendirece&#287;iz ve bu sorular ba&#287;lam&#305;nda da tart&#305;&#351;man&#305;z&#305; isteyece&#287;iz. Bu &#351;ekilde &#351;imdi o zaman isterseniz &ouml;n anketle devam edelim. Bu arada ana amac&#305;m&#305;z sizin d&uuml;&#351;&uuml;nce ve g&ouml;r&uuml;&#351;lerinizi &ouml;&#287;renmek. O y&uuml;zden istedi&#287;iniz bir noktada istedi&#287;iniz gibi katk&#305; verebilirsiniz.</span></p><p class="c3"><span class="c1">L: Afterwards, as we mentioned, we will ask you to try out the SAA tool, and we will give you two small tasks to complete. At the end, we will ask you some questions to share your overall experience during this study as well as your general thoughts and opinions. We will then ask you to discuss these questions. Now, if you are ready, let&#39;s continue with the pre-survey. Meanwhile, our main goal is to learn your thoughts and opinions. Therefore, you can contribute at any point and in any way you like.</span></p><p class="c3"><span class="c4">2:43 - 3:41</span></p><p class="c3"><span class="c4">&nbsp;L: &#350;imdi ilk tur olaca&#287;&#305; i&ccedil;in ilk ba&#351;ta kendinizi tan&#305;t&#305;p ba&#351;larsan&#305;z di&#287;er kat&#305;l&#305;mc&#305;lar&#305;n da sizi tan&#305;mas&#305; ve herkesin birbirini daha iyi tan&#305;mas&#305; a&ccedil;&#305;s&#305;ndan.</span></p><p class="c3"><span class="c1">L: Since this is the first round, please start by introducing yourself so that other participants can get to know you and everyone can get to know each other better.</span></p><p class="c3"><span class="c4 c5">L: Pre-Survey_1-2. Soru: &#304;lk 2 sorumuzda asl&#305;nda hangi version control sistemi ve bug tracking sistemi kulland&#305;&#287;&#305;n&#305;z&#305; sormu&#351;tuk. Zaten kat&#305;l&#305;mc&#305;yla da &ccedil;o&#287;u Git tabanl&#305; bir ara&ccedil; kullan&#305;yor. Bunun d&#305;&#351;&#305;nda bu session&#39;da olan herkes Jira kullan&#305;yor diye anlad&#305;m. Bu arada &#351;u anda 10 kat&#305;l&#305;mc&#305;ya ait veri var. &Ccedil;&uuml;nk&uuml; bir de ge&ccedil;en hafta bir session yapm&#305;&#351;t&#305;k. Bu sonu&ccedil;lar hakk&#305;nda yorum yapmak isteyen olur mu? </span></p><p class="c3"><span class="c1">L: Pre-Survey_1-2. Question: In the first two questions, we asked which version control system and bug tracking system you use. Most participants already use a Git-based tool. Besides that, I understood that everyone in this session uses Jira. By the way, we currently have data from 10 participants. Because we also had a session last week. Would anyone like to comment on these results?</span></p><p class="c3"><span class="c4 c5">K1: Standart yani, Github, Jira. </span></p><p class="c3"><span class="c1 c5">Participant1: It&#39;s standard, Github, Jira.</span></p><p class="c3"><span class="c4 c5">K2: Community zaten destekliyor. </span></p><p class="c3"><span class="c1 c5">Participant2: The community already supports it.</span></p><p class="c3"><span class="c4 c5">K1: Daha &ouml;nemlisi bu iki &uuml;r&uuml;n&uuml; kulland&#305;&#287;&#305;n&#305;zda di&#287;er &uuml;r&uuml;nleri de &ccedil;ok kolay kullan&#305;yorsunuz. Mesela herhangi bir analitik platformunu kullanmak isterseniz hepsinin bu ikisine de deste&#287;i var. Yani ba&#351;ka bir araca ihtiyac&#305;n&#305;z olmaz. </span></p><p class="c3"><span class="c1 c5">K1: More importantly, when you use these two products, you can easily use other tools as well. For example, if you want to use any analytical platform, they all support these two. So, you don&#39;t need another tool.</span></p><p class="c3"><span class="c4 c5">K2: Bir de API&#39;leri var &ccedil;ok g&uuml;zel. Issuelar&#305; indiriyorsunuz excelden d&uuml;zenleyebiliyorsunuz. Bir de CI/CD &ccedil;ok iyi, &ouml;zellikle Gitlab&#39;&#305;n. </span></p><p class="c3"><span class="c1 c5">Participant2: And they have great APIs. You can download issues and organize them in Excel. Also, the CI/CD is very good, especially Gitlab&#39;s.</span></p><p class="c3"><span class="c4 c5">L: Pre-Survey_3. Soru: Tamamd&#305;r, te&#351;ekk&uuml;rler. Daha sonras&#305;nda da asl&#305;nda size herhangi bir projenizle g&ouml;rsel tabanda bir Software analiz arac&#305; kullan&#305;p kullanmad&#305;&#287;&#305;n&#305;z&#305; sormu&#351;tum. Bu oturumda da san&#305;r&#305;m 3 ki&#351;i kulland&#305;klar&#305;n&#305; s&ouml;ylemi&#351;. Onlar hangi ara&ccedil;lar&#305; kulland&#305; ne ama&ccedil;la kulland&#305; a&ccedil;&#305;klamak ister mi? Bu arada ilk &ouml;nce kendimizi tan&#305;t&#305;rsan&#305;z, seviniriz konu&#351;maya ba&#351;larken.</span></p><p class="c3"><span class="c1 c5">&nbsp;L: Pre-Survey_3. Question: Okay, thank you. After that, I actually asked if you have used a visual-based software analysis tool in any of your projects. I believe three people in this session said they have. Would they like to explain which tools they used and for what purposes? By the way, please introduce yourselves before you start speaking.</span></p><p class="c3"><span class="c4 c5">K3: Ben hay&#305;r dedim.</span></p><p class="c3"><span class="c1 c5">Participant3: I said no.</span></p><p class="c3"><span class="c4 c5">K4: Asl&#305;nda &#351;&ouml;yle bilinen bir ara&ccedil; olmad&#305;&#287;&#305; i&ccedil;in ben hay&#305;r dedim fakat. Bu arada ben Havelsan&#39;da &ccedil;al&#305;&#351;&#305;yorum ad&#305;m (Katilimci ad&#305;). Biz Azure DevOps kullan&#305;yorduk o projede. Havelsan&#39;da hem Azure DevOps var hem Jira var. Projelere g&ouml;re de&#287;i&#351;iklik g&ouml;sterebiliyor. Azure DevOps kullan&#305;rken orada Havelsan&#39;da i&ccedil; geli&#351;tirmesiyle yapm&#305;&#351; oldu&#287;u bu bugla relate olabilir mi veya bu test case de&#287;i&#351;tirirsen belki &#351;u requirementlara da bir bakman laz&#305;m gibi analiz bir &#351;&uuml;pheye d&uuml;&#351;m&uuml;&#351; durum var onlar&#305; da bir do&#287;rulaman gerekiyor gibi yaz&#305;lm&#305;&#351;t&#305;. Kendi yazd&#305;&#287;&#305; tool Havelsan&#39;&#305;n b&ouml;yle bilindik veya varsa sekt&ouml;rde ben de bilmiyorum ama hem &ouml;zel bir visual eden bir tool kullanmad&#305;k.</span></p><p class="c3"><span class="c1 c5">Participant4: Actually, I said no because there wasn&#39;t a well-known tool. By the way, I work at Havelsan, my name is (Participant&#39;s name). We were using Azure DevOps in that project. At Havelsan, we have both Azure DevOps and Jira. It can vary by project. When using Azure DevOps, there was a situation where it was written that we had to verify whether the bug was related or if changing the test case would require looking at other requirements as well. Havelsan&#39;s self-developed tool isn&#39;t well-known or at least I&#39;m not aware of any in the industry, so we didn&#39;t use a specialized visual tool.</span></p><p class="c3"><span class="c4 c5">L: Zaten sorumuz genel olarak kullan&#305;p kullanmad&#305;&#287;&#305;n&#305;zd&#305; o y&uuml;zden asl&#305;nda intuitional bir cevap bekliyorduk.</span></p><p class="c3"><span class="c1 c5">&nbsp;L: Our question was general about whether you used it or not, so we were expecting an intuitional answer.</span></p><p class="c3"><span class="c4 c5">K2: Visualization pek de&#287;il de SonarQube kullan&#305;yorduk biz de. Kod analizi i&ccedil;in. Onun d&#305;&#351;&#305;nda bu Jiralarla yap&#305;lan kodda geli&#351;tirmeleri takip etmek &ccedil;ok kolay de&#287;il. &Ccedil;&uuml;nk&uuml; kodun ilerisine ne denk gelecek bilemeyebilirsiniz. Visual bir &#351;eyi yok. Kod analizi i&ccedil;in.</span></p><p class="c3"><span class="c1 c5">Participant2: Not much visualization, but we were using SonarQube for code analysis. Apart from that, tracking code developments with Jira is not very easy because you can&#39;t know what will come up in the code. There&#39;s no visual aspect. Just for code analysis.</span></p><p class="c3"><span class="c4 c5">K5: Ben (Kat&#305;l&#305;mc&#305; ad&#305;). Ben bunu hay&#305;r demi&#351;tim. O y&uuml;zden ekleyece&#287;im bir &#351;ey yok. </span></p><p class="c3"><span class="c1 c5">Participant5: I&#39;m (Participant&#39;s name). I said no to this. So, I have nothing to add.</span></p><p class="c3"><span class="c4 c5">L: Tamam. L: Okay.</span></p><p class="c3"><span class="c4 c5">K1: Ismim (Kat&#305;l&#305;mc&#305; ad&#305;), ben Mobile Action&#39;day&#305;m. Biz asl&#305;nda &#351;&ouml;yle. Farkl&#305; ara&ccedil;lar&#305; farkl&#305; ama&ccedil;lar i&ccedil;in kulland&#305;k. Veya yani SonarQube kulland&#305;k biz de. SonarQube yani statik kod analizi i&ccedil;in kullan&#305;yoruz. Ayn&#305; &#351;ekilde &#351;&ouml;yle biz daha &ccedil;ok engineering productivity &ouml;l&ccedil;mek i&ccedil;in m&uuml;hendislerin &ccedil;al&#305;&#351;ma metriklerini &ouml;l&ccedil;ebilmek amac&#305;yla yakla&#351;&#305;k 7-8 ara&ccedil;tan demo ald&#305;k. Bir tanesi ile &ccedil;al&#305;&#351;maya ba&#351;lad&#305;k, sonra onu b&#305;rakt&#305;k, ikincisine ge&ccedil;tik derken b&ouml;yle bir tecr&uuml;bemiz var. Neyi kullan&#305;yoruz derseniz Swarmy adl&#305; bir tool kullan&#305;yoruz. Swarmy ne yap&#305;yor? Jira ile ilgili data inceleyip bize &ccedil;e&#351;itli dashboardlarda grafikler sunuyor. &#304;&#351;te do&#287;rama metrikleri denen kendi CI/CD toolar&#305;n&#305;n metriklerini de &ccedil;&#305;kart&#305;yor. Genel bir organizasyon sa&#287;l&#305;yor.</span></p><p class="c3"><span class="c1 c5">Participant1: My name is (Participant&#39;s name), I work at Mobile Action. Actually, we used different tools for different purposes. We also used SonarQube, for static code analysis. Similarly, we tried around 7-8 tools for measuring engineering productivity and working metrics of engineers. We started with one, then moved to another. This is our experience. If you ask what we use now, we use a tool called Swarmy. What does Swarmy do? It analyzes data related to Jira and presents various graphics on dashboards. It also generates metrics from its own CI/CD tools, providing a general organization.</span></p><p class="c3"><span class="c4 c5">L: Ne gibi sonu&ccedil;lar i&ccedil;in bak&#305;yorsunuz? </span></p><p class="c3"><span class="c1 c5">L: What kind of results are you looking for?</span></p><p class="c3"><span class="c4 c5">K1: En do&#287;rama metriklerinde en yayg&#305;n olan zaman y&ouml;netimi. Daha &ouml;nce kulland&#305;&#287;&#305;m&#305;z ara&ccedil; biraz daha iyiydi. Orada biraz daha mesela kod review s&uuml;recinin do&#287;ru y&ouml;netip y&ouml;netilmedi&#287;ini de takip edebiliyorduk. O ara&ccedil; daha iyiydi. Ne yaz&#305;k ki biz ald&#305;k sonra 3 ay sonra kapatmaya karar verdiler. O dahil ama i&#351;te. Yani. En az&#305;ndan g&uuml;nl&uuml;k aktivitelerin nereden kald&#305;, nereye gitti&#287;im i&#351;te sizin as&#305;l sorular&#305;n&#305;zda yer alan baz&#305; grafikleri g&ouml;r&uuml;yoruz. Hani gerekirse tool &uuml;zerinde de g&ouml;sterebilirim. Hani &#351;u anda daha iyisini g&ouml;rd&uuml;kten sonra biraz eksik kald&#305;. </span></p><p class="c3"><span class="c1 c5">Participant1: The most common metric isPsrt. The tool we used before was better. We could also track whether the code review process was managed correctly. Unfortunately, we started using it, and three months later, they decided to shut it down. But, we can at least see some graphs related to your main questions, like where daily activities left off and where they went. If needed, I can show it on the tool. After seeing a better one, it feels lacking now.</span></p><p class="c3"><span class="c4 c5">K3: (Kat&#305;l&#305;mc&#305; Ad&#305;), ben. Carbon Health&#39;ten geliyorum. Biz kullanm&#305;yoruz ama SonarQube kullan&#305;yoruz da onu &ccedil;ok visual olarak d&uuml;&#351;&uuml;nmemi&#351;tim. Yani daha b&ouml;yle kod y&ouml;nlendiriyor. Bir de &#351;ey var. Github&#39;da ki b&uuml;t&uuml;n mentionlar&#305; logluyoruz biz. Orda b&ouml;yle &ccedil;e&#351;itli grafiklerle kim ne yapm&#305;&#351; g&ouml;rebiliyoruz. </span></p><p class="c3"><span class="c1 c5">Participant3: (Participant&#39;s name), from Carbon Health. We don&#39;t use it, but we use SonarQube, though I didn&#39;t think of it as very visual. It guides the code more. Also, we log all mentions on Github. We can see who did what through various graphs there.</span></p><p class="c3"><span class="c4 c5">L: Pre-Survey_4. Soru: Daha sonras&#305;nda asl&#305;nda yine benzer bir soru sormu&#351;tuk. G&ouml;rselle&#351;tirmenin proje s&uuml;recindeki insightlar&#305; yani anlamam&#305;za katk&#305;s&#305;n&#305; sormu&#351;tuk. Genel olarak herkes zaten pozitif olarak de&#287;erlendirmi&#351;. Bu soru &uuml;zerinden yorum yapmak isteyen olur mu? Bu da mesela 3 diye cevap veren kat&#305;l&#305;mc&#305;lardan biri cevap vermek ister mi? </span></p><p class="c3"><span class="c1 c5">L: Pre-Survey_4. Question: After that, we asked a similar question about the contribution of visualization to understanding insights in the project process.</span></p><p class="c9"><span class="c4 c5"></span></p><p class="c3"><span class="c4 c5">Katilimci 2: Visualization dedi&#287;iniz zaman o &ccedil;ok geni&#351; bir &#351;ey asl&#305;nda. Neyin g&ouml;r&uuml;nt&uuml;lenmesi yani? &Ccedil;ok geni&#351; bir &#351;ey. Sonu&ccedil;ta Kubernetes kodlar&#305;n&#305;n g&ouml;rsel olarak g&ouml;r&uuml;nt&uuml;lenmesi de bir visualization&#39;d&#305;r. &#304;nsanlar&#305;n Jira&#39;daki hareketlerinin ne kadar &ccedil;&ouml;zd&uuml;klerinin g&ouml;r&uuml;nt&uuml;lenmesi de bir g&ouml;r&uuml;nt&uuml;lemedir. Ne a&ccedil;&#305;dan? </span></p><p class="c3"><span class="c1 c5">Participant 2: When you talk about visualization, it&#39;s actually a very broad thing. What is being visualized? It&#39;s a broad concept. For example, visualizing Kubernetes code is also a form of visualization. Visualizing how people are resolving issues in Jira is another form. From what perspective?</span></p><p class="c3"><span class="c4 c5">L: &#350;imdi mesela hani text-based analiz olabilir veya herhangi bir g&ouml;rsel elementi kullanarak olabilir. L: For instance, it could be text-based analysis or using any visual element.</span></p><p class="c3"><span class="c4 c5">Katilimci 2: Yani g&ouml;rsel daha iyi tabi. </span></p><p class="c3"><span class="c1 c5">Participant 2: So, visual is better, of course.</span></p><p class="c3"><span class="c4 c5">Katilimci 1: Tabi o kesin can&#305;m, hani k&ouml;r y&uuml;r&uuml;mektense g&ouml;rselle desteklenmesi tabii ki daha iyi. Yani metrikler tabii ki her yerde var, lograin i&ccedil;inde de var, orada da var, burada da var ama bir bak&#305;&#351;ta g&ouml;rebilmek en az&#305;ndan bir s&#305;k&#305;nt&#305; oldu&#287;unda, &quot;A burada bir s&#305;k&#305;nt&#305; var&quot; diyebilmek &ccedil;ok &ouml;nemli.</span></p><p class="c3"><span class="c1 c5">&nbsp;Participant 1: Absolutely, it&#39;s better to have visual support than walking blind. Metrics are everywhere, in logs and other places, but being able to see them at a glance, to say &quot;Ah, there&#39;s a problem here,&quot; is very important.</span></p><p class="c3"><span class="c4 c5">Katilimci 3: Ben buna 3 demi&#351; olabilirim. &#350;imdi g&ouml;rselle&#351;tirme &ouml;nemli ama belli bir seviyede olsun. Hep de g&ouml;rsel g&ouml;rsel, text-based bilgi de &ouml;nemli yani. Yani onun ikisinin b&ouml;yle birle&#351;ik versiyonu bence daha makul bir deneyim sa&#287;layabilir.</span></p><p class="c3"><span class="c1 c5">&nbsp;Participant 3: I might have rated this a 3. Visualization is important, but to a certain extent. It&#39;s not all about visuals; text-based information is also important. A combined version of both might provide a more reasonable experience.</span></p><p class="c3"><span class="c4 c5">L: Te&#351;ekk&uuml;rler, ba&#351;ka bir katk&#305;da bulunmak isteyen olur mu acaba?</span></p><p class="c3"><span class="c1 c5">&nbsp;L: Thank you. Would anyone else like to contribute?</span></p><p class="c3"><span class="c4 c5">Katilimci 4: G&ouml;rsellikte sanki paterni bir bak&#305;&#351;ta yakalayabilmek ad&#305;na fayda sa&#287;layabilir diye d&uuml;&#351;&uuml;nm&uuml;&#351;t&uuml;m ben burada. &#304;&#351;te &ouml;rnek veriyorum. Hani hep ayn&#305; ki&#351;iye a&ccedil;&#305;lan buglar, arac&#305;m&#305;zdan hareketle s&ouml;yl&uuml;yorum ya da i&#351;te ayn&#305; source kodlar&#305; s&uuml;rekli i&#351;aret eden bir bug durumunu texte g&ouml;rmekten ziyade g&ouml;rselli&#287;i &ccedil;ok h&#305;zl&#305; bir &#351;ekilde. Ha demek ki bu source code, bu dosyada bir s&#305;k&#305;nt&#305; var ya da bu &#351;eyde bir problem var. Daha b&ouml;yle bir bak&#305;&#351;ta o paterni yakalamak i&ccedil;in daha faydal&#305;. Ama tabii ki detaylara girmesi laz&#305;m. Yani detay i&ccedil;in belki bir &#351;ey s&ouml;yleyemedim ama bir ilk bak&#305;&#351;ta do&#287;ru patern yakalatma konusunda fayda olaca&#287;&#305;n&#305; d&uuml;&#351;&uuml;n&uuml;yorum. </span></p><p class="c3"><span class="c1 c5">Participant 4: I thought visualizing could be useful to quickly catch patterns at a glance. For example, bugs always assigned to the same person or a bug constantly pointing to the same source code. It&#39;s much faster to see this visually rather than in text. So, it indicates there might be an issue with this source code or this file. It helps to catch the pattern at a glance. But of course, it needs to go into details. I might not be able to comment on the details, but I think it helps to catch the correct pattern at first glance.</span></p><p class="c3"><span class="c4 c5">Katilimci 1: Hani bizim denemesini yapt&#305;&#287;&#305;m&#305;z toollardan biri Linear&#39;di zannedersem. Rework metric diye bir &#351;ey &ccedil;&#305;kartm&#305;&#351;lar. Yani toplam kod base at&#305;yorum. 1.000.000 sat&#305;rda i&#351;te 10.000 sat&#305;rl&#305;k kod k&#305;sm&#305; s&uuml;rekli olarak yeniden PR a&ccedil;&#305;l&#305;yor, yeniden yap&#305;l&#305;yor. Bu rework metric olarak ge&ccedil;iyor. Yani burada bir problem var ki sen buraya s&uuml;rekli d&ouml;n&uuml;yorsun diye &ouml;l&ccedil;&uuml;yor. Yani yeni build etmek mesela koda sat&#305;r eklemek &#351;eklinde olur ama ayn&#305; koda s&uuml;rekli editlemek, orada bir problem var ki sen buraya d&ouml;n&uuml;yorsun &#351;eklinde &ouml;l&ccedil;&uuml;yor. O da y&uuml;zde olarak da veriyordu, &ccedil;ok g&uuml;zeldi. </span></p><p class="c3"><span class="c1 c5">Participant 1: One of the tools we tried, I think it was Linear. They came up with a rework metric. Out of a total code base of 1,000,000 lines, if 10,000 lines of code are constantly being re-opened for PR and reworked, it&#39;s measured as a rework metric. It indicates there&#39;s a problem in that area. Instead of adding new lines to the code, constantly editing the same code suggests there&#39;s an issue. It also provided percentages, which was very nice.</span></p><p class="c3"><span class="c4 c5">L: Pre-Survey_5. Soru: Di&#287;er sorumuzda da asl&#305;nda proje s&uuml;resince en fazla etkile&#351;ime ge&ccedil;ti&#287;iniz software artifact&#39;lar&#305; sormu&#351;tuk. Burada da g&ouml;rd&uuml;&#287;&uuml;m kadar&#305;yla en fazla kod dosyalar&#305;, issue&#39;lar, commit&#39;ler ve onu takip eden de pull request&#39;ler se&ccedil;ilmi&#351;. Bu sonu&ccedil;lar &uuml;zerine konu&#351;mak isteyen olur mu, sizce neden bu artifact&#39;lar daha &ouml;nde &ccedil;&#305;km&#305;&#351;? </span></p><p class="c3"><span class="c1 c5">L: Pre-Survey_5. Question: In our other question, we asked which software artifacts you interacted with the most during the project. From what I see, code files, issues, commits, and followed by pull requests were chosen the most. Would anyone like to discuss these results? Why do you think these artifacts stand out more?</span></p><p class="c3"><span class="c4 c5">Katilimci 2: Yani sonu&ccedil; olarak source code her zaman de&#287;i&#351;en bir &#351;ey. Yani onun i&ccedil;in &ouml;rne&#287;in diyagram&#305; ilk ba&#351;ta &ccedil;iziyorsunuz, o orada kal&#305;yor. Y&uuml;zde doksanda o ilk haliyle kal&#305;yor, sonra gidip g&uuml;ncelleyen yoktur. </span></p><p class="c3"><span class="c1 c5">Participant 2: In the end, source code is always changing. For example, you draw the diagram initially, and it stays there. 90% of the time, it remains in its initial state, and no one updates it later.</span></p><p class="c3"><span class="c4 c5">Katilimci 3: Ben az &ccedil;&#305;kan hakk&#305;nda konu&#351;abilirim, &#351;u mode UML. Bunlar genelde b&ouml;yle daha oturmu&#351; kurumsal m&#305; denir? Belki &ouml;yle firmalarda oluyorlar. Ama start-up gibi ortamlarda &ccedil;&uuml;nk&uuml; firmalarda daha b&ouml;yle k&acirc;r etmek gerekiyor. Mesela ben hi&ccedil; kullanmad&#305;m yani database&#39;e g&ouml;re saym&#305;yorsak son 3-4 y&#305;lda bir defa bile kullanmad&#305;m. </span></p><p class="c3"><span class="c1 c5">Participant 3: I can talk about the less common ones, like UML. These are generally found in more established, corporate settings, I guess? They might exist in such companies. But in start-up environments, because companies need to be more profitable. For example, I haven&#39;t used it at all, unless we&#39;re counting databases, in the last 3-4 years, not even once.</span></p><p class="c3"><span class="c4 c5">Katilimci 1: &#350;&ouml;yle olan de&#287;il olmaya bakmak laz&#305;m.</span></p><p class="c3"><span class="c1 c5">&nbsp;Participant 1: It&#39;s about looking at what should be rather than what is.</span></p><p class="c3"><span class="c4 c5">Katilimci 2: Ama &#351;&ouml;yle, o UML &#351;eyde gerekiyor. Hani b&uuml;y&uuml;k projelerde UML &ccedil;izmeniz laz&#305;m ki mikro servisleri, onlar&#305;, buralar&#305; &ccedil;&#305;karabilirsiniz, o yoksa &ccedil;ok sorunsuz &ccedil;&#305;km&#305;yor. </span></p><p class="c3"><span class="c1 c5">Participant 2: But, UML is needed in big projects. You need to draw UML diagrams to define microservices and other parts. Without it, it doesn&#39;t come out very smoothly.</span></p><p class="c3"><span class="c4 c5">Katilimci 1: Yani bizde yirmiden fazla mikro servis var. Hi&ccedil; UML &ccedil;izmedik. </span></p><p class="c3"><span class="c1 c5">Participant 1: We have more than twenty microservices. We&#39;ve never drawn UML diagrams.</span></p><p class="c3"><span class="c4 c5">Katilimci 1: Ama &#351;ey, hi&ccedil; bilmedi&#287;iniz bir domaini analiz ederken kimin ne yapt&#305;&#287;&#305;n&#305; g&ouml;rmek a&ccedil;&#305;s&#305;ndan gerekiyor. </span></p><p class="c3"><span class="c1 c5">Participant 1: But, when analyzing a domain you know nothing about, it&#39;s necessary to see what everyone is doing.</span></p><p class="c3"><span class="c4 c5">Katilimci 3: &#350;&ouml;yle, illa bir kural setine ihtiya&ccedil; olmuyor. Kendin bir flow diagram kendin &ccedil;izebiliyorsun. </span></p><p class="c3"><span class="c1 c5">Participant 3: You don&#39;t necessarily need a set of rules. You can draw a flow diagram yourself.</span></p><p class="c3"><span class="c4 c5">Katilimci 1: &Ccedil;izilse ve yaz&#305;lm&#305;yor.</span></p><p class="c3"><span class="c1 c5">&nbsp;Participant 1: It might be drawn but not written.</span></p><p class="c3"><span class="c4 c5">Katilimci 3: Yani UML uyumak gibi bir derdimiz yok. Participant 3: We don&#39;t have the issue of adhering to UML.</span></p><p class="c3"><span class="c4 c5">Katilimci 1: Bir toplant&#305;da karar al&#305;n&#305;yor ve ge&ccedil;iyor. Yani o d&ouml;k&uuml;man bir daha da kaybediliyor gidiyor yani. </span></p><p class="c3"><span class="c5 c8">Participant 1: A decision is made in a meeting and that&#39;s it. That document is lost and gone forever.</span></p><p class="c3"><span class="c4 c5">Katilimci 2: Haz&#305;r diyorsun, onay&#305;n&#305; al&#305;yorsun, kurdu&#287;undan sonra gideriz. Daha bakt&#305;&#287;&#305;m&#305;zda zaten yani 10 kat&#305;l&#305;mc&#305;n&#305;n. Bizim mesela 100 kere s&#305;k&#305;n Instagram &ccedil;izdim dedi&#287;iniz gibi bir incelendikten sonra bir daha atlattanm&#305;yor, yani &#351;ey de &ouml;yle oldu zaten. Bir s&uuml;re sonra hele projede son teslim zaman&#305;nda d&ouml;n&uuml;p onu kim g&uuml;ncelleyecek? Zaten m&uuml;&#351;teri de d&ouml;n&uuml;p d&ouml;n&uuml;p acayip &#351;eyler s&ouml;ylemeye ba&#351;lay&#305;p ba&#351;ta dedi&#287;iniz tam tersi demeye ba&#351;l&#305;yor. </span></p><p class="c3"><span class="c1 c5">Katilimci 2: You say it&#39;s ready, get approval, and move on. Looking back, we have 10 participants. For example, I&#39;ve drawn Instagram 100 times, and after a review, it&#39;s never touched again. The same happened in the project. Near the deadline, who will update it? The customer starts saying strange things, contradicting what was said initially.</span></p><p class="c3"><span class="c4 c5">Katilimci 5: Bir kez &ccedil;iziliyor, sonra da ellenmiyor yani. </span></p><p class="c3"><span class="c1 c5">Participant 5: It&#39;s drawn once and never touched again.</span></p><p class="c3"><span class="c4 c5">L: Pre-Survey_6. Soru: Daha sonra, hi&ccedil; projelerinizde expert developer bulunmas&#305; i&ccedil;in harici bir ara&ccedil; kullan&#305;p kullanmad&#305;&#287;&#305;n&#305;z&#305; sormu&#351;tuk. 2 kat&#305;l&#305;mc&#305; kulland&#305;klar&#305;n&#305; s&ouml;ylemi&#351;. Nas&#305;l bir ara&ccedil; kullan&#305;yorlar? Ondan bahsedebilir mi? </span></p><p class="c3"><span class="c1 c5">L: Pre-Survey_6. Question: We then asked if you have ever used an external tool to find expert developers in your projects. Two participants said they have. Can they talk about what kind of tool they use?</span></p><p class="c3"><span class="c4 c5">Katilimci 2: Yani genelde bunlar b&ouml;yle &ccedil;&#305;km&#305;yor art&#305;k. Yani bizden expert olan&#305; yazd&#305;&#287;&#305; koddan g&ouml;r&uuml;yorsunuz. Evet &ccedil;&ouml;zd&uuml;&#287;&uuml; hatta bir de d&ouml;n&uuml;l&uuml;yorsun, i&#351; veriyorsun, &ccedil;&ouml;z&uuml;yorsun bu evet bu iyi ve b&ouml;yle biraz daha i&#351; veririm diyorsun &ouml;yle gidiyor.</span></p><p class="c3"><span class="c1 c5">&nbsp;Participant 2: These things usually don&#39;t come up. You see who is an expert from the code they write. You give them a task, they solve it, and you think, &quot;Yes, this is good,&quot; and you give them more tasks.</span></p><p class="c3"><span class="c4 c5">Katilimci 3: Bir tak&#305;m oturmu&#351;sa, bir yerden sonra herkes birbirini tan&#305;yor ya. Oradan biraz &ouml;yle. Yani ara&ccedil; yok ama herkesin kafas&#305;nda, bizde de ayn&#305; &#351;ekilde. </span></p><p class="c3"><span class="c1 c5">Participant 3: If a team is established, everyone knows each other after a while. It&#39;s like that. We don&#39;t have a tool, but everyone has an idea in their heads, and it&#39;s the same with us.</span></p><p class="c3"><span class="c4 c5">Katilimci 4: Bizde de ayn&#305; &#351;ekilde. Yani i&#351;te &#351;u servisle ilgili hata varsa onu &#351;u ki&#351;i bilir daha iyi bilir aynen aynen ben &ouml;yle bir &#351;ey var. Kafada bir mapping ama bir ara&ccedil;la ortaya &ccedil;&#305;kartm&#305;yoruz. </span></p><p class="c3"><span class="c1 c5">Participant 4: It&#39;s the same with us. If there&#39;s an issue with a service, everyone knows who understands it better. There&#39;s a mental mapping, but we don&#39;t use a tool to identify it.</span></p><p class="c3"><span class="c4 c5">Katilimci 1: Git blame de sonu&ccedil; veriyor. Tool olarak en fazla onu s&ouml;yleyebilirim. </span></p><p class="c3"><span class="c1 c5">Participant 1: Git blame works for that. It&#39;s the most I can say as a tool.</span></p><p class="c3"><span class="c4 c5">Katilimci 5: Fakat Git blame bazen yan&#305;lt&#305;c&#305; sonu&ccedil; da verebiliyor. Bir issue yanl&#305;&#351; ki&#351;iye assign oluyor. </span></p><p class="c3"><span class="c1 c5">Participant 5: But Git blame can sometimes give misleading results. An issue can be assigned to the wrong person.</span></p><p class="c3"><span class="c4 c5">L: Pre-Survey_7. Soru: Son sorumuzda da asl&#305;nda process smelleri ile ne kadar tan&#305;d&#305;k oldu&#287;unuzu, ne kadar bildi&#287;inizi sormu&#351;tuk. Kat&#305;l&#305;mc&#305;lar&#305;n &ccedil;o&#287;u zaten bu konu hakk&#305;nda bilgisi varm&#305;&#351; ayn&#305; zamanda. &Ccedil;al&#305;&#351;ma ortam&#305;n&#305;zda daha &ouml;nce hi&ccedil; process anomalilerini tespit eden bir uygulama kullanm&#305;&#351; m&#305;yd&#305;n&#305;z diye sormu&#351;tuk. Fakat san&#305;r&#305;m kullanan olmam&#305;&#351;. B&ouml;yle bir ara&ccedil; kullanan var m&#305; yani? </span></p><p class="c3"><span class="c1 c5">L: Pre-Survey_7. Question: In our last question, we asked how familiar you are with process smells and how much you know about them. Most participants were already knowledgeable about this topic. We also asked if you have ever used an application to detect process anomalies in your work environment. I guess no one has used it. Is there anyone who has used such a tool?</span></p><p class="c3"><span class="c4 c5">Katilimci 2: Yani sonras&#305;nda bizde yok ama &#351;&ouml;yle bir &#351;ey var, genelde bir olay falan oldu&#287;u zaman sonras&#305;nda toplant&#305; yap&#305;yoruz. Orada konu&#351;arak process smelleri ortaya &ccedil;&#305;kar&#305;yoruz. </span></p><p class="c3"><span class="c1 c5">Participant 2: We don&#39;t have such a tool, but after an incident, we usually hold a meeting. We discuss and identify process smells there.</span></p><p class="c3"><span class="c4 c5">Katilimci 3: D&uuml;zeltmek ad&#305;na bazen &#351;ey oluyor, code review yaparken de bazen ortaya &ccedil;&#305;k&#305;yor. SonarQube de &ccedil;&#305;karm&#305;yor bazen ama d&#305;&#351;ar&#305;dan bakt&#305;&#287;&#305;n&#305;zda zaman patlayacak k&#305;sm&#305; kendin ortaya &ccedil;&#305;kar&#305;yorsun.</span></p><p class="c3"><span class="c1 c5">&nbsp;Participant 3: Sometimes it comes up during code reviews for correction. SonarQube doesn&#39;t always detect it, but you can see the part that&#39;s going to fail when you look from the outside.</span></p><p class="c3"><span class="c4 c5">Katilimci 4: Bir de process smell ve code smell farkl&#305; &#351;eyler sonu&ccedil;ta. SonarQube code smell&#39;leri ortaya &ccedil;&#305;karmak &uuml;zerine. Genelde &#351;irketin ya da tak&#305;mlar&#305;n i&#351;leyi&#351;i ile ilgili sorunlar olabiliyor.</span></p><p class="c3"><span class="c1 c5">&nbsp;Participant 4: Also, process smells and code smells are different things. SonarQube is for identifying code smells. Usually, issues are related to the company&#39;s or team&#39;s workflows.</span></p><p class="c3"><span class="c4 c5">L: Aynen. Bad practices diyebiliriz. </span></p><p class="c3"><span class="c1 c5">L: Exactly. We can call them bad practices.</span></p><p class="c3"><span class="c4 c5">Katilimci 2: Ya genelde &#351;ey olmu&#351; oluyor, exceptionlar handle edilmemi&#351; oluyor. %90&#39;&#305;nda geliyor, patl&#305;yor. </span></p><p class="c3"><span class="c1 c5">Participant 2: Usually, exceptions are not handled. In 90% of cases, they come up and cause problems.</span></p><p class="c3"><span class="c4 c5">L: Onlar biraz daha code smell&#39;e giriyor. Process smell biraz daha s&uuml;re&ccedil; i&ccedil;inde yap&#305;lan uyumsuzluklar. Yani s&uuml;re&ccedil; i&ccedil;erisinde, diyelim ki yanl&#305;&#351; hareket mesela at&#305;yorum i&#351;te kendi kendine bir pull requesti review etmi&#351; kendi kodunu gibi. </span></p><p class="c3"><span class="c1 c5">L: Those fall more under code smells. Process smells are more about inconsistencies within the process. For example, someone reviewing their own pull request is a process smell.</span></p><p class="c3"><span class="c4 c5">Katilimci 1: O tarz &#351;eyleri genelde blokluyoruz zaten. </span></p><p class="c3"><span class="c1 c5">Participant 1: We usually block things like that.</span></p><p class="c3"><span class="c4 c5">Katilimci 4: Baz&#305; metriklerimiz var. 1.000 sat&#305;rl&#305;k kodun ortalama review s&uuml;resinin dok&uuml;manlar&#305; varsa, mesela o da 1.000 sat&#305;r ama 2 bu&ccedil;uk saatte onaylanm&#305;&#351;. Neden? Ya da mesela 1.000 sat&#305;r 2 dakikada onay vermi&#351;. Bunlar&#305;n neresine bakt&#305;&#287;&#305;n&#305;zda 1.000 sat&#305;r&#305; 2 dakikada okumaya yetmez. Ama bunu &ouml;rnekleme yoluyla yap&#305;yoruz. Bize dok&uuml;manlar &ccedil;&#305;k&#305;yor. Gidip o PR&#39;&#305; g&ouml;zden ge&ccedil;irmi&#351; ki&#351;ilere bak bu PR &ccedil;ok &ccedil;abuk kapat&#305;lmam&#305;&#351; m&#305; diye soruyoruz. O da diyor ki o konfig&uuml;rasyon de&#287;i&#351;ikli&#287;iydi zaten biliyorduk i&#351;te vesaire gibi bir yorumda bulunuyor. O &#351;ekilde ama bu bir s&uuml;re&ccedil; asl&#305;nda. Bir ara&ccedil; baz&#305;nda yapm&#305;yoruz, bir s&uuml;re&ccedil; olarak yakalan&#305;yorlar. O metrikler sprint boyunca toplan&#305;yor ve ayk&#305;r&#305; olanlar inceleniyor. </span></p><p class="c3"><span class="c1 c5">Participant 4: We have some metrics. If a 1,000-line code review document is approved in 2.5 hours, why? Or if a 1,000-line code is approved in 2 minutes, you can&#39;t read 1,000 lines in 2 minutes. We do this by sampling. We get documents and ask the reviewers if the PR was closed too quickly. They might say it was a configuration change, so they knew about it. It&#39;s a process we follow, not tool-based. These metrics are collected during the sprint, and anomalies are investigated.</span></p><p class="c9"><span class="c4 c5"></span></p><p class="c3"><span class="c4">U: Siz s&uuml;reyi &ouml;nemsiyorsunuz orada. </span></p><p class="c3"><span class="c1">U: You are emphasizing the time there.</span></p><p class="c3"><span class="c4">Katilimci 4: S&uuml;re var, kod say&#305;s&#305; var. Repo&#39;ya g&ouml;re &#351;u ki&#351;ilerin bakmas&#305; gerekiyor dedi&#287;imiz metrikler var. Bunlar code review s&uuml;reci ile ilgili olanlar. Bug tracking s&uuml;reci ile ilgili kurumsal s&uuml;re&ccedil;lerimiz var. Belki o da buraya gidiyor mudur? &Ccedil;ok emin de&#287;ilim. &#304;&#351;te bug a&ccedil;&#305;l&#305;r a&ccedil;&#305;lmaz birine assign olmuyor. O zaten &ouml;nce ilgili mod&uuml;l&uuml;n teknik y&ouml;neticisine gidiyor, o bir analiz ettikten sonra baz&#305;lar&#305;n&#305; y&ouml;nlendiriyor, baz&#305;lar&#305;n&#305; boarda yolluyor, vesaire vesaire gibi. O zaten kurumsal bir s&uuml;re&ccedil;. </span></p><p class="c3"><span class="c1">Participant 4: There are metrics like time, code lines, and certain people who need to review according to the repo. These are related to the code review process. We also have corporate processes related to the bug tracking process. Maybe that applies here too? I&#39;m not sure. A bug is not assigned immediately to someone. It first goes to the technical manager of the relevant module, who analyzes it and then directs some to others, sends some to the board, etc. It&#39;s already a corporate process.</span></p><p class="c3"><span class="c4">Katilimci 2: Bu bizde demek ki herkes istedi&#287;ini yapm&#305;yor.</span></p><p class="c3"><span class="c1">&nbsp;Participant 2: This means not everyone does whatever they want with us.</span></p><p class="c3"><span class="c4">L: Tamamd&#305;r, son sorumuzdu. O zaman sunum ile devam edelim.</span></p><p class="c3"><span class="c1">&nbsp;L: Alright, that was our last question. Let&#39;s continue with the presentation then.</span></p><p class="c3"><span class="c4">19:20 - 30:06 (Presentation Session About the Concepts) </span></p><p class="c3"><span class="c4">30:06 - 52:56 (SAA DEMO) 30:06 - 52:56 (SAA DEMO)</span></p><p class="c3"><span class="c4">Katilimci 1: Bana biraz &#351;ey gibi geldi, bu process anomalileri daha &ccedil;ok open source bir data &uuml;zerine geli&#351;tirildi&#287;i i&ccedil;in bize &ccedil;ok map etmiyor. Bizde mesela bug&#39;&#305;n unutulmas&#305; gibi bir case yok yani. Ya yapm&#305;yoruzdur, ya da yapar&#305;z. Bu daha &ccedil;ok community i&ccedil;inde olu&#351;abilecek bir durum gibi. </span></p><p class="c3"><span class="c1">Participant 1: It seems to me that these process anomalies are developed more on open-source data, so they don&#39;t map well to us. For example, we don&#39;t have a case where a bug is forgotten. Either we don&#39;t do it or we do it. This seems like a situation that could occur more within a community.</span></p><p class="c3"><span class="c4">Katilimci 2: Bir de normal bir projede bu kadar fazla artifact olmayabilir. Core artifact&#39;larda &ccedil;ok fazla de&#287;i&#351;iklik olur, herkes oraya de&#287;i&#351;tirilir. O orada patlayabilir.</span></p><p class="c3"><span class="c1">&nbsp;Participant 2: Also, in a normal project, there might not be so many artifacts. There are a lot of changes in the core artifacts, and everyone changes them there. That can explode there.</span></p><p class="c3"><span class="c4">U: Yani artifact say&#305;s&#305;, PR say&#305;s&#305; &ccedil;ok mu azd&#305;r diyorsunuz? </span></p><p class="c3"><span class="c1">U: So you are saying the number of artifacts, PRs, is very low?</span></p><p class="c3"><span class="c4">Katilimci 2: Jar say&#305;s&#305;. Benim artifact olarak d&uuml;&#351;&uuml;nd&uuml;&#287;&uuml;m jar.</span></p><p class="c3"><span class="c1">&nbsp;Participant 2: The number of jars. What I consider an artifact is a jar.</span></p><p class="c3"><span class="c4">U: Biz burada ama genel olarak kod dosyalar&#305;n&#305;, PR hepsini artifact olarak kabul ediyoruz. </span></p><p class="c3"><span class="c1">U: But here, we generally consider code files and PRs as artifacts.</span></p><p class="c3"><span class="c4">Katilimci 2: Biz jar&#39;lar&#305; push ediyoruz. Normal d&ouml;nemde file baz&#305;nda gitmiyorsunuz. Mesela &ccedil;ok fazla file olur. Paketliyorsunuz ve onlar&#305; g&ouml;nderiyorsunuz. </span></p><p class="c3"><span class="c1">Participant 2: We push jars. Normally, you don&#39;t go file by file. For example, there are many files. You package them and send them.</span></p><p class="c3"><span class="c4">U: Burada biz baz&#305; assumpsiyonlar yap&#305;yoruz. Development team&#39;in, size&#39;&#305;n&#305;n d&uuml;zineler mertebesinde oldu&#287;unu farz ediyoruz. Open bir space &ccedil;al&#305;&#351;&#305;yorsunuz, sesini y&uuml;kseltsen bile duyarlar. </span></p><p class="c3"><span class="c1">U: Here, we make some assumptions. We assume that the size of the development team is in the dozens. You work in an open space, and even if you raise your voice, they will hear you.</span></p><p class="c3"><span class="c4">Katilimci 1: Mesela open community daha &ouml;nemli. Turnover&#39;lar da oluyor. </span></p><p class="c3"><span class="c8">Participant 1: For example, the open community is more important. There are turnovers as well.</span></p><p class="c3"><span class="c4 c5">Katilimci 4: G&ouml;t&uuml;rsem yar&#305;n bizim &#351;irkette birinci g&uuml;n aktif kullan&#305;ma ba&#351;lan&#305;r. Yani bizim &uuml;r&uuml;n i&ccedil;in s&ouml;yl&uuml;yorum. Biz bir &uuml;r&uuml;n yazd&#305;&#287;&#305;m&#305;z i&ccedil;in bir de 70 ki&#351;ilik bir ekip oldu&#287;umuz i&ccedil;in &#351;eyde g&uuml;zel oluyor. &Ccedil;&uuml;nk&uuml; domain&#39;i ayr&#305;lm&#305;&#351; tak&#305;mlar var. Bir domain di&#287;er domain&#39;e bir entegrasyon yazaca&#287;&#305; zaman ger&ccedil;ekten kendi tak&#305;m&#305;n&#305; iyi biliyor ama di&#287;er tak&#305;mda o entegrasyonun ucuna kime sormas&#305; gerekti&#287;iyle ilgili eksik bilgisi olabiliyor. Tabi ki hepsi bunun ileti&#351;ime &ccedil;&ouml;z&uuml;lebilecek &#351;eyler ama biraz b&ouml;yle bir remote &ccedil;al&#305;&#351;ma falan da &ccedil;ok g&uuml;n. Oldu&#287;u i&ccedil;in evinde otururken &#351;imdi yandakine kalk&#305;p sormak var. Oradan metrim mosta yazacak herkese de sen de bak&#305;yorsun sen de bak&#305;yorsun. Ben g&ouml;t&uuml;rsem bunu &#351;ey yapar&#305;m. Parali sat&#305;n aldirirm. </span></p><p class="c3"><span class="c1 c5">Participant 4: If I take this to our company, it would be actively used from the first day. For our product, I&#39;m saying. We are writing a product, and since we have a team of 70 people, it works well. Because there are teams separated by domain. When one domain writes an integration for another, they know their own team well but may lack information on who to ask in the other team. Of course, all of this can be solved through communication, but with so much remote work nowadays, you have to get up and ask the person next to you. Instead, you write it in the metrics and everyone sees it. I would make them buy this tool.</span></p><p class="c3"><span class="c4 c5">U: Bir de zaten &#351;eyde ge&ccedil;ecek ama sunum geri kalan&#305;nda b&uuml;y&uuml;k resim &#351;u. Yani bu bir platform asl&#305;nda bir framework. Bu framework&#39;&uuml; herkesin ihtiya&ccedil;lar&#305; do&#287;rultusunda biz geli&#351;tirebiliriz yani. K&uuml;&ccedil;&uuml;k &#351;irketlerin i&#351;ine yarayacak &#351;eyler ya da i&#351;te farkl&#305; ihtiya&ccedil;lar&#305; olan ki mesela siz s&uuml;re dediniz ya yani s&uuml;re ve kod say&#305;s&#305; &#351;ey b&uuml;y&uuml;k de&#287;il dediniz ya mesela o bizim hi&ccedil; d&uuml;&#351;&uuml;nmedi&#287;imiz bir &#351;eydi, o da entegre edilebilir.</span></p><p class="c3"><span class="c1 c5">&nbsp;U: And it will pass, but the big picture for the rest of the presentation is this. This is a platform, actually a framework. We can develop this framework according to everyone&#39;s needs. Things that small companies will benefit from or different needs, like you said about time and code lines, which we hadn&#39;t thought about, can be integrated.</span></p><p class="c3"><span class="c4 c5">Katilimci 4: Kurumsallarda belki kat&#305;l&#305;r arkada&#351;lar. Kurumsallarda &#351;&ouml;yle bir durum oluyor, ger&ccedil;ekten birinin performans&#305;n&#305; &ouml;l&ccedil;mek &ccedil;ok zor bir kurumsal &#351;irketteyseniz startuplarda vesaire ya da giri&#351;imcinin sermayesini kendi verdi&#287;i yerlerde o ki&#351;iyi zaten &ccedil;ok yak&#305;n takip ediyor. Ya da zaten ki&#351;i say&#305;s&#305; az oluyor, h&#305;zl&#305;ca da g&ouml;r&uuml;n&uuml;yor. B&ouml;yle bir sosyal ahlakl&#305;k m&#305; deniyordu? bir yasa vard&#305;. Hani 50 ki&#351;ilik ekipte yatan 5 tane adam var, onu bulman&#305;z&#305; ve ispatlaman&#305;z &ccedil;ok zor ve i&#351; kanunu gere&#287;ince de fiyatlar&#305;m&#305;zda bir yapt&#305;r&#305;m&#305;n&#305;z yok. B&ouml;yle bir tool mu olsa sen yazd&#305;&#287;&#305;n kaynak koda s&uuml;rekli bug geliyor. Analiz arac&#305; da b&ouml;yle b&ouml;yle s&ouml;yl&uuml;yor. Bununla ilgili seninle bir one to one g&ouml;r&uuml;&#351;me yapal&#305;m deyip 3-5 one to one sonra da art&#305;k seninle yolumuzu ay&#305;rmak zorunday&#305;z. &Ccedil;&uuml;nk&uuml; bu araca g&ouml;re de &ccedil;ok da iyi bir performans yok diyebiliyor oluyoruz. Biz o metriklere de o y&uuml;zden asl&#305;nda &ccedil;ok &ouml;nemsiyoruz. Hani 1000 sat&#305;rl&#305;k oda 2 dakikada bakm&#305;&#351; olamazs&#305;n bakt&#305;ysanda bir a&ccedil;&#305;klamas&#305; olmal&#305; ya da bakm&#305;&#351; olmak i&ccedil;in bakt&#305;&#287;&#305;n anlam&#305;na gelir gibi bir &#351;eyler &ccedil;&#305;karmaya &ccedil;al&#305;&#351;&#305;yoruz. O y&uuml;zden kurum yani bizim gibi kurumsallar belki ki daha iyi olabilir. </span></p><p class="c3"><span class="c1 c5">Participant 4: Maybe others will agree about corporates. In corporates, it&#39;s really hard to measure someone&#39;s performance. In startups or places where the entrepreneur provides the capital, they already closely monitor the person. Or there are fewer people, so it&#39;s quickly visible. There was a law called social accountability or something like that. In a team of 50, there are 5 people who don&#39;t work, and it&#39;s very hard to find and prove that, and there&#39;s no penalty according to labor laws. If we had a tool that says, &quot;You keep getting bugs in your code, the analysis tool says so,&quot; we could have a one-to-one meeting and after 3-5 meetings, say, &quot;We have to part ways because this tool shows your performance isn&#39;t good.&quot; We actually care a lot about these metrics for that reason. If you look at 1000 lines of code in 2 minutes, there must be an explanation, or it means you just looked at it superficially. So, for companies like ours, corporates might benefit more.</span></p><p class="c3"><span class="c4 c5">Katilimci 5: Ben &#351;u kullan&#305;mda kat&#305;l&#305;yorum yani. Tak&#305;mlar yani developer a&ccedil;&#305;s&#305;ndan i&#351;te 6 ki&#351;i, 7 ki&#351;i, 8 ki&#351;i var. Tak&#305;m i&ccedil;i ben bilirim, kim ne yazm&#305;&#351;. Bazen di&#287;er tak&#305;m&#305;n elledi&#287;i noktaya gitmemiz gerekiyor. Ben bilmiyorum di&#287;er tak&#305;mda kim ne yazm&#305;&#351; falan bu toola bak&#305;p kim neyi biliyormu&#351; anlayabilirim. O a&ccedil;&#305;dan baya&#287;&#305; avantajl&#305; geldi bana. </span></p><p class="c3"><span class="c1 c5">Participant 5: I agree with this usage. In teams, from a developer&#39;s perspective, there are 6, 7, 8 people. Within the team, I know who wrote what. Sometimes we need to go to a point touched by another team. I don&#39;t know who wrote what in the other team, but by looking at this tool, I can understand who knows what. That seems quite advantageous to me.</span></p><p class="c3"><span class="c4 c5">U: Bir de biraz vurgulamaya &ccedil;al&#305;&#351;t&#305;k. Tabi b&ouml;yle paperlar&#305;n &#351;eylerini falan koyarak ama &#351;imdi. Tipik olarak i&#351;te git blame bakt&#305;&#287;&#305;n&#305;z zaman sadece i&#351;te number of line oluyor vesaire ama burada biraz daha &#351;eyli computational bir &#351;eyle i&#351;te graf algoritmalar&#305;yla onu &ccedil;&#305;kar. B&ouml;yle bir de recency de &#351;eye kat&#305;yor. Yani 3 sene &ouml;nce bir s&uuml;r&uuml; commit yapan bir adam standart zaten i&#351;te bir s&uuml;r&uuml; sat&#305;r getirmetot yazm&#305;&#351;t&#305;r orada duruyordur ama as&#305;l &ouml;nemli metotlar&#305; de&#287;i&#351;tiren daha resim &#351;eyleri ekleyen ki&#351;i farkl&#305; olabilir. ve yeni y&ouml;ntemler ortaya &ccedil;&#305;kt&#305;k&ccedil;a bu.</span></p><p class="c3"><span class="c1 c5">&nbsp;U: We tried to emphasize a bit. Of course, by including things from papers and such. Typically, when you look at git blame, it&#39;s just the number of lines, etc., but here, it&#39;s a bit more computational, using graph algorithms. It also includes recency. Someone who made a lot of commits three years ago might have written many methods that are still there, but the person who added the important methods recently might be different. And as new methods emerge, this</span></p><p class="c3"><span class="c4 c5">Katilimci 2: Mesela &#351;ey zaman, hani &#351;unu zorluyor, bir issue vard&#305;r, &ccedil;ok kolay &ccedil;izersin. Bir issue vard&#305;r, bir ay boyunca b&uuml;t&uuml;n mod&uuml;llere bir &#351;ey eklemeniz gerekiyor. K&uuml;&ccedil;&uuml;k k&uuml;&ccedil;&uuml;k bir s&uuml;r&uuml; bir &#351;ey eklersiniz. 1 ayda da hi&ccedil;bir &#351;ey yapm&#305;yor g&ouml;z&uuml;k&uuml;rs&uuml;n&uuml;z, bir i&#351;i yap&#305;yor g&ouml;z&uuml;k&uuml;rs&uuml;n&uuml;z ama zor bir &#351;eydir asl&#305;nda. </span></p><p class="c3"><span class="c1 c5">Participant 2: For example, time pressures, like having an issue that&#39;s easy to fix. Another issue might require adding something to all modules over a month. You add many small things, and it looks like you haven&#39;t done anything in a month, but it&#39;s actually a difficult task.</span></p><p class="c9"><span class="c4"></span></p><p class="c3"><span class="c4">&nbsp;52:56 - 01:12:10 (SAA Framework Presentstion)</span></p><p class="c3"><span class="c4">1:23:00 - 2:15:00 (User Trial Session)</span></p><p class="c3"><span class="c4">Katilimci 2: Commit&#39;lerin kritik derecesi de &ouml;zelliklere eklenebilir. Iv&#305;r z&#305;v&#305;r bir &#351;ey mi acaba, critical blocker bir issue mu &ccedil;&ouml;zm&uuml;&#351; yoksa normal bir sorun mu &ccedil;&ouml;zm&uuml;&#351;.</span></p><p class="c3"><span class="c1">&nbsp;Participant 2: The criticality of commits can also be added to the features. Is it something trivial, or has it solved a critical blocker issue, or just a normal problem?</span></p><p class="c3"><span class="c4">Katilimci 1: Bir de &#351;ey eklenebilir. Belirli bir kod dosyas&#305; setini kendi se&ccedil;ip onlar baz&#305;nda bakmak. Birden fazla dosyaya bakmak gerekir. Baz&#305; dosyalar birlikte de&#287;i&#351;en dosyalar oluyor. Onlar hakk&#305;nda toplam bilgiyi bulmak a&ccedil;&#305;s&#305;ndan. </span></p><p class="c3"><span class="c1">Participant 1: Another feature could be selecting a specific set of code files and analyzing them together. Sometimes multiple files need to be examined together. Finding collective information about files that change together would be useful.</span></p><p class="c3"><span class="c4">Katilimci 1: &#350;eyi tavsiye edebilirim. Issue bazl&#305; de&#287;il de file gruplar&#305;n&#305;, yani ayn&#305; PR i&ccedil;inde birlikte de&#287;i&#351;tirilen file&#39;lar&#305; bir cluster edip. Ayn&#305; PR&#39;da be&#351; file de&#287;i&#351;ir, di&#287;er PR&#39;da d&ouml;rt file de&#287;i&#351;ir ama onlar&#305;n bir cluster oldu&#287;unu anl&#305;yorsunuz. Onlara odaklanmak daha mant&#305;kl&#305; olur. &Ccedil;&uuml;nk&uuml; file biraz yan&#305;lt&#305;c&#305; olabilir. </span></p><p class="c3"><span class="c1">Participant 1: I can suggest focusing on file groups instead of individual issues, clustering files that change together in the same PR. Five files might change in one PR, and four in another, but understanding they form a cluster is more practical. Focusing on these clusters makes more sense because a single file can be misleading.</span></p><p class="c3"><span class="c4">Katilimci 2: Ya genelde &#351;ey oluyor &ccedil;&uuml;nk&uuml; dedi&#287;im gibi onlar&#305; class class de&#287;il de gruplay&#305;p gidiyorlar. Bir issue&#39;ya ba&#287;l&#305; oluyorlar. Ben commit&#39;lere issue numaras&#305;n&#305; b&uuml;t&uuml;n file&#39;lara yazd&#305;r&#305;yorum. Yani d&ouml;rt tane file de&#287;i&#351;iyorsa ayn&#305; commit&#39;te, issue numaras&#305; hepsinde bulunuyor. B&ouml;ylece ilgili dosyalar oradan gruplan&#305;p, &quot;Ha bu adam bunu bitirmi&#351;, ondan sonra da bu verilebilir&quot; &#351;eklinde ilerleyebiliriz. Yani issue ba&#287;larken tek dosya de&#287;il de dosya grubuna. </span></p><p class="c3"><span class="c1">Participant 2: Usually, as I said, they don&#39;t go class by class but are grouped together. They are tied to an issue. I make sure the issue number is written in all files for commits. So, if four files are changed in the same commit, the issue number is in all of them. This way, related files can be grouped, and we can proceed, &quot;This person completed this, then it can be assigned,&quot; not just for a single file but for a group of files.</span></p><p class="c3"><span class="c4">E: Biz de zaten n tane dosya ile ilgili oldu&#287;unu biliyoruz. Trace ediyoruz zaten. Yani tek bir file ba&#287;lamaya &ccedil;al&#305;&#351;m&#305;yoruz. </span></p><p class="c3"><span class="c1">E: We already know how many files are involved. We trace them. So, we don&#39;t try to link just one file.</span></p><p class="c3"><span class="c4">Katilimci 2: Yani burada tek file var ya. </span></p><p class="c3"><span class="c1">Participant 2: Here there&#39;s only one file, right?</span></p><p class="c3"><span class="c4">E: O &ouml;rnekte &ouml;yledir. </span></p><p class="c3"><span class="c1">E: That&#39;s how it is in that example.</span></p><p class="c3"><span class="c4">Katilimci 2: Tamam zaman&#305;nda bak &#351;urada da fail olarak tek bir tane dosya se&ccedil;iliyor ve tek dosya a&ccedil;t&#305;m &#351;urada. </span></p><p class="c3"><span class="c1">Participant 2: Okay, but look, here a single file is selected as a failure and I opened a single file here.</span></p><p class="c3"><span>E: H&#305;h&#305;. </span><span class="c1">E: Yes.</span></p><p class="c3"><span class="c4">Katilimci 2: Tek de olsa gidiyor ya &#351;urada, orada birden fazla. Ama bunun &uuml;zerinde yani o? </span></p><p class="c3"><span class="c1">Participant 2: Even if it&#39;s a single file, it goes there, but multiple files are involved. So?</span></p><p class="c3"><span class="c4">E: Be&#351; tane dosya grubu vereyim. Bu, bu be&#351; dosyay&#305; en iyi bilen ki&#351;iyi bulmak istiyorsunuz mesela, anlad&#305;m, anlad&#305;m.</span></p><p class="c3"><span class="c1">&nbsp;E: Let me give you five file groups. You want to find the person who knows these five files best, right, I understand, I understand.</span></p><p class="c3"><span class="c4">Katilimci 2: Tamam tamam. </span></p><p class="c3"><span class="c1">Participant 2: Okay, okay.</span></p><p class="c3"><span class="c4">Katilimci 1: Baz&#305; dosyalar herkesin gidip ad&#305;n&#305; yaz&#305;p &ccedil;&#305;kt&#305;&#287;&#305; dosyalar olabiliyor ama baz&#305; domain&#39;ler i&ccedil;inde mesela at&#305;yorum, file upload i&ccedil;in bir class&#39;&#305; de&#287;i&#351;tirmeniz gerekiyor. Ama onu de&#287;i&#351;tirirken de onunla ilgili servislere birer sat&#305;r yazman&#305;z gerekiyor. Ama bunlar&#305;n hepsini birle&#351;tirince asl&#305;nda uzman&#305; kim oldu&#287;unu bulabiliyorsunuz.</span></p><p class="c3"><span class="c1">&nbsp;Participant 1: Some files are those where everyone writes their name and leaves, but for some domains, for example, you need to change a class for file upload. While doing that, you also need to write a line for related services. Combining all these, you can actually find out who the expert is.</span></p><p class="c3"><span class="c4">Katilimci 2: Ya ya da &#351;ey oluyor, zaten proje &#351;eylerinde servislerde tek bir dosyada yaz&#305;l&#305; olmuyorlar. Bir giri&#351; noktalar&#305; oluyor, bir i&#351;lem dosyalar&#305; oluyor. Grup grup oluyorlar. </span></p><p class="c3"><span class="c1">Participant 2: Or it happens that services in projects are not written in a single file. They have entry points, processing files, etc. They are grouped.</span></p><p class="c3"><span class="c4">Katilimci 1: Layer layer d&uuml;&#351;&uuml;nd&uuml;&#287;&uuml;n&uuml;z i&ccedil;in hani bir servis layer&#39;&#305; oluyor, bir endpoint&#39;i oluyor, bir &#351;ey oluyor. </span></p><p class="c3"><span class="c1">Participant 1: Thinking in layers, there&#39;s a service layer, an endpoint, something like that.</span></p><p class="c3"><span class="c4">E: Onu UI&#39;da s&ouml;ylemesi zor yani &#351;ey mi ya.</span></p><p class="c3"><span class="c1">&nbsp;E: It&#39;s hard to describe that in the UI, isn&#39;t it?</span></p><p class="c3"><span class="c4">Katilimci 2: Mesela hani &ouml;nce bunlara ili&#351;kilidir deyip buna g&ouml;re &ouml;ner diyebiliriz. Yani d&#305;&#351;ar&#305;da ki&#351;i se&ccedil;sin, &#351;u &#351;u &#351;u dosyalarla en &ccedil;ok ilgilenen ki&#351;ileri. Hani o konuda bilgili olanlar&#305;. &#304;&#351;te sonu&ccedil;ta. </span></p><p class="c3"><span class="c1">Participant 2: For example, we could first say these are related and suggest accordingly. Let the person outside choose, the ones most involved with these files. Those knowledgeable in that area.</span></p><p class="c3"><span class="c4">Katilimci 1: Veya ek bir analiz de d&uuml;&#351;&uuml;nebilirsiniz. Bu file&#39;la birlikte olan file&#39;lar kimlerdir? Traceability kullanarak, i&#351;te bu file&#39;la birlikte olan file&#39;lar kimler. Ek bir analiz &ccedil;&#305;karabilirsiniz. </span></p><p class="c3"><span class="c1">Participant 1: Or you could consider an additional analysis. Who are the files associated with this file? Using traceability, you can find out who worked on files associated with this one. You can come up with additional analysis.</span></p><p class="c3"><span class="c4">E: Bu arada bizim ba&#351;ka bir &uuml;r&uuml;n&uuml;m&uuml;z var. Biraz bunu yap&#305;yor. Mesela i&#351;te biraz &ouml;nce dediniz ya, mesela A.java&#39;y&#305; de&#287;i&#351;tirirken B&#39;yi de hep beraber de&#287;i&#351;tiriyorum. Mesela eskiden 10 kere commit yapm&#305;&#351;&#305;m, onunla da A&#39;y&#305; de&#287;i&#351;tirmi&#351;im, B&#39;yi de&#287;i&#351;tirmi&#351;im, A&#39;y&#305; de&#287;i&#351;tirmeye &ccedil;al&#305;&#351;t&#305;&#287;&#305;mda uyar&#305;yor, &quot;Normalde B&#39;yi de de&#287;i&#351;tiriyordum bununla beraber&quot; gibi. Mesela &ouml;yle bir &#351;ey yap&#305;yor, buraya da uygulanabilir.</span></p><p class="c3"><span class="c1">&nbsp;E: By the way, we have another product that does something similar. Like you said earlier, for example, while changing A.java, I always change B as well. If I&#39;ve made 10 commits in the past, changing A with B, it alerts me, &quot;Normally you would change B along with this.&quot; For example, it does something like that and can be applied here too.</span></p><p class="c3"><span class="c4">Katilimci 1: Baz&#305; &#351;eyler de mesela rutin faaliyetler mi? Bizler yeni bir konfig&uuml;rasyon ekleyece&#287;imiz zaman 50 tane dosyay&#305; o konfig&uuml;rasyonla yazmam&#305;z gerekiyor. Sen unutursan patl&#305;yor, mesela onu link edip g&ouml;sterse &ccedil;ok i&#351;e yarar. Nas&#305;l sistem patl&#305;yor mesela onu da s&ouml;ylese &ccedil;ok faydal&#305; olur. </span></p><p class="c3"><span class="c1">Participant 1: Some things are routine activities, for example. When we add a new configuration, we need to write it in 50 files. If you forget, it fails. Linking and showing that would be very useful. Also, explaining how the system fails would be very helpful.</span></p><p class="c3"><span class="c4">Katilimci 4: Aynen aynen, konfig&uuml;rasyon taraf&#305; i&ccedil;in &ccedil;ok ge&ccedil;erli. Bu da ayn&#305; &#351;ekilde. </span></p><p class="c3"><span class="c1">Participant 4: Exactly, exactly, very valid for the configuration side. This too, similarly.</span></p><p class="c3"><span class="c4">E: O &#351;eyde de var asl&#305;nda. &Ccedil;&uuml;nk&uuml; kola alan m&uuml;&#351;terilerin %90&#39;&#305; cips de al&#305;yor, yan&#305;nda falan gibi. Yani o dosyay&#305; de&#287;i&#351;tirdi&#287;inde front-end&#39;de bir &#351;ey de&#287;i&#351;iyorsun, arkada da hep onu de&#287;i&#351;tirmen gerekiyor. Buraya da benzerini yapmaya &ccedil;al&#305;&#351;abiliriz. Yani biraz daha farkl&#305; olur, g&uuml;zel bir feature olur bu. </span></p><p class="c3"><span class="c8">E: It&#39;s similar in that too. Like how 90% of customers who buy cola also buy chips. So when you change a file, you need to change something in the front-end and back-end as well. We could try something similar here. It would be a nice feature, a bit different.</span></p><p class="c3"><span class="c4">1:26:00 - 1:44:00(Yemek Molasi)</span></p><p class="c3"><span class="c4">Katilimci 2: Hani &#351;ey &ccedil;ok iyi olur, zor issue &ccedil;&ouml;zen commit&#39;lerin yan&#305;na b&ouml;yle o bilgiyi de verirse veya i&#351;aretlense. </span></p><p class="c3"><span class="c1">Participant 2: It would be great if it provided that information next to commits that solve difficult issues or if they were marked.</span></p><p class="c3"><span class="c4">2:15:00 - 2:42:00 (Post Question Session)</span></p><p class="c0"><span class="c4">&nbsp;L: &#304;lk sorumuz &#351;u &#351;ekilde: asl&#305;nda size sunumda yapt&#305;&#287;&#305;m&#305;z bu SAA&#39;nin graph modelini ne kadar yeterli buldunuz? Projeyi yans&#305;tmak a&ccedil;&#305;s&#305;ndan &ouml;n&uuml;m&uuml;zdeki sayfalardan inceleyebilirsiniz modeli. Bu bazda alt sorumuz, siz olsayd&#305;n&#305;z hangi t&uuml;r software artifact&#39;lerin, ili&#351;kilerin veya &ouml;zelliklerin eklenmesi gerekti&#287;ini d&uuml;&#351;&uuml;n&uuml;rd&uuml;n&uuml;z? Sizce modele neler eklenebilir ekstra olarak bunu sormu&#351;tur.</span></p><p class="c0"><span class="c1">L: Our first question is: how adequate did you find the graph model of the SAA presented to you during the presentation? You can review the model in the upcoming pages to reflect on the project. Based on this, our sub-question is, if you were in charge, what type of software artifacts, relationships, or features would you think should be added? What additional elements do you think could be included in the model?</span></p><p class="c0"><span class="c4">Katilimci 3: Bence relation&#39;lar gayet kapsay&#305;c&#305; ve yeterli ama. Issue&#39;lar&#305;n &ouml;nemi olsun, file ve commit&#39;lerin boyutu olsun, belki baz&#305; katsay&#305;lar eklenebilir. Yani onun d&#305;&#351;&#305;nda zaten baya &ccedil;e&#351;itli g&ouml;z&uuml;k&uuml;yor. </span></p><p class="c0"><span class="c1">Participant 3: I think the relations are quite comprehensive and sufficient. However, the importance of issues, the size of files and commits, maybe some coefficients can be added. Otherwise, it already looks quite diverse.</span></p><p class="c0"><span class="c4">Katilimci 2: Tabii tabii. </span></p><p class="c0"><span class="c1">Participant 2: Of course, of course.</span></p><p class="c0"><span class="c4">Katilimci 3: Ben d&uuml;&#351;&uuml;n&uuml;yorum g&uuml;nl&uuml;k hayatta neler kullan&#305;yorum, bunlar&#305; kullan&#305;yorum. </span></p><p class="c0"><span class="c1">Participant 3: I&#39;m thinking about what I use in daily life, and I use these.</span></p><p class="c0"><span class="c4">Katilimci 1: PR badge size deniyor, toplam line of code say&#305;s&#305;. </span></p><p class="c0"><span class="c1">Participant 1: It&#39;s called PR badge size, the total number of lines of code.</span></p><p class="c0"><span class="c4">L: O var asl&#305;nda hocam. </span></p><p class="c0"><span class="c1">L: We actually have that.</span></p><p class="c0"><span class="c4">Katilimci 1: Ayr&#305;ca mesela review ili&#351;kisi, toplam review edilen line say&#305;s&#305;. Ayn&#305; &#351;ekilde review gidip geldi, ka&ccedil; kez turn oldu. &Ccedil;&uuml;nk&uuml; mesela review ediliyor, sonra tekrar de&#287;i&#351;iyor, tekrar review ediliyor. Turn say&#305;s&#305;. </span></p><p class="c0"><span class="c1">Participant 1: Also, for example, the review relationship, the total number of reviewed lines. Similarly, the review goes back and forth, how many times it turned. Because, for example, it&#39;s reviewed, then changed again, and reviewed again. Turn count.</span></p><p class="c0"><span class="c4">Katilimci 1: Ya ama o turn say&#305;s&#305; da &ccedil;ok mant&#305;kl&#305; olmayabilir &ccedil;&uuml;nk&uuml;. Baz&#305;lar&#305;n&#305;n yazam&#305;yorlar. &Ccedil;&uuml;nk&uuml; issue a&ccedil;&#305;ld&#305;&#287;&#305;nda da &ccedil;ok a&ccedil;&#305;k olmuyor. Benim issue&#39;lar&#305;m &ccedil;ok fazla gidip gidip geliyor. Benim m&uuml;&#351;teriden kaynakl&#305; olarak. &Ccedil;&uuml;nk&uuml; k&uuml;&ccedil;&uuml;c&uuml;k az bir sat&#305;r koyuyorlar yani. &quot;Kervan yolda dizilir&quot; diyeyim de hepsini &#351;ey yap&#305;yorlar, tabloyu etkilenecek diyor ya bu tablonun kolonlar&#305; yok mu diyorum, oraya a&ccedil;&#305;klay&#305;n, size &#351;unu da ekleyelim, bunu da ekleyelim. Bilmem ne, o 100 tane &#351;ey var camdan, yani o y&uuml;zden o turnover biraz &#351;ey. Yani issue ilk ba&#351;ta d&uuml;zg&uuml;n a&ccedil;&#305;yorsan mant&#305;kl&#305; ama genelde &ccedil;ok i&#351;lemiyor. </span></p><p class="c0"><span class="c1">Participant 1: But the turn count might not be very logical because some can&#39;t write clearly. Because when an issue is opened, it&#39;s not very clear. My issues go back and forth a lot, because of the customer. They put in a tiny bit of text. &quot;Kervan yolda dizilir&quot; as they say, and they keep adding things, saying it will affect the table. I say, aren&#39;t there columns in the table, explain it there, and we&#39;ll add this, add that. There are 100 things through the window, so that turnover is a bit tricky. If you open the issue correctly at first, it makes sense, but generally, it doesn&#39;t work well.</span></p><p class="c0"><span class="c4">Katilimci 1: Issue type ile de ilgili mesela. Yani improvement gidip gelebilir ama. Mesela bug ise onun gidip gelmemesi laz&#305;m.</span></p><p class="c0"><span class="c1">&nbsp;Participant 1: It&#39;s also related to the issue type. For example, an improvement might go back and forth, but if it&#39;s a bug, it shouldn&#39;t go back and forth.</span></p><p class="c0"><span class="c4">Katilimci 1: Bir de reopen oluyor issue&#39;lar&#305;n baz&#305;lar&#305;. Yani ayn&#305; hata &ccedil;&ouml;z&uuml;l&uuml;p tekrar geliyor. Onlar ne kadar &ccedil;ok d&ouml;n&uuml;yor ona bakmak laz&#305;m.</span></p><p class="c0"><span class="c1">&nbsp;Participant 1: Some issues get reopened. That is, the same error is solved and comes back again. We need to look at how often they go back and forth.</span></p><p class="c0"><span class="c4">E: O anomaliler aras&#305; var, onu s&ouml;yl&uuml;yorum. </span></p><p class="c0"><span class="c1">E: There are those anomalies, that&#39;s what I&#39;m saying.</span></p><p class="c0"><span class="c4">Katilimci 3: Bir de &#351;ey, bir &#351;ey s&ouml;yleyebilirim. Jira&#39;da, bazen yanl&#305;&#351;l&#305;kla i&#351;i kapat&#305;yorum. 10 saniye sonra geri a&ccedil;&#305;yorum. Bu tarz durumlar&#305; datadan elemek a&ccedil;&#305;s&#305;ndan bir analiz olabiliyor. </span></p><p class="c0"><span class="c1">Participant 3: Also, I can say something. In Jira, sometimes I accidentally close a task and reopen it 10 seconds later. An analysis to eliminate such situations from the data can be helpful.</span></p><p class="c0"><span class="c4">E: Biz onu asl&#305;nda anomaly dahil etmemek i&ccedil;in onu ediyoruz ba&#351;&#305;nda. Yani hani onu.</span></p><p class="c0"><span class="c1">&nbsp;E: We actually exclude that at the beginning to avoid including it as an anomaly.</span></p><p class="c0"><span class="c4">Katilimci 3: Tamam ama mesela hi&ccedil; alakam olmayan bir &#351;ey, issue bak&#305;yorken, okuyorken bir k&#305;sa yolu oluyor. Klavye diye bir &#351;ey. </span></p><p class="c0"><span class="c1">Participant 3: Okay, but for example, sometimes something I&#39;m not related to, while looking at an issue, reading it, there&#39;s a shortcut. Like on the keyboard.</span></p><p class="c0"><span class="c4">Katilimci 1: Direkt zaten datay&#305; y&uuml;klerken o durumlar elimine edilebilir. &Ccedil;&uuml;nk&uuml; bazen baz&#305; caseler oluyor mesela. Sistem patlad&#305;, &#351;ey orada olabilir ama herkes sonu&ccedil;ta programlara dalm&#305;&#351; yani. Onu buraya katma de&#287;il. Hani bunu sistemden &ccedil;&#305;kartmak gerekebilir yani. </span></p><p class="c0"><span class="c1">Participant 1: Those situations can be eliminated while uploading the data. Because sometimes there are cases, for example, the system crashes, it might be there, but everyone is engrossed in the programs. So, it&#39;s not about including it here. It may need to be removed from the system.</span></p><p class="c0"><span class="c4">Katilimci 4: Burada tabii bu artifact&#39;ler &uuml;zerinden konu&#351;tuk ama kurumsallarda da vard&#305;r i&#351;te asl&#305;nda. O PR&#39;daki CI ba&#351;ar&#305;l&#305;, i&#351;te ya da ne bileyim birden fazla CI olabiliyor. Baz&#305;lar&#305; bir tane ba&#351;ar&#305;l&#305; bir build yeterli oluyor ama onun 3 tane build var asl&#305;nda ko&#351;an. Hani oradaki &#351;eyleri de de&#287;erlendirmeye al&#305;nabilir. B&uuml;t&uuml;n build&#39;lar&#305; ba&#351;ar&#305;l&#305; olarak ge&ccedil;mi&#351; olan o author&#39;lar&#305; &ouml;ner i&#351;te gibi ya da. O yani build mekanizmas&#305;yla ya da oradaki ba&#351;ar&#305;mla ya da bu bir yere release edilebilmi&#351; commit&#39;lerin author&#39;lar&#305; &ouml;ner gibi g&uuml;zel &#351;eyler &ccedil;&#305;kabilir ya bizdeki &ouml;rnekten yola &ccedil;&#305;karsam bizde 3 ayda bir i&#351;te front-end&#39;ler i&ccedil;in s&ouml;yleyeyim, mesela library olabiliyor mu? &Ccedil;&uuml;nk&uuml; biz bir &uuml;r&uuml;n&uuml;m&uuml;z bizden t&uuml;relecek olan &uuml;r&uuml;nler onu kullanacak ama defaultta laz&#305;m de&#287;il oluyorsa ge&ccedil;iriyoruz bir yere. &Ccedil;&uuml;nk&uuml; benim &uuml;r&uuml;n&uuml;me laz&#305;m de&#287;il ama benim &uuml;r&uuml;n&uuml;mden t&uuml;reyeceklerini engelleyece&#287;im. Di&#287;er ikisi ge&ccedil;tiyse bu ge&ccedil;mi&#351; oluyor ama asl&#305;nda bunu da ge&ccedil;mi&#351;. Olan commit&#39;leri yapan ki&#351;i daha do&#287;ru d&uuml;zg&uuml;n, g&uuml;zel kod yazm&#305;&#351; demek oldu&#287;u yazd&#305;&#287;&#305;nda. Onu oradaki ki&#351;ilerden &ouml;nerse daha ho&#351; olur, g&uuml;zel iyi.</span></p><p class="c0"><span class="c1">&nbsp;Participant 4: Here, we talked about these artifacts, but it&#39;s the same in corporates. The CI in that PR is successful, or maybe there are multiple CIs. Sometimes a single successful build is sufficient, but there are actually 3 builds running. Things there could also be taken into consideration. Suggesting authors whose builds passed successfully, or suggesting authors of commits that were successfully released somewhere, could bring nice outcomes. From our example, for front-ends every 3 months, we might have a library. Because our product will be used by derivative products from us, but if it&#39;s not needed by default, we move it somewhere. Because it&#39;s not needed for my product but I&#39;ll prevent derivatives. If the other two passed, this one has also passed. So, the person who made the commit has written proper, good code. Suggesting those people would be better.</span></p><p class="c0"><span class="c4">Katilimci 3: SonarQube mesela require check de&#287;il. Olmasa da olur. Yani baz&#305; bulunmamas&#305; ama orda ye&#351;il alanlar&#305; onun.</span></p><p class="c0"><span class="c1">&nbsp;Participant 3: SonarQube, for example, isn&#39;t a required check. It doesn&#39;t have to be there. I mean, some things aren&#39;t found, but there are its green areas.</span></p><p class="c0"><span class="c4">L: Bu dedi&#287;iniz analizlerin eklenmesi i&ccedil;in sizce ekstra hangi artifact&#39;ler eklenebilir? Yani kayda ge&ccedil;mesi i&ccedil;in?</span></p><p class="c0"><span class="c1">&nbsp;L: What additional artifacts do you think could be added to incorporate these analyses? To record them?</span></p><p class="c0"><span class="c4">Katilimci 4: CI run&#39;lar&#305;, mesela biz 3 build varsa 1 tanesi ge&ccedil;se de kabul ediyoruz ama bunun belirtilmesi a&ccedil;&#305;s&#305;ndan eklenebilir. </span></p><p class="c0"><span class="c1">Participant 4: CI runs, for example, if we have 3 builds, we accept if 1 passes, but this could be added for clarification.</span></p><p class="c0"><span class="c4">Katilimci 1: Benim dedi&#287;im file&#39;lar&#305;n olu&#351;turdu&#287;u cluster&#39;lar. Yani birlikte de&#287;i&#351;en file&#39;lar. </span></p><p class="c0"><span class="c1">Participant 1: The clusters formed by the files I&#39;m talking about. The files that change together.</span></p><p class="c0"><span class="c4">Katilimci 5: Comment etmek de expert bulma i&#351;lemine kat&#305;labilir.</span></p><p class="c0"><span class="c1">&nbsp;Participant 5: Commenting can also be included in finding experts.</span></p><p class="c0"><span class="c4">Katilimci 1: Bizim o eskiden kulland&#305;&#287;&#305;m&#305;z ara&ccedil;ta da o &#351;ekildeydi. &Ccedil;ok comment veren asl&#305;nda kodu daha &ccedil;ok bilen anlam&#305;na geliyor. </span></p><p class="c0"><span class="c1">Participant 1: In the tool we used before, it was like that. The one who comments a lot actually means they know the code better.</span></p><p class="c0 c11"><span class="c4"></span></p><p class="c0"><span class="c4">Katilici 2 : Bazen seyde oluyor musterinin commentleri bir ayd&#305;r bekliyor diye bir &#351;ey yapal&#305;m.</span></p><p class="c0"><span class="c4">L: Di&#287;er bir sorumuzda da asl&#305;nda &#351;unu sormu&#351;tuk, sizce bu software artifact analyzer tool&#39;una yeni bir analiz eklenecek olsa ne gibi analizler eklenebilir? Sormaya &ccedil;al&#305;&#351;t&#305;&#287;&#305;m&#305;z &#351;ey asl&#305;nda &#351;u, dedi&#287;imiz gibi biz en temelinde bu software artifact traceability graph yap&#305;s&#305;n&#305; kullan&#305;yoruz. Sizin akl&#305;n&#305;za mesela bu graph yap&#305;s&#305;n&#305; kullanarak asl&#305;nda ayn&#305; &#351;ekilde bu sisteme entegre edilebilecek bir analiz &ccedil;e&#351;idi geliyor mu? Veya hani sizin hani &ccedil;al&#305;&#351;ma s&uuml;resince ke&#351;ke b&ouml;yle bir ara&ccedil; olsayd&#305; dedi&#287;iniz bir noktada olabilir. Ya asl&#305;nda cevaplad&#305;n&#305;z o y&uuml;zden yani yani baya&#287;&#305; var asl&#305;nda. Daha detayli katki vermek istiyern olur mu acaba. </span></p><p class="c0"><span class="c4">Katilimci 3: &#350;ey g&uuml;zel olur asl&#305;nda b&ouml;yle kendime y&ouml;nelik ge&ccedil;mi&#351;te ne yapm&#305;&#351;&#305;m &#351;eklinde bakabilirim.</span></p><p class="c0"><span class="c1">&nbsp;Participant 3: It would actually be nice to look at what I&#39;ve done in the past for myself.</span></p><p class="c0"><span class="c4">Katilimci 1: Orada developer baz&#305;nda se&ccedil;iliyor galiba benim &#351;eylerim var. Hatta zamanda oynatabilirsin. B&ouml;yle artm&#305;&#351; m&#305;. </span></p><p class="c0"><span class="c1">Participant 1: I think it&#39;s selected on a developer basis there. You can even play with the time to see if it has increased.</span></p><p class="c0"><span class="c4">Katilimci 2: Bunun bir tane kullan&#305;m k&#305;lavuzunu yapacak m&#305;s&#305;n? </span></p><p class="c0"><span class="c1">Participant 2: Will you make a user manual for this?</span></p><p class="c0"><span class="c4">L: Var hocam. </span></p><p class="c0"><span class="c1">L: Yes, we have it.</span></p><p class="c0"><span class="c4">Katilimci 5: &#350;ey eklenebilir, tak&#305;mlar&#305;n ger&ccedil;ekte sizin d&uuml;zenledi&#287;iniz tak&#305;m yap&#305;s&#305;na uygunluk olmad&#305;&#287;&#305;n&#305;, kod dosyalar &uuml;zerinden &ccedil;&#305;kar&#305;lmas&#305;yla ilgili &ccedil;al&#305;&#351;malar vard&#305;. Belki &ouml;yle bir &#351;ey olabilir. Developer o &#351;ekilde cluster etmek tarz&#305;nda. Hani bazen bizim &#351;irkette de 4 ki&#351;iyle ba&#351;l&#305;yor. Tak&#305;m sekize &ccedil;&#305;k&#305;yor, sonra b&ouml;l&uuml;yorlar ama neye g&ouml;re b&ouml;l&uuml;necek yani veya ba&#351;ka bir konsepte g&ouml;re yeni yap&#305;lacak i&#351;in mant&#305;&#287;&#305;na g&ouml;re. </span></p><p class="c0"><span class="c1">Participant 5: Something could be added regarding whether teams actually fit the team structure you designed, based on code files. Maybe something like that. Clustering developers in that way. Like in our company, sometimes a team starts with 4 people, then grows to 8, and then they split. But how should they be split, or according to what concept should new work be structured?</span></p><p class="c0"><span class="c4">Katilimci 4: Yani &#351;ey gibi bir analiz de eklenebilir mesela. Kritik developer&#39;lar&#305;n bulunmas&#305;. Bu kritik, kritik onlar giderse ne olur gibi. </span></p><p class="c0"><span class="c1">Participant 4: An analysis could be added to find critical developers. Like, if these critical developers leave, what happens?</span></p><p class="c0"><span class="c4">E: Onunla ilgili benzer bir &ccedil;al&#305;&#351;mam&#305;z var mesela bus fakt&ouml;r falan gibi bir &#351;ey. Yani i&#351;te &#351;u &#351;u mod&uuml;l&uuml; sadece bu biliyor, bu mod&uuml;l&uuml; 3-4 ki&#351;i biliyor falan.</span></p><p class="c0"><span class="c1">&nbsp;E: We have a similar study on that, like a bus factor. So, for example, only this person knows this module, while 3-4 people know this other module.</span></p><p class="c0"><span class="c4">Katilimci 4: Bu bunu biz s&ouml;zel olarak biliyoruz da bunu birine ikna ederken data gerekti&#287;inde mesela sen onu a&#287;z&#305;na s&ouml;yl&uuml;yorsun. Yani &quot;&#350;u ki&#351;i derse yanar&#305;z&quot; diye de y&ouml;netici herkes muhabbetidir. Asl&#305;nda hepsinin yerine biri bulunur falan, sadece tabi 10&#39;a &ccedil;&#305;kart bakarsan&#305;z mezarl&#305;klar iyi. </span></p><p class="c0"><span class="c1">Participant 4: We know this verbally, but when convincing someone else and needing data, you say it. Like, &quot;If this person leaves, we&#39;re in trouble,&quot; and every manager talks like that. Actually, someone can replace everyone, but of course, if you look at 10, graveyards are good.</span></p><p class="c0"><span class="c4">U: Eray o &#351;apkay&#305; takt&#305;&#287;&#305; zaman o konular&#305;yla &ccedil;al&#305;&#351;&#305;yor, ilgili &ccedil;al&#305;&#351;&#305;yor. Bizim buradaki &#351;apkam&#305;z ayr&#305; bir &#351;apka. Yani biz o &ccedil;al&#305;&#351;&#305;p yap&#305;lan &ccedil;al&#305;&#351;malara buraya entegre ediyoruz. </span></p><p class="c0"><span class="c1">U: When Eray wears that hat, he works on those subjects, related to that. Our hat here is a different one. So, we integrate those studies done into this.</span></p><p class="c0"><span class="c4">L: Di&#287;er bir soruda asl&#305;nda, bu g&ouml;sterdi&#287;imiz bu &ccedil;izim kanvas&#305; projedeki software artifact&#39;leri hakk&#305;nda bilgi edinme veya genel olarak bu tarz i&#351;ler i&ccedil;in ne kadar katk&#305; yarat&#305;yor? Projedeki artifact&#39;leri incelemek i&ccedil;in bu &ccedil;izim kanvas&#305;n&#305; kullan&#305;r m&#305;yd&#305;n&#305;z? </span></p><p class="c0"><span class="c1">L: Another question is, how useful is this drawing canvas we showed for getting information about software artifacts in the project or for general tasks like this? Would you use this drawing canvas to examine the artifacts in the project?</span></p><p class="c0"><span>U: Mesela Alperen kendisini buraya query edip sonra show all work diyebilir. Yani bir s&uuml;r&uuml; olur. </span><span class="c1">U: For example, Alperen can query himself here and then say &quot;show all work.&quot; There would be a lot.</span></p><p class="c0"><span class="c4">Katilimci 3: Evet, beni &ccedil;ok kullan&#305;rd&#305; ya. Dedi&#287;iniz gibi yapt&#305;&#287;&#305;m i&#351;lere bakmak i&ccedil;in.</span></p><p class="c0"><span class="c1">&nbsp;Participant 3: Yes, it would be very useful for me. As you said, to look at the work I&#39;ve done.</span></p><p class="c0"><span class="c4">Katilimci 4: Ben de kullan&#305;rd&#305;m, i&#351;ime yarard&#305;. Ben BevOps&#39;tay&#305;m mesela. Bir yerde bir problem &ccedil;&#305;kt&#305;&#287;&#305; zaman mesela h&#305;zl&#305;ca kimseye sormadan gidip art&#305;k hep de vakit he bunu &#351;uray&#305; bozmu&#351;lar, buradan da &#351;unu bozmu&#351;lar deyip gidip bulurum sahibini. &quot;Buralar&#305; niye bozuyoruz?&quot; derim &ccedil;ok. </span></p><p class="c0"><span class="c1">Participant 4: I would use it too, it would be useful for me. I&#39;m in BevOps, for example. When a problem arises somewhere, I can quickly go and find the person responsible without asking anyone. &quot;Why are we breaking these?&quot; I often say.</span></p><p class="c0"><span class="c4">L: Tamamd&#305;r, &#351;imdi isterseniz bu deneme b&ouml;l&uuml;m&uuml;nde yapt&#305;&#287;&#305;n&#305;z task&#39;lar dolay&#305;s&#305;yla verdi&#287;iniz cevaplar &uuml;zerinden gidebiliriz. </span></p><p class="c0"><span class="c1">L: Alright, now if you want, we can go through the answers you provided during the trial tasks section.</span></p><p class="c0"><span class="c4">Katilimci 2: Valla ben o arac&#305;n &ouml;nerdi&#287;ini yazd&#305;m. Tool &ouml;nerdi&#287;i bana mant&#305;kl&#305; geldi. </span></p><p class="c0"><span class="c8">Participant 2: Well, I wrote what the tool suggested. The tool&#39;s suggestion made sense to me</span><span class="c4">.</span></p><p class="c0"><span class="c4">Katilimci 4: Recency denince ikinci olarak Hans &ccedil;&#305;k&#305;yordu. Fakat katk&#305; olarak bak&#305;nca Peter &ccedil;&#305;k&#305;yordu. Onun da daha &ccedil;ok katk&#305;s&#305; var ama daha eski. </span></p><p class="c0"><span class="c1">Participant 4: When considering recency, Hans came out second. But when looking at contributions, Peter came out. He has more contributions, but they&#39;re older.</span></p><p class="c0 c11"><span class="c4"></span></p><p class="c0"><span class="c4">Katilimci 3: Hans ile Peter aras&#305;nda &ccedil;ok az fark vard&#305;. Ben Peter&#39;&#305; se&ccedil;tim. Graph a&ccedil;&#305;nca bir t&uuml;r ili&#351;ki vard&#305;. Yani tool&#39;u kulland&#305;m. </span></p><p class="c0"><span class="c1">Participant 3: There was very little difference between Hans and Peter. I chose Peter. When I opened the graph, there was a certain relationship. So, I used the tool.</span></p><p class="c0"><span class="c4">Katilimci 1: Bu asl&#305;nda &#351;eyi g&ouml;steriyor yani, sorunun zor bir soru oldu&#287;unu. Yani bir bak&#305;&#351;ta &ccedil;&ouml;z&uuml;lemeyece&#287;ini g&ouml;steriyor. Bir tool support gerektirdi&#287;ini.</span></p><p class="c0"><span class="c1">&nbsp;Participant 1: This actually shows that it was a difficult question. It indicates that it can&#39;t be solved at a glance and that tool support is required.</span></p><p class="c0"><span class="c4">L: Tamam, devam edelim. Di&#287;er bir sorumuzda da asl&#305;nda hangisinin daha g&uuml;venilir sonu&ccedil;lar verdi&#287;ini sormu&#351;tuk. Burada da san&#305;r&#305;m genel olarak insanlar recency value ile birlikte SAA&#39;y&#305; tercih etmi&#351;. Ama genelde SAA tercih edilmi&#351;. Bu konu hakk&#305;nda yorum yapmak isteyen olur mu, yoksa ge&ccedil;elim mi? Tamam ge&ccedil;elim. </span></p><p class="c0"><span class="c1">L: Alright, let&#39;s continue. Another question we asked was which one gave more reliable results. Here, I think people generally preferred SAA with the recency value. But overall, SAA was preferred. Does anyone want to comment on this, or should we move on? Okay, let&#39;s move on.</span></p><p class="c0"><span class="c4">E: Bu arada buradaki rakamlar bir &ouml;nceki bir fokus grup 5 ki&#351;i daha vard&#305;. Onun rakamlar&#305;na toplam g&ouml;r&uuml;yorsunuz. </span></p><p class="c0"><span class="c1">E: By the way, the numbers here include a previous focus group with 5 more people. You&#39;re seeing the total numbers.</span></p><p class="c0"><span class="c4">L: Di&#287;er bir sorumuzda ise SAA hakk&#305;nda inand&#305;r&#305;c&#305; bulmad&#305;ysan&#305;z nedenleri ne diye sormu&#351;tuk. Limited context &ouml;nde gelmi&#351;, bu konu hakk&#305;nda yorum yapmak isteyen olur mu? </span></p><p class="c0"><span class="c1">L: Another question we asked was, if you didn&#39;t find SAA credible, what were the reasons? Limited context came up as a leading reason. Does anyone want to comment on this?</span></p><p class="c0"><span class="c4">Katilimci 4: Evet asl&#305;nda &#351;ey, tool&#39;da ki &#351;eyleri ben customize edebiliyor olsam kimsenin bulamayaca&#287;&#305; &#351;eyleri bulabilirim. Ama hani oradaki set stabil geliyor. &#304;lk etapta mesela burada &#351;ey diyebilirim. Ne bileyim &ouml;nceli&#287;i y&uuml;ksek olmayan &#351;eyleri veya da lines of code&#39;undan az olan alan gibi kendimce bir &#351;eyler ekleyebiliyor olsam &ccedil;o&#287;u zaten. Eksi&#287;ini s&ouml;ylemek i&ccedil;in s&ouml;yledim. </span></p><p class="c0"><span class="c1">Participant 4: Yes, actually, if I could customize things in the tool, I could find things no one else can. But the set comes stable initially. For example, I could add things like low-priority issues or areas with fewer lines of code. I&#39;m saying this to point out the shortcomings.</span></p><p class="c0"><span class="c4">Katilimci 4: Sadece graph analiz yap&#305;yorsunuz. Geri kalan de&#287;i&#351;ik yapt&#305;&#287;&#305;n&#305;z denge direk kuruyorsunuz ama belki o kodlardaki line of code de&#287;i&#351;ikli&#287;i oran&#305; veya i&#351;te hep ayn&#305; b&ouml;l&uuml;mleri de&#287;i&#351;tirdi. Ne kadar varyasyon sorular. &#304;&#351;te doksanla dokundu, 80 dokundu veya onunla dokundu ama 50 kere de&#287;i&#351;tirdi. Vesaire. Hani bu t&uuml;r contextler belki biraz daha oradaki ekspertizi netle&#351;tirebilir. Do&#287;ru. Burada birden &ccedil;ok zeki biliyor. </span></p><p class="c0"><span class="c1">Participant 4: You only do graph analysis. You directly balance the remaining changes, but maybe the rate of line of code changes or changing the same sections repeatedly. Questions like how much variation there is. For example, it touched 90, 80, or it touched it but changed it 50 times, etc. These kinds of contexts might clarify the expertise there a bit more. Correct. Here, many people know it.</span></p><p class="c0"><span class="c4">L: Bir di&#287;er sorumuzda ise GitHub ile bulma y&ouml;nteminiz g&uuml;venilmez ise neden diye sormu&#351;tuk. Burada da limited content i&#351;aretlenmi&#351;, bu konu hakk&#305;nda yorum yapmak isteyen olur mu?</span></p><p class="c0"><span class="c1">&nbsp;L: Another question we asked was, if you found the method of finding with GitHub unreliable, why? Limited context was marked here as well. Does anyone want to comment on this?</span></p><p class="c0"><span class="c4">Katilimci 4: Ya tabii &ccedil;&#305;kar&#305;m yapmak i&ccedil;in &ccedil;ok zor oluyor. Ondan ona gidiyim, ondan ona gidiyim. </span></p><p class="c0"><span class="c1">Participant 4: Yeah, of course, it&#39;s very difficult to make inferences. Going from one to another.</span></p><p class="c0"><span class="c4">Katilimci 5: Mesela ben g&ouml;z&uuml;mle yaparken Michael Mostarda&#39;y&#305; se&ccedil;mi&#351;tim. Halbuki 15 y&#305;l &ouml;nceymi&#351;. &Ccedil;ok dikkat etmemi&#351;tim ya o y&uuml;zden. Ben bulamad&#305;m mesela.</span></p><p class="c0"><span class="c1">&nbsp;Participant 5: For example, when I was doing it manually, I chose Michael Mostarda. Turns out it was 15 years ago. I didn&#39;t pay much attention, so I couldn&#39;t find it.</span></p><p class="c0"><span class="c4">Katilimci 1: G&ouml;zle aramak daha zor tabii ki, tool&#39;da direkt sonu&ccedil;lar&#305; ve nedeni g&ouml;steriyor. </span></p><p class="c0"><span class="c1">Participant 1: Searching manually is more difficult, of course. The tool directly shows the results and reasons.</span></p><p class="c3"><span class="c7">L:</span><span class="c4">&nbsp;Di&#287;er bir sorumuzda da asl&#305;nda genel olarak bu g&ouml;rselle&#351;tirmenin sonu&ccedil;lar&#305;n anlamland&#305;r&#305;labilirli&#287;ine ne kadar katk&#305; sa&#287;lad&#305;&#287;&#305;n&#305; sormu&#351;tuk. Cevaplara g&ouml;re genel olarak pozitif katk&#305; sa&#287;lad&#305;&#287;&#305;n&#305; d&uuml;&#351;&uuml;n&uuml;yormu&#351;uz. Bunu da mesela 3 diyen biri konu&#351;abilir mi acaba?</span></p><p class="c3"><span class="c8">&nbsp;</span><span class="c6">L:</span><span class="c1">&nbsp;Another question we asked was how much this visualization contributes to the interpretability of the results. According to the answers, we think it generally provides a positive contribution. Could someone who rated it as 3 speak on this?</span></p><p class="c3"><span class="c7">L:</span><span class="c4">&nbsp;Burada da genellikle olumlu cevap alm&#305;&#351;&#305;z. Bunun &uuml;zerine yorumda bulunmak isteyen olumlu yani g&ouml;rsellik mesela analizinizde nas&#305;l size bir yard&#305;m sa&#287;lad&#305;? Yani sonu&ccedil;lar&#305;n &ccedil;&#305;kar&#305;m inand&#305;r&#305;c&#305;l&#305;&#287;&#305; sizin i&ccedil;in artt&#305; m&#305;? </span></p><p class="c3"><span class="c6">L:</span><span class="c1">&nbsp;Here, we&#39;ve generally received positive responses. Would anyone like to comment on how visualization helped you in your analysis? Did it increase the credibility of the results for you?</span></p><p class="c3"><span class="c7">Katilimci 2:</span><span class="c4">&nbsp;G&ouml;stermek iyi oldu tabi. Yani burada 5 var, bu 3 yapm&#305;&#351;, bu 2 yapm&#305;&#351;, ne yapm&#305;&#351; bak. G&ouml;rsel daha iyi tabi. </span></p><p class="c3"><span class="c6">Participant 2:</span><span class="c1">&nbsp;It was good to show it, of course. Here, there&#39;s a 5, this one made a 3, this one made a 2, see what they&#39;ve done. Visual is definitely better.</span></p><p class="c3"><span class="c7">Katilimci 3:</span><span class="c4">&nbsp;Ben mesela Peter&#39;&#305; kesinlikle ikinci s&#305;raya koymazd&#305;m. B&uuml;y&uuml;kl&uuml; bir s&uuml;re sonra anla&#351;&#305;l&#305;yor tabii ki. </span></p><p class="c3"><span class="c6">Participant 3:</span><span class="c1">&nbsp;For example, I definitely wouldn&#39;t have placed Peter in the second position. It becomes clear after a while.</span></p><p class="c3"><span class="c7">Katilimci 1:</span><span class="c4">&nbsp;Ben sadece visualization &#351;eyi eklerdim. Hani graph g&ouml;sterimi g&uuml;zel ho&#351; ama. Hani her &#351;eyi anlatam&#305;yorsun. Grafik biraz daha chart&#39;lard&#305;r, i&#351;te raporlard&#305;r. Hani aynen dashboard koymak laz&#305;m. </span></p><p class="c3"><span class="c6">Participant 1:</span><span class="c1">&nbsp;I would just add something to the visualization. The graph display is nice, but you can&#39;t explain everything. Graphics are more like charts, reports. We need to add dashboards.</span></p><p class="c3"><span class="c7">E:</span><span class="c4">&nbsp;Bunun bir &ouml;nceki fokus grupta da &ouml;zellikle yani b&ouml;yle dashboard&#39;tan gitmek istiyor insanlar. </span></p><p class="c3"><span class="c6">E:</span><span class="c1">&nbsp;In the previous focus group, people also wanted to go with dashboards.</span></p><p class="c3"><span class="c7">Katilimci 1:</span><span class="c4">&nbsp;Zaman i&ccedil;inde b&ouml;yle ne olmu&#351;, aynen trend y&ouml;netimi. </span></p><p class="c3"><span class="c6">Participant 1:</span><span class="c1">&nbsp;What&#39;s happened over time, exactly, trend management.</span></p><p class="c3"><span class="c7">L:</span><span class="c4">&nbsp;Tamam, di&#287;er bir sorumuzda da asl&#305;nda ekledi&#287;imiz bu g&ouml;rsel elementlerin, mesela node badge&#39;lerinin, anlay&#305;&#351;a ne kadar katk&#305; sa&#287;lad&#305;&#287;&#305;n&#305; sormu&#351;tuk. Bunda da genelde pozitif yan&#305;t &ccedil;&#305;km&#305;&#351;. Bu konu hakk&#305;nda konu&#351;mak isteyen olur mu? Yani &#351;u &#351;ekilde geli&#351;tirilebilir &#351;eklinde de bir yorum alabiliriz. </span></p><p class="c3"><span class="c6">L:</span><span class="c1">&nbsp;Alright, another question we asked was how much the visual elements we added, such as node badges, contributed to understanding. This also generally received positive responses. Would anyone like to comment on this? We could also take suggestions on how it could be improved.</span></p><p class="c3"><span class="c7">Katilimci 1:</span><span class="c4">&nbsp;Az &ouml;nce bahsetti&#287;im gibi, buradaki 3&#39;&uuml; ben verdim. Graph yeterli gelmiyor &ccedil;&uuml;nk&uuml; bana. </span></p><p class="c3"><span class="c6">Participant 1:</span><span class="c1">&nbsp;As I mentioned earlier, I gave it a 3. The graph isn&#39;t sufficient for me.</span></p><p class="c3"><span class="c7">L:</span><span class="c4">&nbsp;Di&#287;er bir sorumuzda asl&#305;nda SAA ile expert bulman&#305;n sizin normalde kulland&#305;&#287;&#305;n&#305;z metoda k&#305;yasla daha kolay olup olmad&#305;&#287;&#305;n&#305; sormu&#351;tuk. Genellikle kullan&#305;c&#305;lar daha kolay oldu&#287;unu d&uuml;&#351;&uuml;nm&uuml;&#351;. </span></p><p class="c3"><span class="c6">L:</span><span class="c1">&nbsp;In another question, we asked whether finding experts with SAA was easier compared to the method you normally use. Generally, users thought it was easier.</span></p><p class="c3"><span class="c7">L:</span><span class="c4">&nbsp;Son sorumuzda da asl&#305;nda Jira ve SAA&#39;y&#305; kar&#351;&#305;la&#351;t&#305;rd&#305;&#287;&#305;m&#305;zda anomaly detection a&ccedil;&#305;s&#305;ndan hangisinde daha rahatt&#305; diye sormu&#351;tuk ama zaten konu&#351;tuk. &Uuml;st&uuml;ne daha fazla konu&#351;mak isteyen olursa. &Ccedil;o&#287;u kullan&#305;c&#305; SAA&#39;y&#305; daha useful bulmu&#351;. </span></p><p class="c3"><span class="c6">L:</span><span class="c1">&nbsp;In our last question, we asked which was more comfortable for anomaly detection when comparing Jira and SAA, but we&#39;ve already discussed this. If anyone wants to add more, most users found SAA more useful.</span></p><p class="c3"><span class="c7">Katilimci 4:</span><span class="c4">&nbsp;&#350;&ouml;yle bir yorumda bulunabilirim. Buradaki anomaliler bir varsay&#305;ma dayan&#305;yor. </span></p><p class="c3"><span class="c6">Participant 4:</span><span class="c1">&nbsp;I can make a comment like this. The anomalies here are based on an assumption.</span></p><p class="c3"><span class="c7">L:</span><span class="c4">&nbsp;Genel olarak SAA hakk&#305;ndaki deneyiminizi sormak istemi&#351;tik. Kafa kar&#305;&#351;t&#305;r&#305;c&#305; noktalar&#305; neydi sizce veya siz bu arac&#305; kullan&#305;yor olsayd&#305;n&#305;z en fazla hangi use case baz&#305;nda kullan&#305;yor olurdunuz? Hani inspection kullan&#305;rd&#305;n&#305;z yoksa yeni bir analiz mi entegre ederdiniz, yoksa h&acirc;lihaz&#305;rda olan analizlerden birini mi kullan&#305;rd&#305;n&#305;z? Bu &#351;ekilde bir soru sormu&#351;tur.</span></p><p class="c3"><span class="c8">&nbsp;</span><span class="c6">L:</span><span class="c1">&nbsp;We wanted to ask about your overall experience with SAA. What were the confusing points for you, or if you were using this tool, for which use case would you use it the most? Would you use it for inspection, integrate a new analysis, or use one of the existing analyses? We asked a question in this way.</span></p><p class="c3"><span class="c7">Katilimci 2:</span><span class="c4">&nbsp;Projede en &ccedil;ok &ccedil;al&#305;&#351;an ki&#351;iyi bulabiliriz. Bunu elden ka&ccedil;&#305;rmayal&#305;m. Bu &ccedil;ocuk iyiymi&#351; diye. Bize yol g&ouml;sterir. </span></p><p class="c3"><span class="c6">Participant 2:</span><span class="c1">&nbsp;We could find the person who works the most on the project. Let&#39;s not miss this. We can say, &quot;This person is good.&quot; It guides us.</span></p><p class="c3"><span class="c7">Katilimci 4:</span><span class="c4">&nbsp;G&ouml;rsel olarak ileti&#351;im sa&#287;lam&#305;yor bir&ccedil;ok ara&ccedil;. Bir de navigate ederek g&ouml;rebiliyorum, ili&#351;kisel olarak inceleyebiliyorum. &Ccedil;ok y&ouml;nl&uuml; olmas&#305; a&ccedil;&#305;s&#305;ndan da kullan&#305;&#351;l&#305;. Asl&#305;nda tool&#39;lar&#305;m&#305;zda bir &#351;eye g&ouml;re bir &#351;ey s&ouml;yleyebiliyoruz. Ama issue bir alan&#305;nda &#351;&ouml;yle bir veri varsa ve o developer &#351;&ouml;yle bir i&#351; yapt&#305;ysa gibi &ccedil;ok y&ouml;nl&uuml; bir veriye sahip olmam&#305;z&#305; sa&#287;l&#305;yor. </span></p><p class="c3"><span class="c6">Participant 4:</span><span class="c1">&nbsp;Many tools don&#39;t provide visual communication. And I can navigate and see, I can examine relationally. It&#39;s useful because it&#39;s multifaceted. Actually, in our tools, we can say something according to something. But if there is such data in an issue area and the developer did such a job, it allows us to have multifaceted data.</span></p><p class="c3"><span class="c7">Katilimci 3:</span><span>&nbsp;Bir de bizde &ccedil;ok refactoring oluyor, onun &ccedil;aresine bakabilse &ccedil;ok iyi olur. </span><span class="c6">Participant 3:</span><span class="c1">&nbsp;We also do a lot of refactoring, if it could handle that, it would be great.</span></p><p class="c3"><span class="c7">Katilimci 5:</span><span class="c4">&nbsp;Graph&#39;in expandable olmas&#305; bence &ccedil;ok iyi olmu&#351;. </span></p><p class="c3"><span class="c6">Participant 5:</span><span class="c1">&nbsp;The expandability of the graph is very good, I think.</span></p><p class="c3"><span class="c7">L:</span><span class="c4">&nbsp;Bir de bir tane survey daha g&ouml;nderece&#287;iz, onu da doldurursan&#305;z seviniriz. Onu sonra ile g&ouml;nderece&#287;im. &Ccedil;ok te&#351;ekk&uuml;r ederiz. &Ccedil;ok katk&#305;da bulundunuz. &Ccedil;ok sa&#287; olun, &ccedil;ok g&uuml;zel feedback&#39;ler ald&#305;k, kullanaca&#287;&#305;z. &Ccedil;ok sa&#287; olun. </span></p><p class="c3"><span class="c6">L:</span><span class="c1">&nbsp;We will also send another survey, we would appreciate it if you could fill it out. I will send it later. Thank you very much. You provided a lot of input. Thank you very much, we received great feedback, we will use it. Thank you very much.</span></p><p class="c3 c11"><span class="c4"></span></p><p class="c9"><span class="c4 c5"></span></p></body></html>